[{"id":463,"app_name":"Skip-Bo","status":1,"app_developer_name":"Mattel163 Limited","app_score":"4.8182735","app_category":"Card","group_label":"Card","app_package":"com.mattel163.skipbo","introduction":["Skip-Bo™, a classic card game that's enraptured millions across the globe, is now available for your mobile device. This engaging and strategic game, sharing similarities with Sudoku and coloring, elicits your problem-solving skills and fosters a competitive spirit. Beloved by players of all ages, this game has earned its niche in the card game tycoon and continues to entrance its followers with its simple yet intriguing gameplay."],"app_summary":"Solitaire Cards with a Twist"},{"id":464,"app_name":"MARVEL Future Fight","status":1,"app_developer_name":"Netmarble","app_score":"3.9197602","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.netmarble.mherosgb","introduction":["Welcome to the world of MARVEL Future Fight, a blockbuster action role-playing game that features your favorite Super Heroes and Villains from the Marvel Universe! This epic game lets you join the ranks of The Avengers, X-Men, Guardians of the Galaxy, and many others in an inter-galactic battle for survival. With over 200 characters available, you'll embark on breathtaking missions, upgrade your superheroes, and compete with others to stand tall as the universe's greatest hero. The world as we know it is under threat, and S.H.I.E.L.D’s director, Nick Fury, is calling on you to prepare for battle and defend your universe."],"app_summary":"Assemble the Avengers, X-Men, Guardians, and other heroes to save the Universe!"},{"id":465,"app_name":"Bluey: Let's Play!","status":1,"app_developer_name":"Budge Studios","app_score":"3.9837964","app_category":"Casual","group_label":"Casual","app_package":"com.budgestudios.googleplay.BlueyBLU","introduction":["Immerse yourself in Bluey's fun-filled world with Bluey: Let's Play! In this lovable app, you can explore, imagine, create, and play in the animated Blue Heeler's family home. Discover the joy of experiencing everyday family life through imaginative, playful adventures alongside Bluey and her friends. Designed as a calm and easy learning game for children of all ages, it is also a delightful treat for adults who may join in the fun!"],"app_summary":"Fun Kids Game for Boys & Girls! Explore, Imagine & Create with Bluey!"},{"id":470,"app_name":"Crossy Road","status":1,"app_developer_name":"HIPSTER WHALE","app_score":"4.5443482","app_category":"Action","group_label":"Action","app_package":"com.yodo1.crossyroad","introduction":["Embark on a whimsical journey of dexterity and quick attention with Crossy Road, a charming 8-bit arcade endless hopper game developed by Hipster Whale. The game takes a lighthearted spin on the classic 'why did the chicken cross the road' joke, throwing in a quirky melange of characters and obstacles. From a waddling chicken navigating its way across bustling highways, treacherous rivers, and relentless train tracks, to a candy-gobbling Unihorse, every turn on Crossy Road brings a riveting adventure. With over 250 million users worldwide, this viral sensation will indulge your senses in a gripping gameplay filled with delightful graphics designed in a distinctive retro style."],"app_summary":"Endless Arcade Hopper"},{"id":472,"app_name":"High Heels!","status":1,"app_developer_name":"Zynga","app_score":"3.7836487","app_category":"Action","group_label":"Action","app_package":"com.uncosoft.highheels","introduction":["Welcome to High Heels! - quite possibly the best high heels game you will ever play. This fiercely fashionable game combines fun, excitement, and a dash of glam as it takes you on an epic shoe race up, over, and across diverse obstacles. High Heels! offers a thrilling escapade where the aim is simple - the higher your heels, the easier it is to conquer the trail. But it's not all fun and games, as different fun and thrilling challenges await at every turn. Do you have what it takes to strut in style and rule the runway?"],"app_summary":"Design your heels, put on some makeup, join the baddies & heat up the shoe race!"},{"id":473,"app_name":"Age of Apes","status":1,"app_developer_name":"tap4fun","app_score":"4.5383563","app_category":"Strategy","group_label":"Strategy","app_package":"com.tap4fun.ape.gplay","introduction":["Welcome to a world where humans no longer exist, and it's the age of the apes! Age of Apes is a free-to-play MMO strategy game brought to you by Google Play, where your competitors are not humans, but monkeys. Hold on, it gets better; monkeys are at war to launch rockets into space in search of, well, bananas! As a player, you become part of the strongest Clan, create your gang, war with other apes, and be the first monkey to explore the galaxy. The fate of the future primate world lies in your paws!"],"app_summary":"Select Monkey Warriors! Win This Brutal Banana War!"},{"id":475,"app_name":"Lifting Hero","status":1,"app_developer_name":"Rollic Games","app_score":"4.66733","app_category":"Casual","group_label":"Casual","app_package":"com.my.lifting","introduction":["Lifting Hero, a fascinating weight lifting game has started to capture the heart of gamers with its simplicity and interesting motive. The unique premise of the game revolves around transforming a character into a behemoth just by lifting weights. In this game, you'll begin by lifting small weights, selling the muscle you gain, and purchasing massive new objects to lift. Engaging and truly addictive, this game is not just about clicking, it's also about strategy, decision-making, and constructive efforts."],"app_summary":"Tap tap tap, Lift faster!"},{"id":477,"app_name":"My Talking Tom Friends","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.2233233","app_category":"Casual","group_label":"Casual","app_package":"com.outfit7.mytalkingtomfriends","introduction":["My Talking Tom Friends is an immersive virtual pet game from Outfit7, the creators of the popular My Talking Tom series. Embrace the joy of taking care of six pet friends at once - Tom, Angela, Hank, Ginger, Ben, and Becca. In the vibrant house filled with fun and surprises, players get to interact, customize, personalize, and manage the pets, making for an engaging play experience"],"app_summary":"A world of friendship and fun is waiting, with My Talking Tom Friends."},{"id":478,"app_name":"Bejeweled Blitz","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.125505","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.ea.BejeweledBlitz_na","introduction":["Blow away your boredom with Bejeweled Blitz by PopCap Games, a high-octane match-3 gaming experience packed with excitement and dynamism. Over 125 million people worldwide have experienced the explosive fun delivered in just 60 seconds of gameplay where your goal is to detonate as many gems as possible. From Flame gems to Star gems to Hypercubes, discover the joy of creating cascades of gems and witnessing your score skyrocket. Take your game to a whole new league as you battle it out with friends or with other players globally, vying for top spots on the leaderboards."],"app_summary":"Compete with friends, jump on a quest, or just match gems for fun!"},{"id":479,"app_name":"Ultimate Bowmasters","status":1,"app_developer_name":"Playgendary Limited","app_score":"4.5193434","app_category":"Simulation","group_label":"Simulation","app_package":"com.playgendary.bowmastersremastered","introduction":["Step into the mesmerizing world of Ultimate Bowmasters, a premier action, aim and shoot game amped up with unique gameplay, enchanting graphics, and challenging levels. The arena has been set for epic battles where players flex their archery skills with a touch of strategy to bring down their foes. Amid the adrenaline-pumping, action-packed sequences, fun permeates every nook and corner, veiling even the most strenuous battles in the garb of sheer amusement. Ultimate Bowmasters is the wild ride you didn't realize you were missing all along! Embark on this thrilling journey to experience fear, thrill, victory and defeat all in one place."],"app_summary":"A crazy chapter in Bowmasters series! Ultimate characters and fun!"},{"id":480,"app_name":"MudRunner","status":1,"app_developer_name":"Focus Entertainment","app_score":"4.5652175","app_category":"Simulation","group_label":"Simulation","app_package":"com.focushome.MudRunnerAndroid","introduction":["MudRunner, a sensational off-road simulation game, branches out to your mobile device for an unparalleled gaming experience! Originating from a multi-million seller franchise, MudRunner puts you behind the wheel of incredible all-terrain vehicles, taking you on adrenaline-pumped drives across extreme landscapes. Brimming with gritty realism, the game tests your mettle as you dare to steer across wild Siberian terrain guided solely by map and compass."],"app_summary":"The ultimate off-roading game!"},{"id":482,"app_name":"aa","status":1,"app_developer_name":"General Adaptive Apps Pty Ltd","app_score":"4.2867227","app_category":"Strategy","group_label":"Strategy","app_package":"com.aa.generaladaptiveapps","introduction":["Introducing aa - the simplest, yet probably the most addictive game available on Google Play Store right. Described as the 'hello world' app for Android Phones & Tablets, aa takes you back to the yesteryears of gaming, reminiscent of the snake game on the old brick phone. Conceptualized and lovingly crafted in Australia by General Adaptive, the authentic and original aa holds a reputation that none of its clones are able to match. Get ready to experience the joy of simplicity, nostalgia, and pure fun with aa!"],"app_summary":"aa is the \"hello world\" app for Android Phones & Tablets."},{"id":483,"app_name":"Jurassic World™: The Game","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.156875","app_category":"Simulation","group_label":"Simulation","app_package":"com.ludia.jurassicworld","introduction":["Are you ready for a rampage-packed thrill that brings dinosaurs back to life? The creators of Jurassic Park™ Builder bring you the mastery of game building with Jurassic World™: The Game, an action-filled game that fuses dinosaurs with card play. This mobile game, inspired by the epic Jurassic World movie, lets you breed over 300 towering dinosaurs and battle it out with opponents around the globe. At your hand stands the opportunity to build the utopian theme park of tomorrow, packed with breathtaking, meat-ravaging dinosaurs from the film.","This game is designed for anyone who loves the mix of dinosaurs,  adventures, and card games. Stir into existence a park where your dinosaurs can grow and evolve. Join hands with Owen and Claire, and as you discover, feed, and genetically enhance your dinosaurs daily, you take the liberty of making Jurassic World™ your own."],"app_summary":"Return to Isla Nublar for your next adventure: Jurassic World™: The Game."},{"id":484,"app_name":"DC Heroes & Villains: Match 3","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.3893676","app_category":"Casual","group_label":"Casual","app_package":"com.ludia.dc2021","introduction":["Venture into the exciting world of the DC universe with DC Heroes & Villains: Match 3, an engrossing RPG match-3 superhero game. As the universe's last bastion, you will collect, train, and lead an array of legendary superhero DC icons like Batman, Superman, Wonder Woman, The Joker–and many more. Their superpowers may have been stolen by a mysterious pulse, but you have the power to overcome this cosmic injustice and unite your very own team of DC Superheroes and Super-Villains. Whether the alleyways of Gotham or the depths of Atlantis, prepare to engage in strategic battles with iconic characters from DC Comics in thrilling match-3 games."],"app_summary":"Collect Batman, Superman, Aquaman & more in this Action Match-3 Puzzle RPG"},{"id":488,"app_name":"Slap Kings","status":1,"app_developer_name":"Lion Studios","app_score":"4.560978","app_category":"Action","group_label":"Action","app_package":"mobi.gameguru.slapkings","introduction":["Welcome to the world of Slap Kings! This is the perfect game for those who enjoy a blend of strategy, timing, and amusement. The game places you in a Slap-Or-Be-Slapped situation where your power, timing skills and strength will be tested to generate the most sensational slap. With every smack packing a punch, have your opponents catapulted out of the ring. Dive into a face-smacking tournament and let's see how far you can go. Can you unlock your special power – the Golden Fire Fist?"],"app_summary":"Become the world's best slapper!"},{"id":489,"app_name":"Fruit Ninja 2 Fun Action Games","status":1,"app_developer_name":"Halfbrick Studios","app_score":"4.24581","app_category":"Action","group_label":"Action","app_package":"com.halfbrick.fruitninjax","introduction":["After 10 years, Fruit Ninja 2 Fun Action Games is back with a bang, and it's more fun than ever! If you're looking for an action-packed game, loaded to the brim with fruit slicing fun, then your search ends here. Whether you're endowed with razor-sharp reflexes, profound wisdom, or you simply harbor a deep disdain for organic food, this game promises incessant amusement. Channel your inner warrior with adrenaline-pumping action that's guaranteed to keep you on your toes, as you slice your way through countless fruits in the ultimate test of your skills."],"app_summary":"Experience watermelon slicing frenzy in Fruit Ninja2!"},{"id":490,"app_name":"Head Monster: DOP Story","status":1,"app_developer_name":"Debbie Shine","app_score":"3.970297","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.toiletstory.toiletdop.deleteonepart","introduction":["Embark on an enthralling adventure in the endlessly amusing world of 'Head Monster: DOP Story'. In this thrilling puzzle challenge, you become a part of an engaging face-off between the Head Monster and the intrepid Cameraman. Your role is pivotal in helping the Cameraman document flood-proof toilets while saving the city from the mysteriously attacking Toilet Army. The game instantly captures attention with its funny characters and exciting stories. Unfold amusing narratives, daring rescues, secret discoveries and much more, while making use of your analytical and deductive skills to ace the puzzles."],"app_summary":"Become a master of solving the mysterious stories of Head Monster: DOP Story"},{"id":494,"app_name":"Dark Monster Life Challenge 5","status":1,"app_developer_name":"IDLERO","app_score":"3.275","app_category":"Action","group_label":"Action","app_package":"com.weup.dark.monster.life.challenge.chapter5","introduction":["Step into the thrilling world of Dark Monster Life Challenge 5, the latest installment in the crowd-pleasing Monster War series. The game picks up where parts 3 and 4 left off, immersing players in the chilling mysteries of an abandoned kindergarten where the protagonist was left behind and his classmates mysteriously vanished. With exciting characters and eerie mysteries, Dark Monster Life Challenge 5 offers a mind-bending journey that'll keep you on the edge of your seat.","Prepare to battle against formidable foes, including Ziphius - the biggest character in the series thus far. Encounter GOOBER, a petrifying monster who serves as a colossal hurdle preventing you from making progress. Watch out for the enigmatic Baby who, despite being an ally, also serves as a cornerstone for you to complete your challenge. So fasten your seatbelts and revel in this dramatic, adrenaline-filled ride of Dark Monster Life Challenge 5."],"app_summary":"Discover the season 5 of the monster school of the Dark Monster Life Challenge 5"},{"id":497,"app_name":"Vehicle Masters","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.235821","app_category":"Simulation","group_label":"Simulation","app_package":"com.pd.vehiclemasters","introduction":["Are you yearning for a driving game that combines meticulous precision and a generous dose of adrenaline? Look no further as we introduce you to the 'Vehicle Masters', a unique simulator game where you can savor the delight of maneuvering a variety of heavy vehicles through tight corners without any scrapes or crashes. Unlike typical racing games filled with mind-blowing speed and havoc, Vehicle Masters brings you a soothing and realistic experience that puts your advanced driving skills to the test."],"app_summary":"Dig deep into a huge collection of vehicles and driving situations"},{"id":499,"app_name":"Castle Clash: World Ruler","status":1,"app_developer_name":"IGG.COM","app_score":"4.0565114","app_category":"Strategy","group_label":"Strategy","app_package":"com.igg.castleclash","introduction":["Immerse yourself in the tumultuous world of Castle Clash: World Ruler - A game marking the dawn of a new chapter after ten years of thrilling clashes. As you journey through Narcia in the Forsaken Land, you will join other Clashers to face formidable rivals. By showcasing your skills and upgrading your heroes, you can conquer bosses and claim the ultimate victory. The game is a perfect blend of exciting combat and fast-paced strategy, where you are tasked with building a grand empire and making a name for yourself in the vast annals of history."],"app_summary":"A decade-old classic embarks on a new journey of global competition"},{"id":500,"app_name":"Talking Ben the Dog","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.2376432","app_category":"Entertainment","group_label":"Entertainment","app_package":"com.outfit7.talkingben","introduction":["Talking Ben the Dog is a whimsical app that revolves around Ben, a retired chemistry professor who loves tranquility and enjoys simple pleasures of life like eating, drinking and reading newspapers. This app allows you to converse, tease and play with the animated character, Ben. But, you have to persistently bug him to make him put down his newspaper. Once he does that, fun times ensue! From talking, poking or tickling him to having a telephone conversation with him, the interactions are plenty and entertaining. Furthermore, when you usher Ben to his lab, he becomes as enthusiastic as a pup where you can perform chemistry experiments by mixing different test tubes to witness amusing reactions."],"app_summary":"Meet Talking Tom's best \"friend\" Ben!"},{"id":234,"app_name":"Worlds FRVR","status":1,"app_developer_name":"FRVR Lisbon","app_score":"4.090909","app_category":"Adventure","group_label":"Adventure","app_package":"com.frvr.worlds","introduction":["Get ready for an incredible sandbox experience with Worlds FRVR, a real-time multiplayer block builder that brings endless possibilities. Whether it's making a unique creation with friends or visiting the ingenious designs of others, Worlds FRVR takes creativity to a new level. The world-building fun starts right at your fingertips. With numerous existing worlds created by its large, vibrant community, you won't run out of exciting worlds to explore."],"app_summary":"Build & Share with friends your World!"},{"id":381,"app_name":"Standoff 2","status":1,"app_developer_name":"AXLEBOLT LTD","app_score":"4.251517","app_category":"Action","group_label":"Action","app_package":"com.axlebolt.standoff2","introduction":["Standoff 2 is a fast-paced, first-person shooter game that boasts a legacy of adrenaline-fueled action. The game proudly caters to a diverse audience of over 200 million players worldwide. It's time to grab your weapon of choice and join the fray! The game aims to deliver an intense gaming experience that merges eye-catching graphics, detailed maps, and skill-based gameplay in a seamless blend of excitement and challenges."],"app_summary":"Take action in renewed Standoff in the form of a dynamic FPS!"},{"id":383,"app_name":"Dancing Cats - Music Tiles","status":1,"app_developer_name":"Cobby Labs","app_score":"4.6377006","app_category":"Music","group_label":"Music","app_package":"com.rhythmdance.taptile.dancingcats","introduction":["If you're on the hunt for ultra-adorable cat games combined with the rush of exhilarating music games, then look no further than Dancing Cats - Music Tiles. This game is a purr-fect blend of music, rhythm, and kittens, letting players groove to the beat alongside super cute kitties. The game provides you with super amazing and beautiful 'Cat Music', that's a delightful mix of pop music and cute 'meowing' sounds. It offers a range of music from global hit songs to your favorite indie tracks, ensuring there's always a tune you'll love to tap along to."],"app_summary":"Dancing with cute cats! Music & Pop songs"},{"id":395,"app_name":"Country Balls: World War","status":1,"app_developer_name":"MAD PIXEL GAMES LTD","app_score":"4.292531","app_category":"Strategy","group_label":"Strategy","app_package":"state.countryballs.dictators.io","introduction":["Country Balls: World War is a highly strategic and addictive real-time strategy game that will take you into fierce battles over territories, test your wits, and make your heart race. As the commander of your army, you will need to command your troops in epic battles, make deals with other countries, and build your empire to establish world domination. You'll face economic challenges, political negotiations, limited resources, and the constant threat of enemy takeover. But remember, this isn't just about conquering the world—it's about survival."],"app_summary":"Control your army, use logic & strategy to win the battles. Become the champion!"},{"id":441,"app_name":"OTR - Offroad Car Driving Game","status":1,"app_developer_name":"DogByte Games","app_score":"4.5369773","app_category":"Racing","group_label":"Racing","app_package":"com.dogbytegames.offtheroad","introduction":["Get ready for a thrilling joyride with OTR - Offroad Car Driving Game, developed by the creators of Offroad Legends 2, Blocky Roads, Zombie Offroad Safari, Redline Rush, and Dead Venture. This open-world off-road driving simulator gives you the freedom to explore on land, sea, or air, tackling mountains, islands, and more. The stunning visuals and realistic physics take the gaming experience up a notch. Climb your way up to the hilly terrains or take a peaceful walk; the game offers unlimited adventures. You engage in challenges, collect rewards, and upgrade your vehicle to conquer the most rugged terrains."],"app_summary":"Extreme open world off-road car driving simulator"},{"id":446,"app_name":"Match Frenzy: 1 Line Draw","status":1,"app_developer_name":"JoyPlay Pte.Ltd.","app_score":"3.9473684","app_category":"Casual","group_label":"Casual","app_package":"com.joyplay.matchfrenzy","introduction":["Say hello to Match Frenzy: 1 Line Draw, a classic 3D matching game, packed to the brim with electrifying challenges and high stakes intense gameplay! If you enjoy cracking puzzles, forming teams, and competing with gamers worldwide, this game is your one-stop arena. Not only can you demonstrate your exceptional matching prowess, but you can also invite your friends along for a strategic showdown. Play, compete, and rise up the ranks in this immersive gaming experience!"],"app_summary":"Play One Line Draw and Triple Match Game, start your happy challenging journey!"},{"id":458,"app_name":"911 Emergency Dispatcher","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.4222918","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.fivebits.emeregencydispatch","introduction":["911 Emergency Dispatcher is a thrilling simulation game available on Google Play, with its app id as com.fivebits.emeregencydispatch. Do you have the quick-thinking and decision-making skills needed during critical emergencies? In this game, you become the unsung hero, the emergency dispatcher whose job is to quickly coordinate and dispatch help for a variety of emergencies. With every call, you will be responsible for making tough decisions that could potentially save lives. The stakes are high, the calls are real and the impact of your decisions is profound.","Through a combination of strategic thinking and priority setting, you are equipped to manage crises effectively. The game progresses by taking you through several scenarios and situations, each growing in complexity and intensity. Every choice you make will alter the course of the emergencies unfolding, ensuring that you are inevitably on your toes, fully engrossed in your role as an emergency dispatcher."],"app_summary":"Send the HELP needed NOW!"},{"id":485,"app_name":"Monument Valley","status":1,"app_developer_name":"ustwo games","app_score":"4.76542","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.ustwo.monumentvalley","introduction":["Step into the surreal world of Monument Valley, a mobile gaming marvel characterized by its fantastical architecture and mind-bending geometry. You're guided on a visual journey as a silent princess called Ida, navigating her through an array of stunning landscapes and mysterious monuments. Unlock hidden paths, unfold stunning optical illusions, and outwit the puzzling Crow People all while immersing yourself in a hand-crafted world that blurs the lines between reality and fiction."],"app_summary":"An illusory adventure of impossible architecture and forgiveness"},{"id":533,"app_name":"Monument Valley 2","status":1,"app_developer_name":"ustwo games","app_score":"4.684153","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.ustwo.monumentvalley2","introduction":["Step into the intriguing world of Monument Valley 2, a sequel to the award-winning Monument Valley. Incorporating a fascinating blend of magical architecture and dreamy puzzles, the game introduces a brand new adventure set in a picturesque and seemingly impossible world. As a player, you're tasked to guide a mother and her child on an enlightening journey through ever-changing environments, manipulating aspects of architecture to pave their path."],"app_summary":"Immerse yourself in this impossibly beautiful mobile adventure."},{"id":454,"app_name":"Clusterduck","status":1,"app_developer_name":"PIKPOK","app_score":"4.5964513","app_category":"Casual","group_label":"Casual","app_package":"com.pikpok.wtd.play","introduction":["Clusterduck is a unique and fun-filled game that answers the age-old question - What came first, the duck or the egg? This game is all about hatching and mutating as many ducks as possible. The more ducks you hatch, the more bizarre things start to occur. These ducks start to genetically mutate and with each generation, the chances of something going horribly wrong increase exponentially. Have you ever seen a duck with a sword for a head or a horse hoof for a wing? In this game, you will encounter ducks that have gone completely bonkers. This game takes you to a whimsical world where the most incredible and wacky things are part of the ordinary."],"app_summary":"Breed weird ducks and watch them mutate into bizarre creatures"}]
