[{"id":537,"app_name":"Build Master: Bridge Race","status":1,"app_developer_name":"UAC Studio","app_score":"3.568","app_category":"Strategy","group_label":"Strategy","app_package":"com.readygo.aps.gp","introduction":["Dive into the captivating world of Build Master: Bridge Race, a thrilling casual SLG mobile game that puts your bridge-building skills to the test! Embark on unforeseen journeys across breathtaking landscapes, face challenges like no other, and get opportunities to showcase your engineering talents. Brace for suspenseful moments as you experience the highs of your bridge withstanding the weight and the lows of witnessing crashes and collapses. Along with the excitement and thrill, this game gives you valuable lessons that will drive you to refine your skills and become the master bridge builder."],"app_summary":"Build a city of your own to prove to yourself you are the Master Builder!"},{"id":388,"app_name":"Mob Control","status":1,"app_developer_name":"VOODOO","app_score":"4.2712784","app_category":"Arcade","group_label":"Arcade","app_package":"com.vincentb.MobControl","introduction":["Unleash your inner strategy commander with Mob Control: The Ultimate Tower Defense Clash! This tower defense game brings an unparalleled strategy and action-packed experience that tests your skills, wit, and tactical prowess. With an array of features and a unique gameplay that's oddly satisfying, Mob Control is your gateway to tower defense supremacy. Develop your base, earn championship stars, unlock and upgrade your cards, rise through the ranks and assert your dominance in thrilling game modes. The epic showdown is never too far away in the world of Mob Control!"],"app_summary":"Collect, Grow, Multiply!"},{"id":386,"app_name":"Mini World: CREATA","status":1,"app_developer_name":"MINOVATE HONG KONG LIMITED","app_score":"4.110789","app_category":"Adventure","group_label":"Adventure","app_package":"com.playmini.miniworld","introduction":["Experience limitless exploration and adventure in Mini World: CREATA, a 3D free sandbox game. It lets you experience the sheer joy of creating your dream worlds without any purchasing limitations or the need to grind or level up. Whether you're an explorer, a warrior, or a constructor, the game world offers endless possibilities. No in-app purchases gates or progress hurdles to dampen your gaming enthusiasm, Mini World: CREATA is a haven for free-to-play enthusiasts who value true gaming freedom and creativity."],"app_summary":"Mini World 2.0"},{"id":538,"app_name":"Makeup ASMR: Makeover Story","status":1,"app_developer_name":"Stella Joy Studio","app_score":"4.4400873","app_category":"Simulation","group_label":"Simulation","app_package":"com.makeoverstory.makeupasmr","introduction":["Immerse yourself in a beautifully crafted world of cosmetics and beauty in the app, Makeup ASMR: Makeover Story. This game enables you to step into the shoes of a beauty expert, transforming a variety of fascinating characters into their most enchanting selves, giving you a uniquely satisfying gaming experience. Whether you're turning a rotting mermaid into a human or a scruffy beggar into a handsome man, get ready to wave your makeup wand and unleash your creativity! And be on the lookout, as the most unexpected situations (think bees invading eyes or kissing with cracked lips) may pop up, adding an extra dose of thrill to your playtime."],"app_summary":"Satisfying skincare & dress up"},{"id":539,"app_name":"Figure Fantasy","status":1,"app_developer_name":"KOMOE TECHNOLOGY LIMITED","app_score":"4.116848","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.komoe.fsgp","introduction":["Step into the miniature world with Figure Fantasy, a 3D idle mobile game that allows you to take on the role of a master figurine collector. This unique adventure game presents high precision rendering of every inch of your collection, replicating the real-life material textures and light refraction. Immerse yourself with hundreds of figurines to collect in your custom display cabinet, engage in strategic battles and enjoy the simplicity of idle gameplay."],"app_summary":"3D idle figurine mobile game, Figure Fantasy has arrived in style!"},{"id":391,"app_name":"Outlets Rush","status":1,"app_developer_name":"Supercent","app_score":"4.232906","app_category":"Simulation","group_label":"Simulation","app_package":"com.corestudios.storemanagementidle","introduction":["Outlets Rush is an engaging, idle, time-management game that thrusts you into the heart of the retail industry. As an up and coming retail tycoon, your task is to transform your simple shopping city into a bustling metropolis brimming with endless possibilities. From designing and running various iconic and high-end stores to hiring and managing capable staff, Outlets Rush offers a deeply immersive gaming experience that keeps you on your toes whilst providing idle thrills, and mega shopping excitement!"],"app_summary":"Build your mega shopping empire, the idle tycoon game where you’re the boss!"},{"id":541,"app_name":"Magic Revenge：Casual IDLE RPG","status":1,"app_developer_name":"TOJOY GAME","app_score":"4.4587154","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.tojoy.magicrevenge","introduction":["Get ready for an epic journey in a world of magic and myth with Magic Revenge: Casual IDLE RPG. This casual action-packed RPG launches you into a realm where legendary heroes await your command. With an arsenal of over 100 heroes to choose from, every battle is a fight for freedom and honor. The game blends exciting auto-play gameplay with strategic team assembly and hero upgrades to make your gaming experience truly unique. And there's no need to limit your battles - even when you are offline, your heroes continue the fight on your behalf."],"app_summary":"Assemble heroes to a journey of myth and lead your team to the final victory!"},{"id":542,"app_name":"Offroad Outlaws","status":1,"app_developer_name":"Battle Creek Games","app_score":"4.5121107","app_category":"Racing","group_label":"Racing","app_package":"com.battlecreek.offroadoutlaws","introduction":["Roll up your sleeves and ignite your adventure spirit with Offroad Outlaws. This game brings to life your ultimate off-road fantasies in the most realistic and action-packed way possible. It's all about mud, dirt, rocks, trucks, drones, and most significantly, it offers endless fun. Offroad Outlaws gives you the freedom to play the way you want. You're to design, set up, and control your rig, face countless challenges, and engage your friends in exciting multiplayer modes. With its open-world maps, get a chance to explore diverse trails and track terrains."],"app_summary":"Trail ride with friends through an open world in trucks, quads, SXSs, and bikes!"},{"id":401,"app_name":"Cell to Singularity: Evolution","status":1,"app_developer_name":"ComputerLunch","app_score":"4.54989","app_category":"Simulation","group_label":"Simulation","app_package":"com.computerlunch.evolution","introduction":["Delve into the gripping narrative of evolution with Cell to Singularity: Evolution, a cosmic clicker game. Go on a journey, that began over 4.5 billion years ago, from a lifeless Solar System to a flourishing civilization at the brink of a technological singularity. Witness the humble beginnings of life from the primordial soup on Earth and slowly unravel the evolution game with each click. Uncover the path that led to significant milestones and are yet to be explored future evolutions."],"app_summary":"Tap into the epic story of evolution, dinosaurs, technology and beyond"},{"id":402,"app_name":"Bowmasters","status":1,"app_developer_name":"Playgendary Limited","app_score":"4.3858542","app_category":"Action","group_label":"Action","app_package":"com.playgendary.bowmasters","introduction":["Step into an epic world of action and adventure with Bowmasters, the world-renowned multiplayer game that's filled with non-stop fun and excitement. Featuring a slew of characters and diverse weapons, you're sure to have a grand time as you put your aim and shooting skills to the test. This brand-new version embraces the classic Bowmasters charm whilst injecting some upbeat and progressive elements to elevate your gaming experience."],"app_summary":"Join the amazing archery arcade"},{"id":543,"app_name":"Sonic Dash - Endless Running","status":1,"app_developer_name":"SEGA","app_score":"4.6824613","app_category":"Arcade","group_label":"Arcade","app_package":"com.sega.sonicdash","introduction":["Sonic Dash - Endless Running, developed by SEGA, brings Sonic the Hedgehog and his friends in a heart-pounding endless runner game. This fun-packed adventure game lets you race in an action-filled world with high-octane tracks, challenging your reflexes at every turn. With mesmerizing graphics and invigorating music, it's a whirlwind of excitement that will keep adults and kids alike hooked. Unleash your inner Sonic, Knuckles, or Tails, and run faster than ever before, experiencing the thrill of supersonic speed in an adventurous world!"],"app_summary":"Join Over 600 Million Runners in Sonic's Original Endless Running Game!"},{"id":544,"app_name":"ASMR Slicing","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.4475403","app_category":"Simulation","group_label":"Simulation","app_package":"com.crazylabs.asmr.cut","introduction":["ASMR Slicing is a cutting-edge game from CrazyLabs that takes inspiration from the satisfying world of ASMR. Whether you’re a kinetic sand slice master or just into strangely calming gameplay, this is the ideal destination. Ever seen a block of soap or a piece of kinetic sand being cut and felt a strange satisfaction? That soothing haptic feedback, the sound of the knife effortlessly slicing through, the smooth edges forming – ASMR Slicing brings you all this and more right on your handheld device. Indulge in flying cut, slice and dice in this ASMR simulator studio 3D, and expect a mesmerizing and oddly satisfying experience."],"app_summary":"Satisfying flying cut ASMR simulator game! Slice it all to become a slice master"},{"id":545,"app_name":"Guardian Tales","status":1,"app_developer_name":"Kakao Games Corp.","app_score":"4.5785937","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.kakaogames.gdts","introduction":["Guardian Tales is a compelling mobile action-adventure game that takes players on a thrilling journey through the magical world of Kanterbury, featuring an engaging mix of puzzle-solving, strategic action combat, and role-playing elements. The world is brimming with nostalgia, complete with epic boss battles, charming visuals, and a rich storyline sprinkled with humor and clever pop-culture references. As a Legendary Guardian, you are tasked to thwart the Invaders' onslaught and restore peace in this troubled world."],"app_summary":"A Link to Classic Adventure"},{"id":406,"app_name":"Dawn of Zombies: Survival Game","status":1,"app_developer_name":"Royal Ark","app_score":"4.3363047","app_category":"Action","group_label":"Action","app_package":"com.survival.last","introduction":["Dive into the fast-paced and intense world of Dawn of Zombies: Survival, a multiplayer online survival game that lets you experience the aftermath of a nuclear apocalypse first hand. The story unfolds in the Last Territories, the only known land to have mysteriously survived the Conflagration. As a born survivor, you will face hunger, diseases, radiation, nuclear aberrations, and deadly enemies including zombies, cultists, and bandits. Will you rise to the occasion and dominate the post-apocalyptic world? The game promises a thrilling survival adventure, complete with realistic graphics and a compelling action story."],"app_summary":"DOZ was made for true fans of zombie survival games! Craft, shoot, and survive!"},{"id":409,"app_name":"Last War:Survival Game","status":1,"app_developer_name":"FirstFun","app_score":"4.0599127","app_category":"Strategy","group_label":"Strategy","app_package":"com.fun.lastwar.gp","introduction":["Immerse yourself in the apocalyptic world of Last War: Survival Game, where zombies are not just figments of your imagination but a harsh reality. This global zombie infestation brought upon by a mysterious plague leaves you, a lone survivor, with the crucial goal - to fight and survive, while holding onto your humanity. This game is a thrilling combo of endless survival and strategic planning, throwing an array of unique challenges at every turn.","Not merely a game of survival, every action you make influences the future of the other survivors. You rise as the beacon of hope in a shelter draped in darkness, assembling your dream team to exterminate the zombies, while meticulously building and developing your base. Dive deep into this strategic game and lead your team towards a glimpse of hope amidst the zombie apocalypse."],"app_summary":"Join Last War: Survival Game - strategic zombie dodging and quick combat await!"},{"id":548,"app_name":"Survivor.io","status":1,"app_developer_name":"Habby","app_score":"4.5544243","app_category":"Adventure","group_label":"Adventure","app_package":"com.dxx.firenow","introduction":["Situated against the backdrop of a city under siege, Survivor.io is a thrilling action-packed game where you are humanity's last hope. When a multitude of dangerous zombies attack the city, it's warriors like you who must step up to save the day. This game offers an all-new roguelite skill experience that feels fresh every time you play alongside different levels of difficulty to challenge your skills."],"app_summary":"Survive the Monsters, Survive the Fun!"},{"id":549,"app_name":"Cover Strike - 3D Team Shooter","status":1,"app_developer_name":"FPS Shooter & Action Game","app_score":"4.0503283","app_category":"Action","group_label":"Action","app_package":"com.gun.black.ops","introduction":["Unleash your inner tactician and test your mettle in Cover Strike - 3D Team Shooter, an exhilarating 3D first person shooter game. Designed with fans of FPS games in mind, this action-packed offering takes your gaming experience to an entirely new level. Engage in tense battles against terrorists, master tactically diverse maps, and harness an arsenal of powerful, modern guns. The challenge isn’t for the faint-hearted – survival isn’t the goal, victory is. Better yet, it’s totally free to play!"],"app_summary":"FPS team shooting game.3D offline Counter Terrorist game. 3vs3 team battles."},{"id":550,"app_name":"Tic Tac Toe - 2 Player XO","status":1,"app_developer_name":"CDT Puzzle Studio","app_score":"4.2030077","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.cdg.tictactoe","introduction":["Immerse yourself in the classic strategy game of Tic Tac Toe with a fresh and visually appealing twist. The Tic Tac Toe - 2 Player XO app on Google Play offers a revamped gaming experience that will capture the interest of both new and seasoned players. Designed with smart AI and a 2-player mode, this game is meant to cater to all, providing endless hours of strategic fun. Further enhanced with a distinct glow effect and cool animations, it presents a modern take on the traditional pastime game that we all know and love. Don't just settle for the ordinary — delve into the extraordinary world of Tic Tac Toe - 2 Player XO instead."],"app_summary":"Tic Tac Toe & All In One Board Games Collection"},{"id":553,"app_name":"Smash Hit","status":1,"app_developer_name":"Mediocre","app_score":"4.5546784","app_category":"Arcade","group_label":"Arcade","app_package":"com.mediocre.smashhit","introduction":["Welcome to an extraordinary world called Smash Hit, a free-to-play game that combines elements of rhythm, destruction, and precision. Immerse yourself in a captivating, surreal journey through an otherworldly dimension where your every move creates a visual and auditory symphony. The gameplay requires a heightened sense of concentration, timing, and focus in order for you to smash your way through stunning glass obstacles that stand defiant in your path. Get ready to witness an intricate and beautiful destruction like never before, right at your fingertips."],"app_summary":"Prepare for a transcendental, ambient journey through time and space."},{"id":416,"app_name":"Smashing Car Compilation Game","status":1,"app_developer_name":"Zego Studio","app_score":"3.2346938","app_category":"Racing","group_label":"Racing","app_package":"com.jura.car.crash","introduction":["Immerse yourself in a different kind of thrill, courtesy of Smashing Car Compilation Game. This free, adrenaline-boosting game is everything a daring speed addict needs. Experience the ultimate thrill of driving at high speeds and crashing into other cars without any real-world consequences. Explore various maps and custom-built racing trails in this fast-paced simulation game. The game's lifelike graphics and intricate damage physics make it one of the most engaging car crash games on Google Play."],"app_summary":"The car crash game with realistic and stunning effects"},{"id":554,"app_name":"Ice Scream 1: Scary Game","status":1,"app_developer_name":"Keplerians Horror Games","app_score":"4.3213735","app_category":"Action","group_label":"Action","app_package":"com.keplerians.icescream","introduction":["Welcome to Ice Scream: Scary Game, a horror-filled adventure that is sure to send chills down your spine. The game revolves around a nefarious ice-cream seller named Rod who kidnaps children using his ice cream van, and you've just witnessed your friend Charlie being taken. Unveil the mystery behind Rod's evil plan and rescue children from the icy clutches of this terrifying foe. This game combines a unique blend of horror, mystery, and action, promising an adrenaline-pumping experience that will keep you on your toes."],"app_summary":"Discover the scary ice cream seller and play all his horror games and adventures"},{"id":421,"app_name":"Dice Dreams™️","status":1,"app_developer_name":"SuperPlay.","app_score":"4.7349763","app_category":"Casual","group_label":"Casual","app_package":"com.superplaystudios.dicedreams","introduction":["Dice Dreams™️ by SuperPlay Studios is an enchantingly fun, multiplayer board game experience in the palm of your hands. Played by millions around the world, it invites you to step into a magical kingdom where rolling dice determines your fate. You are tasked with embarking on unforgettable adventures, stealing coins from other players, constructing your own epic kingdom, and progressing towards the coveted Dice King title. Along this quest, you'll encounter engaging personalities, exciting twists and turns, and countless opportunities for thrills and rewards."],"app_summary":"Roll the Dice and Build Your Kingdom - Can You Beat Your Friends?"},{"id":436,"app_name":"Camo Sniper","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"3.0663266","app_category":"Casual","group_label":"Casual","app_package":"com.foursgames.camouflagesniper","introduction":["Camo Sniper is an exhilarating and challenging sniper game available on Google Play. Immerse yourself in a world filled with covert operations and high-stakes missions, where your primary objective is to assassinate camouflaged enemies. Your targets are cunningly hidden, constantly on the move, making it a real test of your focus and precision. Every shot counts in this high-pressure setting and one bullet could mean the difference between victory and defeat. Be prepared to push your limits and challenge your shooting skills to the next level. It's not just a game, it's a test of your psychological grit and sniper skills in the heat of battle."],"app_summary":"Be the best sniper!"},{"id":555,"app_name":"Criminal Case","status":1,"app_developer_name":"Pretty Simple","app_score":"4.592242","app_category":"Adventure","group_label":"Adventure","app_package":"com.prettysimple.criminalcaseandroid","introduction":["Unleash your inner detective with Criminal Case – the ultimate free hidden object game! Deemed as the #1 game in this genre, Criminal Case transports you to the gloomy and corrupt city of Grimsborough where unsolved murder cases abound. Calls are in dire need for seasoned investigators and skilled detectives to probe into these mysteries. Here, you’ll get to discover whodunnit to Rosa Wolf and more as you immerse yourself in a web of crime, thrill, and action. Download now and embark on a captivating journey of hidden object discovery and top-notch detective work!","With Criminal Case, you won't be just solving puzzles or finding hidden items, but you will be at the front line of justice, investigating crime scenes, interrogating suspects, and bringing murderers to justice. You will dive into crime scenes, searching for clues and evidence to help you solve the case. Just like a true detective, you'll scrutinize every detail, examine clues, analyze samples, and interrogate witnesses and suspects to finally bring the killer to justice. Playing Criminal Case involves critical thinking, sharp observation skills, and relentless dedication to solving murder mysteries. If you've always fancied yourself as a crime-solving detective, Criminal Case is the perfect game for you."],"app_summary":"The award winning crime investigation game is now on the Google Play Store!"},{"id":560,"app_name":"Mobile Legends: Adventure","status":1,"app_developer_name":"Moonton","app_score":"4.5501614","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.moonton.mobilehero","introduction":["Mobile Legends: Adventure (MLA) is a casual idle RPG that slots seamlessly into your everyday routine. It invites you on an epic adventure featuring over 100 unique heroes who are ready to save the Land of Dawn from annihilation. Built around a deeply engaging story of a terrifying prophecy, MLA effortlessly blends strategy, role-playing, and auto-battling elements. As an extension of the famed Mobile Legends: Bang Bang universe, it repurposes familiar faces, giving them a fresh twist with a 2D anime art style."],"app_summary":"Collect idle rewards, build your unique lineup, and let your heroes do the rest!"},{"id":426,"app_name":"Disney Frozen Adventures","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.3612075","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.jamcity.blackforest_goo","introduction":["Enter into the enchanting world of Disney's Frozen via the thrilling match 3 puzzle adventure game, Disney Frozen Adventures. You join the beloved characters Elsa, Anna, and Olaf in a mission to build, renovate, and spruce up the Kingdom. Immersing yourself in this fun-filled game gives you a seat in creating the world depicted in the globally-adored Frozen & Frozen 2 movies. Design, decorate and bring to life the Kingdom of Arendelle and beyond, all while strategically playing captivating match-3 puzzle games."],"app_summary":"Immerse yourself in the World of Frozen and play match-3 puzzle games"},{"id":427,"app_name":"Bricks King","status":1,"app_developer_name":"Prota Games","app_score":"4.17","app_category":"Casual","group_label":"Casual","app_package":"com.protagames.bricks","introduction":["Bricks King, launched by Prota Games, is an adrenaline-pumped Casual Brick Breaker game that promises an unmatched gaming experience. With its stunning visual graphics and rebellious gameplay, Bricks King adds a modern spin to the classic brick-breaking game genre. Featuring over 300 levels of thrilling challenges, players are bound to be engrossed in a world of bricks and balls for hours. The mission is simple but engaging - breaking as many bricks as possible to move onto the next level. The perfect blend of strategy and action, Bricks King offers robust gameplay that serves the appetite of both novice and veteran gamers."],"app_summary":"Break bricks with clear, fluid gameplay. Use powerups and enjoy chain reactions!"},{"id":561,"app_name":"The Grand Mafia","status":1,"app_developer_name":"Phantix Games","app_score":"4.5016313","app_category":"Strategy","group_label":"Strategy","app_package":"com.yottagames.gameofmafia","introduction":["Introducing 'The Grand Mafia,' an intense mafia-themed strategy game allowing players to dive headfirst into the cutthroat world of organized crime. As the head of your own criminal empire, you'll take over territories, rally your crews, seek revenge for your fallen comrade, and fight tooth and nail to recapture the respect that was once yours. The aim? To become the undisputed ruler of the city. If you're a fan of mafia games or films, this is a game you simply can't miss."],"app_summary":"Take over the Underworld!"},{"id":562,"app_name":"Run of Life","status":1,"app_developer_name":"VOODOO","app_score":"3.5511482","app_category":"Arcade","group_label":"Arcade","app_package":"com.tarekmongy.RunofLife","introduction":["Are you ready to sprint through the journey of a lifetime? Introducing Run of Life, a riveting and uniquely designed game from Google Play. This exciting application plunges you into a never-ending rush of growing older and younger with every stride. The objective is simple yet electrifying - gather items that diminish your years and avoid traps setting you forward in time. But beware, get too old and it's game over! The Run of Life is an adrenaline-filled race where every moment draws you closer to your fate - literally."],"app_summary":"How old will you be?"},{"id":563,"app_name":"My Perfect Hotel","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.3633757","app_category":"Arcade","group_label":"Arcade","app_package":"com.master.hotelmaster","introduction":["Dive into a world of hospitality with the My Perfect Hotel app. This fun and fast-paced time-management game allows you to start from the ground up, aiming to build an accommodation empire. It will keep you occupied as you strive to demonstrate your dedication to top-notch service and hospitality. You'll have the opportunity not only to manage your hotel but also to invest wisely in staff and property improvements to become a true moghul in the thriving hotel industry.","Begin your journey as a simple bellhop, single-handedly tending to innumerable tasks, before climbing up the hotel echelon. You'll be cleaning rooms, greeting guests at reception, and manage everything with finesse. With various hotels to explore and expand, dozens of unique upgrades to make, and exotic locations to choose from, the world of hotel management opens up a plethora of possibilities to unleash your potential."],"app_summary":"Dive straight into the fast-paced world of hospitality provision!"},{"id":434,"app_name":"Goose Goose Duck","status":1,"app_developer_name":"Gaggle Studios, Inc.","app_score":"3.844358","app_category":"Strategy","group_label":"Strategy","app_package":"com.Gaggle.fun.GooseGooseDuck","introduction":["Step into the wacky Birdverse of Goose Goose Duck, where it's time to get your beaks wet in a game of social deduction. As a cooperative Goose, team up with fellow geese to accomplish your mission amidst a spread of ever-expanding environments. But beware! Keeping you on your tail feathers are the malicious Mallards and foul Fowls, disruptive ducks who have infiltrated your team, eager to thwart your endeavors any which way they can.","This engaging mix of strategy and whimsy is brought to you by the creators of Gaggle.fun, who don't believe in doing things by halves. In Goose Goose Duck, they promise an immersive experience, complete with decorative cosmetics, multiple game modes, an extensive list of character roles, and a string of map locations to keep you on your (webbed) toes."],"app_summary":"A game of social deduction where you and your fellow geese must work together."}]
