[{"id":187,"app_name":"Sonic The Hedgehog 2 Classic","status":1,"app_developer_name":"SEGA","app_score":"4.25248","app_category":"Arcade","group_label":"Arcade","app_package":"com.sega.sonic2.runner","introduction":["Sonic The Hedgehog 2 Classic, one of the best-selling SEGA games of all time has been reimagined and is now available on mobile! In this addictive arcade action game, the player re-experiences the brilliance of the second flagship game in the Sonic the Hedgehog franchise. Players can now indulge in more running, more jumping, and an enriching masterclass in classic arcade gaming. The vindictive Dr. Eggman is back in business, pursuing the seven Chaos Emeralds to activate his lethal weapon, the Death Egg. Join Sonic the Hedgehog, Tails, and Knuckles in this electrifying remaster to vanquish him."],"app_summary":"Spin Dash your way through SEGA’s smash sequel - Sonic The Hedgehog 2"},{"id":161,"app_name":"Angry Birds Friends","status":1,"app_developer_name":"Rovio Entertainment Corporation","app_score":"4.373659","app_category":"Arcade","group_label":"Arcade","app_package":"com.rovio.angrybirdsfriends","introduction":["Are you ready to take on your friends and the world in brand-new Angry Birds tournaments? With Angry Birds Friends, an incredible version of the classic Angry Birds, you get the chance to engage in a friendly rivalry and prove your mighty avian prowess in dynamic and competitive new levels every week! Conquer the leaderboards and climb up to flaunt your title as the ultimate Angry Birds Champion in the world! The game will test your skills, drive your determination, and challenge your wits in the best possible way!"],"app_summary":"Compete against the World in special tournaments every week!"},{"id":96,"app_name":"Stickman Basketball 3D","status":1,"app_developer_name":"Djinnworks GmbH","app_score":"4.6665754","app_category":"Sports","group_label":"Sports","app_package":"com.djinnworks.sb17","introduction":["Get ready to slam dunk your way to victory with the Stickman Basketball 3D app. This action-packed game will have you sinking shots and swishing nets with its dynamic gameplay and exhilarating atmosphere. Designed with stunning smooth animations and simple controls, this game offers you the chance to experience pure basketball fun right at your fingertips. With its insane action and tons of replay value, you’ll be vying for the top spot in no time. Pick your team, shoot your shots, and bring the heat in this stickman-driven basketball universe!"],"app_summary":"Action packed NBA feeling and pure basketball fun with the famous Stickman"},{"id":95,"app_name":"Hill Climb Racing","status":1,"app_developer_name":"Fingersoft","app_score":"4.5524983","app_category":"Racing","group_label":"Racing","app_package":"com.fingersoft.hillclimb","introduction":["Hill Climb Racing is an engaging and thrilling uphill racing game that combines realistic physics and addictive gameplay. Get behind the wheel of a variety of unique vehicles and conquer a landscape brimming with hills and valleys! Follow Bill, a young aspiring racer, embarking on a wild adventure that no ride has ever trodden before, defying physics and tackling challenging terrains. Be cautious of your fuel gauge - there's only so much gas in old Bill's tank. Hill Climb Racing is an offline game you can play anywhere - on a bus, plane, or train, so strap in and get ready to conquer the hill!"],"app_summary":"Race uphill to win in this offline physics based driving game!"},{"id":47,"app_name":"June's Journey: Hidden Objects","status":1,"app_developer_name":"Wooga","app_score":"4.5166187","app_category":"Adventure","group_label":"Adventure","app_package":"net.wooga.junes_journey_hidden_object_mystery_game","introduction":["Seeking an exciting detective adventure gaming experience? Look no further than June's Journey: Hidden Objects. This thrilling hidden-object mystery game immerses you in the glamorous era of the roaring 20s, where you dive headfirst into intriguing mysteries and uncover hidden family secrets. Guide June Parker through her captivating quest, solving riddles, and finding hidden clues in a scandalous family drama rich with romance and suspense."],"app_summary":"Play 100s of puzzles and find hidden objects. Solve the murder mystery."},{"id":178,"app_name":"Five Nights at Freddy's 3","status":1,"app_developer_name":"Clickteam USA LLC","app_score":"4.5356216","app_category":"Action","group_label":"Action","app_package":"com.scottgames.fnaf3","introduction":["Welcome to a world that's a peculiar mix of childhood memories and pure nightmares - Five Nights at Freddy's 3. This game takes you thirty years past the horrific events at Freddy Fazbear's Pizza. The establishment might be closed and abandoned, but the creepy animatronics that once entertained guests have found a new home in 'Fazbear's Fright: The Horror Attraction'. Brave gamers are dared to survive the terrors revived for an authentic horror experience. A thrilling discovery awaits with the only existing animatronic in this attraction, ready to revive the fear you'd thought was forgotten."],"app_summary":"Childhood nightmares should remain in the past."},{"id":48,"app_name":"Going Balls","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.0460124","app_category":"Casual","group_label":"Casual","app_package":"com.pronetis.ironball2","introduction":["Embark on an exhilarating ride through unpredictable terrains with the remarkable game, Going Balls. This rolling ball platformer has you hooked from the get-go with its vibrant graphics, engaging gameplay, and over 1,000 level challenges that test your skills and wit. With more than 200 million downloads under its belt, Going Balls is an iconic adventure that offers a one-of-a-kind gaming experience where your wits are your greatest weapon.","Virtual thrill-seekers will find themselves lost in a world of wild and wacky landscapes, where each level brings a unique challenge. Whether you're a seasoned gamer in search of an extraordinary journey or a casual player yearning for a truly addictive game, Going Balls proves to be an indispensable companion on your device. Get ready to conquer new levels, face nerve-racking challenges and navigate your way to victory in this wonderfully immersive game."],"app_summary":"Challenge yourself in a rolling ball platformer filled with unexpected twists."},{"id":49,"app_name":"Zooba: Fun Battle Royale Games","status":1,"app_developer_name":"Wildlife Studios","app_score":"4.427069","app_category":"Action","group_label":"Action","app_package":"com.wildlife.games.battle.royale.free.zooba","introduction":["Introducing Zooba: Fun Battle Royale Games, the ultimate free online multiplayer game that promises unlimited hours of intense shoot-outs and fast-paced battle royale action. Play as any of the colorful variety of characters, each with distinct abilities and styles, in your quest to become the top star. Compete with players online in this brawl battle royale game, where only the fierce survive. Upgrade your weapons for maximum firepower and to gain an edge over your opponents. Ready, set, battle, and aim your way to the crown in this adrenaline-pumping game."],"app_summary":"Brawl, Clash & Play an epic multiplayer online shooting action MOBA stars game!"},{"id":50,"app_name":"Ultimate Custom Night","status":1,"app_developer_name":"Clickteam USA LLC","app_score":"4.5542965","app_category":"Action","group_label":"Action","app_package":"com.clickteam.ultimatecustomnight","introduction":["Welcome to the ultimate horror mashup in the world of video gaming: Ultimate Custom Night. It's the perfect game for those who love the thrill of surviving terrifying situations, all while trapped alone in an office with uncanny animatronics. Inspired by the series of Five Nights at Freddy's games, it features 50 unique animatronic characters across the series. The level of customizability is unparalleled; select your preferred characters, adjust the difficulty from 0-20, and get ready for the action."],"app_summary":"Welcome to the ultimate FNaF mashup!"},{"id":51,"app_name":"Twisted Tangle","status":1,"app_developer_name":"Rollic Games","app_score":"4.070462","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.crescivegames.twistedtangle","introduction":["Twisted Tangle is a cutting-edge 3D puzzle game that is as captivating as it is challenging. It masterfully combines logic, problem-solving, and tactical play in a mind-boggling network of knots. Bright graphics, creative concept, and regular addition of fresh puzzles make this game an addictive hobby for all puzzle fanatics. Every week, Twisted Tangle rolls out new puzzles that stimulate your grey cells and entertain your senses. The game's enigmatic universe is a draw for both beginners and veteran puzzle solvers. Whether it's the Boss Levels, Hard, or Epic stages, Twisted Tangle consistently pushes the boundaries of your cognitive capabilities."],"app_summary":"Freedom to Ropes!"},{"id":53,"app_name":"Stumble Guys","status":1,"app_developer_name":"Scopely","app_score":"4.3125224","app_category":"Action","group_label":"Action","app_package":"com.kitkagames.fallbuddies","introduction":["Step into the madcap universe of Stumble Guys, a vibrant multiplayer knockout party game that gathers up to 32 players in chaotic, fun-filled battles. This is no ordinary fight for survival. Instead, it's a frenetic fairground of running, stumbling, falling, jumping, and most importantly, triumphant laughter. Join the millions of players from all corners of the globe and see if you've got what it takes to triumph in this exciting battle royale. Don't just play to win, stumble to victory!","The journey to the finish line is fraught with crazy hurdles and wild opponents that'll challenge your running skills and test your balance. This is a game where anything can happen – and more often than not, it does. Dodge obstacles, tussle with opponents, and make your way through an insane and unpredictable gauntlet of knockout rounds. Get ready for the running chaos! Will you be the last one standing amid the chaos?"],"app_summary":"Fun knockout battle royale, play with your friends!"},{"id":188,"app_name":"Love Balls","status":1,"app_developer_name":"Lion Studios","app_score":"4.039992","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.supertapx.lovedots","introduction":["Meet Love Balls, a captivating and imaginative game that will keep you hooked for hours. You'll be putting your brain to the test and find creative ways to bump the balls together. The fun begins with seemingly easy challenges, but you'll soon realize that simplicity can be deceiving. Love Balls is not just a game; it's a canvas where you create solutions using lines or shapes according to your wit and imagination. This exciting blend of mind-bending puzzles and creativity will leave you utterly engrossed and highly entertained."],"app_summary":"Draw the lines and bump the balls!"},{"id":189,"app_name":"Kingdom Rush Vengeance TD Game","status":1,"app_developer_name":"Ironhide Games","app_score":"4.6550965","app_category":"Strategy","group_label":"Strategy","app_package":"com.ironhidegames.android.kingdomrush4","introduction":["Unleash your inner warrior with Kingdom Rush Vengeance TD Game, a thrilling offline tower defense strategy game. Assemble your armies, command mighty heroes and set a battle plan to conquer epic TD battles. For strategy game enthusiasts, this gripping game offers a perfect blend of strategic planning and fast-paced action. Pit your heroes against fierce enemies, level up your characters and gear up for exciting boss fights. Bring the kingdom under your rule and assert your dominance over the battlefield."],"app_summary":"Epic offline tower-defense td battles! Beat the kingdom in wild strategy games"},{"id":169,"app_name":"Rise of Kingdoms: Lost Crusade","status":1,"app_developer_name":"LilithGames","app_score":"4.4101367","app_category":"Strategy","group_label":"Strategy","app_package":"com.lilithgame.roc.gp","introduction":["Rise of Kingdoms: Lost Crusade is a unique blend of strategy, real-time battles, and RPG-style gameplay in the world of ancient civilization. Immerse yourself in the world of Greece, the birthplace of western civilization, as you navigate your empire from a lone clan to a dominating force. Unleash the power of legendary Greek philosophers, warriors, and poets, and decide whether to foster democracy and architectural marvels, or demonstrate military prowess like Alexander the Great. The choice is yours, as you use your resources and intellectual prowess to conquer the Aegean."],"app_summary":"The Best Civilization Strategy Game. Conquer with Greece, Rise to Greatnes."},{"id":113,"app_name":"Hay Day","status":1,"app_developer_name":"Supercell","app_score":"4.4267926","app_category":"Casual","group_label":"Casual","app_package":"com.supercell.hayday","introduction":["Welcome to the pastoral world of Hay Day, a farming simulation game that combines strategy, management, and unlimited playability. Transform an uncultivated patch of land into a thriving farm, raising livestock, planting crops, and catching fish. You will experience the satisfying cycle of planting, harvesting, and producing goods. Not only can you personalize your farm, but you can also explore the fantastic Valley and fulfill town visitors' orders. This app immerses you in the simple pleasures of farming life in a colorful and entertaining environment where anything is possible."],"app_summary":"Grow a farm, fish, and explore the Valley. Build your own slice of paradise!"},{"id":192,"app_name":"Red Ball 4","status":1,"app_developer_name":"FDG Entertainment GmbH & Co.KG","app_score":"4.565345","app_category":"Arcade","group_label":"Arcade","app_package":"com.FDGEntertainment.redball4.gp","introduction":["Red Ball 4 is a highly thrilling adventure game available on Google Play. The game sets you on a rescue mission where the world's shape is at risk as evil minions are on a daring mission to transfigure the planet's adorable roundness into a dull, square form. As an adventurer, it's up to you to step in and save the day, and who's better at doing that other than the hero of our show - the Red Ball! This vibrant game is packed with remarkable graphics and offers a unique yet straightforward approach to gaming, embedding it with a mix of fun, adventure, strategy, and excitement."],"app_summary":"Roll, jump and bounce through 75 exciting levels full of adventure."},{"id":36,"app_name":"My Talking Angela 2","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.3255634","app_category":"Casual","group_label":"Casual","app_package":"com.outfit7.mytalkingangela2","introduction":["Dive into the fabulous world of fashion and fun with My Talking Angela 2. This virtual pet game by Outfit7, creators of hit games like My Talking Tom series, brings daily glamour and entertainment alive. Players assist the stylish cat Angela in her bustling city life. The game lets you bond with Angela, help her pick her outfits, engage in numerous activities, and enjoy jet-setting travels. My Talking Angela 2 is all about fashion, food, travel, and galore. This game ingeniously mixes interactive elements with a compelling narrative that is sure to keep you coming back for more."],"app_summary":"The talking cat Angela is back with more dancing, fashion, and baking!"},{"id":26,"app_name":"Toca Life World: Build a Story","status":1,"app_developer_name":"Toca Boca","app_score":"4.243788","app_category":"Educational","group_label":"Educational","app_package":"com.tocaboca.tocalifeworld","introduction":["Welcome to the magical universe of Toca Life World: Build a Story - a world of endless possibilities, waiting just for you! Always dreamed of writing your own stories and bringing fantastic world to life? Now's the chance. In Toca Life World, you're the designer, decorator, and story-teller all in one, creating a vibrant world teeming with unique characters and fascinating stories. From adventures to reality shows, you can unleash your imagination and creativity. You can direct your own sitcom or run a restaurant, visit the beach with friends, run a dog daycare center – the possibilities are limitless."],"app_summary":"Create and play your game characters. Design a mini world and choose your story!"},{"id":57,"app_name":"Roblox","status":1,"app_developer_name":"Roblox Corporation","app_score":"4.421079","app_category":"Adventure","group_label":"Adventure","app_package":"com.roblox.client","introduction":["Roblox is a supremely engaging virtual universe where you can create, connect, and cater to any and every whim of your imagination. Just like stepping into a new dimension, Roblox offers its users a unique opportunity to join millions of others in an expansive and infinitely varied world. The best part? Every experience in this universe is crafted by a vibrant and ever-growing global community, thus ensuring there's always a new corner waiting to be explored or a new adventure to embark upon every single day."],"app_summary":"Be anything you can imagine."},{"id":58,"app_name":"Tiles Hop: EDM Rush","status":1,"app_developer_name":"AMANOTES PTE LTD","app_score":"4.184521","app_category":"Music","group_label":"Music","app_package":"com.amanotes.beathopper","introduction":["Dive into the vibrant musical world in Tiles Hop: EDM Rush – an engaging blend of magic ball games, music games, and song games. With an immersive gameplay designed to challenge your coordination skills, ball jump abilities, and your affection for music, this game promises an endless fun time for you. A fan of hip hop or any genres of music? Tiles Hop: EDM Rush has got you covered. Hip hop beats, EDM music, and colorful graphics, this game transforms your mobile screen into a dance floor. Hop your way through mesmerizing tiles, hit the beats, and immerse yourself in this unbeatable music game."],"app_summary":"Fun song game as music ball dance, bounce, hop on magic tiles and edms hiphop"},{"id":59,"app_name":"Clash of Clans","status":1,"app_developer_name":"Supercell","app_score":"4.5458355","app_category":"Strategy","group_label":"Strategy","app_package":"com.supercell.clashofclans","introduction":["Step into the epic world of Clash of Clans, a massive multiplayer online strategy game that's garnered attention and love from players across the globe. In a game realm where you create your own village and raise a unique clan to compete in Clan Wars, every day is a new adventure awaiting. Wield the power of your clan as you rise through the ranks, build your empire, protect your borders, and face off with millions of other player enthusiasts in spectacular Clan Wars. Be it fire breathing Wizards, Mustachioed Barbarians, or unearthly magical troops, you're in for a feast of never-ending action and strategy!"],"app_summary":"Epic combat strategy game. Build your village, train your troops & go to battle!"},{"id":97,"app_name":"Doodle Jump","status":1,"app_developer_name":"Lima Sky LLC","app_score":"4.401306","app_category":"Arcade","group_label":"Arcade","app_package":"com.lima.doodlejump","introduction":["Dive into the world of Doodle Jump - an incredibly entertaining, engaging and wildly addictive mobile game that has taken the gaming world by storm. Crowned as one of the hottest mobile games of all time, it's hailed 'the best mobile game ever created' by Touch Arcade, and 'a perfect micro-game, insanely addictive, and deliciously replayable.' by Macworld. The game invites players on an endless journey upwards on a sheet of graph paper, offering rounds full of fun, frolic, and exhilaration."],"app_summary":"One of the best mobile games of all time. As INSANELY addictive as ever!"},{"id":73,"app_name":"Wild Kratts Rescue Run","status":1,"app_developer_name":"PBS KIDS","app_score":"4.1222224","app_category":"Educational","group_label":"Educational","app_package":"org.pbskids.wildkrattsrunner","introduction":["Wild Kratts Rescue Run is a mix of endless running fun and learning adventure! Rescuing animals in their natural habitats becomes a thrilling experience as you transform into Chris, Martin, or Aviva using their unique creature suits. As you navigate through 24 action-packed levels set in diverse ecosystems like the rainforest, desert, and snow-clad regions, you also confront villains to ensure the safety of wildlife. This ad-free arcade-style runner is perfect for your children of ages 5-8, making distance learning not only productive but also insanely fun."],"app_summary":"Endless runner fun packed with animal facts, exciting wildlife, & adventure."},{"id":62,"app_name":"Summoners War: Lost Centuria","status":1,"app_developer_name":"Com2uS","app_score":"3.569794","app_category":"Strategy","group_label":"Strategy","app_package":"com.com2us.lostcenturia.android.google.global.normal","introduction":["Summoners War: Lost Centuria is an enthralling real-time strategy RPG crafted by the masterminds behind the global phenomenon, Summoners War: Skyarena. Fans of the franchise will not be disappointed as this installment boasts of the beloved elements from its predecessor, including addictive real-time battles complete with eye-catching skill animations and iconic monsters. Players get to wrangle with summoners from around the globe, vying for the top spot and bragging rights. The action never stops in this fast-paced game, with numerous surprises packed for strategic minds and quick thinkers."],"app_summary":"You against the world! Worldwide real-time strategy battle."},{"id":63,"app_name":"The Room","status":1,"app_developer_name":"Fireproof Games","app_score":"4.788652","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.FireproofStudios.TheRoom","introduction":["Welcome to The Room, an enthralling journey that combines a physical puzzler with a mystery game, set in a visually stunning 3D universe. This game draws you into a unique realm filled with beauty, danger, and enigma. Unveil layers of stories, solve fascinating puzzles, and immerse yourself into this intriguing world where every detail is there for a reason and every object holds a secret."],"app_summary":"The definitive puzzle experience"},{"id":64,"app_name":"Mobile Legends: Bang Bang","status":1,"app_developer_name":"Moonton","app_score":"4.1406393","app_category":"Action","group_label":"Action","app_package":"com.mobile.legends","introduction":["Step into the exhilarating world of Mobile Legends: Bang Bang, the ultimate 5v5 MOBA showdown, and see the thrill of the battlefield come alive right on your mobile device. Join forces with your friends, choose your favorite heroes, and devise the unbeatable strategy to reign supreme over real players from across the globe. With fast and furious 10-minute battles, and the 10-second matchmaking, the game ensures non-stop action! This high-paced eSports adventure puts the electrifying fun of PC MOBA and action games right in the palm of your hand."],"app_summary":"Play the 5v5 MOBA game on mobile with players worldwide."},{"id":66,"app_name":"Arknights","status":1,"app_developer_name":"Yostar Limited.","app_score":"4.4664335","app_category":"Strategy","group_label":"Strategy","app_package":"com.YoStarEN.Arknights","introduction":["Embark on an exhilarating journey with Arknights, a captivating blend of RPG and strategy gaming. This immersive game by Google Play is poised on the background where you are a vital part of Rhodes Island, an esteemed pharmaceutical organization. The island is grappling with a deadly infection that leaves a trail of havoc. It is up to you and your leader Amiya to recruit, train and dispatch operators to combat the chaos and protect the innocents. With the world on the brink of disorder, your tactics could sculpt the future of Rhodes Island."],"app_summary":"Through the darkness, we see light"},{"id":67,"app_name":"Plague Inc.","status":1,"app_developer_name":"Ndemic Creations","app_score":"4.6717954","app_category":"Simulation","group_label":"Simulation","app_package":"com.miniclip.plagueinc","introduction":["Plague Inc. offers an eerie simulacrum of a real-life pandemic. This unique blend of high-level strategy and chillingly realistic simulation will engage players in a fight against humanity. Your pathogen has just invaded 'Patient Zero' and it's your responsibility to end human history by crafting a deadly, global plague. This game pushes the boundaries of strategic mobile gaming and is a testament to the genius of its developer, Ndemic Creations. Distinguished by its innovative gameplay, Plague Inc. has become the number one game worldwide with over four billion games played."],"app_summary":"Can you infect the world?"},{"id":68,"app_name":"Toca Lab: Elements","status":1,"app_developer_name":"Toca Boca","app_score":"3.9659762","app_category":"Education","group_label":"Education","app_package":"com.tocaboca.tocalab","introduction":["Discover the exciting world of science with Toca Lab: Elements! This vibrant, interactive app dive you into the heart of a laboratory, where you get to play with all 118 elements from the periodic table. Prentend to be a scientist, experiment with the various lab tools, and behold each element's unique properties. The app aims to provide a fun and engaging way for kids and adults alike to learn about the elements. This isn't your ordinary science lesson; this is an adventure into the unseen world of atoms and particles, designed to stoke your curiosity and make science an exciting journey of exploration."],"app_summary":"Welcome to Toca Lab: Elements! Discover elements by experimenting with lab tools"},{"id":69,"app_name":"Toca Hair Salon Me","status":1,"app_developer_name":"Toca Boca","app_score":"4.0615387","app_category":"Education","group_label":"Education","app_package":"com.tocaboca.hairsalonme","introduction":["Unleash your creativity and dive into the fabulously fun world of hairstyling with Toca Hair Salon Me. This app lets you take the reins as you give your friends and family a complete hair makeover! Simply start by taking a picture and let the hairstyling fun begin. From wild colors to funky styles, you're only limited by your imagination. From creating photo backgrounds using your own pictures to finishing your masterpiece with unique accessories, there's no limit to what you can create!"],"app_summary":"Give your friends and family a totally new look!"},{"id":116,"app_name":"Sonic CD Classic","status":1,"app_developer_name":"SEGA","app_score":"4.2636814","app_category":"Action","group_label":"Action","app_package":"com.sega.soniccd.classic","introduction":["Immerse yourself in time-travel adventure as you re-discover SEGA's acclaimed Sonic platformer, Sonic CD Classic. An epitome of nostalgia, Sonic CD Classic allows you to dive into the fascinating world of SEGA's iconic mascot - Sonic, who is on a mission to save his friend Amy Rose and retrieve the powerful Time Stones. Simultaneously experience past, present, and future as Sonic squares off against his arch-nemesis Dr. Eggman and the fiendish Metal Sonic. This beloved gaming classic is a part of the SEGA Forever collection, bringing to your mobile device some of the most favorite SEGA console classics. So hop in, and let Sonic take you for a spin dash down the memory lane."],"app_summary":"Time travel in SEGA's highly acclaimed Sonic platformer"}]
