[{"id":255,"app_name":"Words With Friends Crosswords","status":1,"app_developer_name":"Zynga","app_score":"4.2422614","app_category":"Word","group_label":"Word","app_package":"com.zynga.wwf2.free","introduction":["Step into the world of words with Words With Friends Crosswords - a popular mobile word game now with even more ways to play! This game is not just your regular crossword challenge. It's an exciting blend of mental agility, vocabulary spaghetti, and competitive fun - all designed to let you connect with friends and family while expanding your vocabulary and sharpening your wit. Play smarter, faster, and spell your way to victory because in this world of words, the Best Friend Wins!"],"app_summary":"Challenge your friends and your brain in this classic crossword puzzle game."},{"id":256,"app_name":"Perfect Lie","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.3898892","app_category":"Casual","group_label":"Casual","app_package":"com.funcell.perfectlie","introduction":["Step into the exhilarating world of deception with the 'Perfect Lie' app! Here you'll explore the vast wilderness of trickery, lies, and deception. The 'Perfect Lie' aims to challenge players in a scenario where one has to deceive to move ahead. Think you can outsmart your folks? Or hid a lie from your teachers? As you manipulate and twist facts to your favor, you'll be amazed by the adrenaline rush the game offers. Are you smart enough to weave a web of deceit so perfect that you can go unnoticed? Let's test your skills and find out if you have what it takes to be the World Number 1 Liar."],"app_summary":"Can you be the Number 1 Liar in the World ?"},{"id":257,"app_name":"ABC Runner","status":1,"app_developer_name":"JoyPac","app_score":"4.4352827","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.UmamiGames.Scattergories","introduction":["Get your fingers ready and brain buzzing, ABC Runner is here! This fun-packed, dynamic game is brought to you by UmamiGames and is a real gem on the Google Play store; one that combines adrenaline-rushing excitement with mind-boggling spelling showdowns. Do you pride yourself on being a fast thinker? Ever wondered if your spelling speed matches your quick wit? That's just what you'll discover with ABC Runner, an engaging game that pits you against your friends in an epic battle of words!"],"app_summary":"Scattergories battle royale!"},{"id":269,"app_name":"Dead by Daylight Mobile","status":1,"app_developer_name":"Behaviour Interactive","app_score":"4.3431544","app_category":"Action","group_label":"Action","app_package":"com.netease.dbdena","introduction":["Dive into the world of horror, survival, and suspense with Dead by Daylight Mobile, a multiplayer (4vs1) terror-filled game that takes you into a thrilling play of cat and mouse courtesy of a huge update. This game will bring chills down your spine as you either play as the Killer and hunt your prey or fight for survival as one of the Survivors trying to escape certain doom. Get ready to test your nerve, strategy, and survival skills in this immersive atmospheric horror game!"],"app_summary":"Multiplayer horror and action"},{"id":259,"app_name":"Total War: MEDIEVAL II","status":1,"app_developer_name":"Feral Interactive","app_score":"4.61","app_category":"Strategy","group_label":"Strategy","app_package":"com.feralinteractive.medieval2_android","introduction":["Embark on a journey through the ages with Total War: MEDIEVAL II. This riveting Android game presents a fascinating concoction of real-time epic battles coupled with a rich tapestry of turn-based strategy. With the whole Medieval world as your stage, you are tasked with the daunting responsibility of steering the fate of great kingdoms in their fight for dominance. From the serene shores of Western Europe to the arid expanses of Arabia, your path to supremacy is strewn with scheming rivals and spectacular conflicts. It's your wit and valor that will pave the way to the throne."],"app_summary":"Conquer kingdoms to rule an empire and dominate the Middle Ages."},{"id":260,"app_name":"Trivia Crack","status":1,"app_developer_name":"etermax","app_score":"4.4218493","app_category":"Trivia","group_label":"Trivia","app_package":"com.etermax.preguntados.lite","introduction":["Raise your hand if you're a trivia fan! Trivia Crack will be right up your alley. This game celebrates its 10th anniversary in style, promising a nail-biting trivia journey for its players. Challenge your friends and family in an epic quest for trivia glory! Answer questions correctly to prove your intelligence and propose multiple-choice questions to flex your trivia muscles. This isn't just a game, it's a battle of wits that promises endless fun and mental stimulation."],"app_summary":"Answer fun questions and test your knowledge in this trivia game"},{"id":261,"app_name":"Open House: Match 3 puzzles","status":1,"app_developer_name":"Integra Games Global OU","app_score":"4.5055466","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.integragames.openhouse.android","introduction":["Open House: Match 3 puzzles is a vibrant, creative, and immersive game that combines enjoyable match-3 puzzles with the satisfying task of home renovation. With a beautifully illustrated mansion as your canvas, this game invites you to bring your creative side to life. Players are tasked with restoring and decorating different areas of the mansion, adding their personal touch and flair. With each successfully completed match-3 level, more chapters and parts of your friends' intriguing story unfold. The end goal? Creating a dream home that reflects your design taste and beating hundreds of exciting levels!"],"app_summary":"Turn a rickety old house into a cozy mansion!"},{"id":262,"app_name":"Airport Security","status":1,"app_developer_name":"Kwalee","app_score":"4.425964","app_category":"Casual","group_label":"Casual","app_package":"com.sunsetgames.bordersecurity","introduction":["Airport Security is a captivating game that immerses you into the thrilling world of aviation security. Assume the role of a border patrol police officer and transform a bustling airport into a safe haven. Flights depart, passengers gather, and criminals are lurking around the corner, ready to carry out their devious schemes. Keep your senses sharp, and be prepared to scrutinize every passing traveler, their luggage, and effectively manage the chaos that brews in the airport terminal. The security of the airport rests solely in your hands, making for an exhilarating gaming experience where the difference between order and turmoil is decided by your vigilance and savvy decision-making skills.","Equipped with a powerful X-ray scanner, your task lies in examining every passport, detecting concealed contraband, and ruling out any security threats. Your superb airport scanner skills play a pivotal role in maintaining order, while your cunningly sharp eyes help preempt any unwanted police encounters. Whether it's handling the critical task of passport control or managing flight control, each challenge propels you deeper into your journey of becoming the ultimate 'Airport Master'. Expect unique interrogation scenarios that enhance your skills and make every achievement all the more rewarding."],"app_summary":"Ensure border security, control bad guys, and maintain terminal safety with Xray"},{"id":270,"app_name":"Dragon City Mobile","status":1,"app_developer_name":"Social Point","app_score":"4.6812925","app_category":"Simulation","group_label":"Simulation","app_package":"es.socialpoint.DragonCity","introduction":["Dragon City Mobile, developed by Socialpoint, is a unique game that will test your skills as a Dragon Master. As an aspiring dragon breeder, your mission is to create a sprawling Dragon City filled with fire-breathing creatures on floating islands. From farms and habitats to buildings and, of course, tons of dragons, you're in control. With more than 80 million Dragon Masters worldwide, you'll have plenty of company in your quest to be the best. The game is free to download with optional in-game purchases.","You'll have the opportunity to train, feed, and evolve your dragons into stunning monsters. The game offers so much more than just breeding though, with weekly dragon additions, special events, and PvP arenas. Each dragon harnesses the power of elements like Fire, Nature, Pure, and Legend, allowing you to breed unique hybrids. Exploring magical worlds, collecting Orbs to empower your dragons, and unlocking advanced features promise endless fun and excitement."],"app_summary":"Collect the cutest dragons on the island in this fun dragon breeding game!"},{"id":263,"app_name":"Carve The Pencil","status":1,"app_developer_name":"ZPLAY Games","app_score":"4.419048","app_category":"Simulation","group_label":"Simulation","app_package":"com.zplay.carvethepencil","introduction":["Step inside the fascinating world of art with Carve the Pencil, the ultimate casual mobile game that seamlessly marries carving and pencil drawing. Shifting the paradigm of gaming, this innovative application lets you become a talented artist wherein a wooden pencil transforms into the canvas for your creativity. Delve into the unexplored realms of your artistic prowess as you peel off layers of wood to reveal stunning sculptures and intricate designs. This game isn't just a test of precision, but a fun and unique way to nourish the artist within you."],"app_summary":"Create a Pencil Art"},{"id":264,"app_name":"Dig Tycoon - Idle Game","status":1,"app_developer_name":"Sablo Studio","app_score":"4.6225963","app_category":"Simulation","group_label":"Simulation","app_package":"com.sablostudio.dig.tycoon.idle.game","introduction":["Welcome to the world of Dig Tycoon - Idle Game, an intriguing mix of tapping, digging, and construction. This game takes you to off-road areas where the real digging action is. With the help of your loaders and excavators, your mission is to dig out raw materials and transport them to the construction site. The excitement of creating roads, buildings, and infrastructure from scratch is just one tap away. The game is known for its strategic element, requiring players to efficiently manage their resources to turn a barren land into a thriving, prosperous city.propriately assign and optimize the work, which ultimately demands strategic thinking from the players."],"app_summary":"Mine, Dig and Discover"},{"id":267,"app_name":"Prankster 3D","status":1,"app_developer_name":"Z & K Games","app_score":"3.9924812","app_category":"Casual","group_label":"Casual","app_package":"com.zatg.scaryteacher.prankme","introduction":["Prankster 3D is a hilarious choices game that thrusts you into the heart of a whimsical rivalry between Nick and Misty. Spun around the narrative of endless pranks, the game takes you on a laughter ride through the eccentric escapades of a high school genius, Nick, and his relentless endeavor to teach a sharp lesson to the infamous Scary Teacher 3D, Misty. It's a refreshing take on offline games, marked by an undercurrent of devious plans, unexpected tricks, and most importantly, the joy of seeing them hilariously go wrong."],"app_summary":"Dive into world of Prankster where you prank Scary Teacher in this choices game."},{"id":268,"app_name":"Taptap Heroes:ldle RPG","status":1,"app_developer_name":"Ajoy Lab Games","app_score":"4.574115","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.westbund.heros.en","introduction":["Immerse yourself in the mystical world of Mystia with TapTap Heroes: Idle RPG, the first ever multiplayer strategy RPG game. Boasting over 20 million downloads worldwide, this acclaimed game provides an extraordinary idle card gaming experience that completely sets it apart from the crowd. The lauded charm of the expansive TapTap world unfolds as players collect heroes, strategize their idle lineup, and embark on thrilling quests to thwart the nefarious plans of hell's queen, Freya. Be it Alliance Knights, Elf Wizards, or even Heaven Gods; everyone is on a crusade to seize the creation's power and restore balance to the realm."],"app_summary":"A simple, casual and strategic RPG game featuring both idle and active gameplay."},{"id":272,"app_name":"Farm Heroes Saga","status":1,"app_developer_name":"King","app_score":"4.645816","app_category":"Casual","group_label":"Casual","app_package":"com.king.farmheroessaga","introduction":["From the creators of Candy Crush Saga, Pet Rescue Saga, and Bubble Witch 3 Saga comes a fabulous farming game - Farm Heroes Saga. This fun-filled, match-3 puzzle game takes you on an exciting adventure across the farm, with the cute Cropsies. Facing the notorious Rancid the Raccoon, your mission is to solve puzzles and save the farm. Match fruits and plants to level up, team up with the Farm Heroes, swap and collect crops, and prepare to defend your lands. Whether you're an ardent farmer or a puzzle enthusiast, Farm Heroes Saga offers a rich gaming experience to enthrall everyone."],"app_summary":"Farming & matching puzzle game: match & solve match 3 puzzles to harvest fruits!"},{"id":273,"app_name":"SpongeBob: Krusty Cook-Off","status":1,"app_developer_name":"Tilting Point","app_score":"4.3264647","app_category":"Casual","group_label":"Casual","app_package":"com.tiltingpoint.spongebob","introduction":["Immerse yourself in the vibrant underwater world of Bikini Bottom with SpongeBob SquarePants in 'SpongeBob: Krusty Cook-Off.' In this free online cooking game, you don't only get to play with your favorite undersea characters, but also run your own restaurant! Clad in a chef's hat, master the grill and prepare delicious food and drinks across various establishments. From flipping burgers to crafting scrumptious steaks, this game is a hilarious adventure that blends time management, cooking, and interior decorating into a cohesive, fun-filled package. Remember, SpongeBob is waiting to prepare your favorite food, so get ready for an epic culinary journey."],"app_summary":"Play with SpongeBob in this cooking challenge and learn to be a real chef"},{"id":274,"app_name":"Pokémon Quest","status":1,"app_developer_name":"The Pokémon Company","app_score":"4.239154","app_category":"Role Playing","group_label":"Role Playing","app_package":"jp.pokemon.pokemonquest","introduction":["Embark on an exciting and unique adventure with Pokémon Quest, an electrifying game from the makers of Pokémon Red and Pokémon Blue. The beloved and familiar Pokémon have taken on a new and unexpected form...as cubes! Journey into the mystical Tumblecube Island, where everything, yes, everything, is a cube. Anticipate a thrilling quest, a hunt for treasured goodies and encounters with your favorite Pokémon from the original game in a whole new light!"],"app_summary":"Pokémon Quest—a rambunctious expedition RPG featuring cube-shaped Pokémon!"},{"id":275,"app_name":"The Walking Dead: Survivors","status":1,"app_developer_name":"Galaxy Play Technology Limited","app_score":"4.50997","app_category":"Strategy","group_label":"Strategy","app_package":"com.elex.twdsaw.gp","introduction":["The Walking Dead: Survivors is an electrifying game based on the world of the acclaimed comic series, Walking Dead. As a survivor in a world overrun by walkers, you're thrown into a relentless battle of survival against the living and the dead. You get to create and upgrade your very own fortified town, explore the world of The Walking Dead and even get to recruit your favorite comic book characters like Negan and Rick. The game puts your decision-making skills to the ultimate test. Whether to seek domination or forge alliances – the choice is yours."],"app_summary":"The newest official The Walking Dead strategy game - ally together to survive!"},{"id":276,"app_name":"Family Island™ — Farming game","status":1,"app_developer_name":"Melsoft Games Ltd","app_score":"4.5908575","app_category":"Casual","group_label":"Casual","app_package":"com.MelsoftGames.FamilyIslandFarm","introduction":["Get set for an incredible journey with a modern Stone Age family in Family Island™ — Farming game! Imagine a life where modern technology doesn't exist. Would you explore wilderness, build settlements, farm up a storm, or conquer new lands? In Family Island, you can do all of it and even more. From farmlands to a desert island, there are countless adventures waiting to unfold. Available on Google Play, Family Island takes players to an unfamiliar world, making them survive and thrive using the ancient art of farming, trading, and exploring."],"app_summary":"Do you like puzzles and adventure games? Then Family Island is for you!"},{"id":277,"app_name":"House Life 3D","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.2576","app_category":"Simulation","group_label":"Simulation","app_package":"com.flamingogamestudio.parentlife3d","introduction":["Welcome to House Life 3D! Unleash your inner domestic aficionado and indulge in a series of fun mini-games designed to encapsulate the realism and charm of everyday home life. From aiding with homework to shooting some hoops in your virtual backyard, House Life 3D provides a versatile range of activities that are bound to keep you captivated and entertained. Prepare to embark on an enjoyable voyage within the confines of the delightful landscapes of your virtual dwelling and relive the warmth and nostalgia of house life."],"app_summary":"Mini-games about home life! Manage the house life by completing tasks!"},{"id":278,"app_name":"Tank Stars","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.637034","app_category":"Arcade","group_label":"Arcade","app_package":"com.playgendary.tanks","introduction":["Prepare to immerse yourself in the high-octane action of Tank Stars, an adrenaline-fueled tank warfare game that pulls no punches. Tank Stars transports you into the thick of battle, where quick decision-making and accurate shooting are your keys to victory. You'll guide your powerful war machine across various battlegrounds, competing against thousands of players from across the globe in thrilling multiplayer modes. This turn-based strategy game demands you to make the right shots swiftly and efficiently, and failure to do so may cost you the battle. So strap on your helmet, commander, and prepare for the tank-rumbling extravaganza that is Tank Stars."],"app_summary":"Ready, aim, shoot! Command pocket war machines & win multiplayer tank io battles"},{"id":279,"app_name":"TMNT: Mutant Madness","status":1,"app_developer_name":"Kongregate","app_score":"4.4981937","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.kongregate.mobile.tmnt.google","introduction":["Get ready for an action-filled ride with TMNT: Mutant Madness! This game, presented by Nickelodeon, brings the entire classic crew of Teenage Mutant Ninja Turtles to your screens. Play as Raphael, Leonardo, Michelangelo, and Donatello as you battle across multiple dimensions to save Dimension X. With numerous legendary TMNT universe villains to fight, your role in the multiverse has never been this vital."],"app_summary":"Play as the legendary Teenage Mutant Ninja Turtles & save the world! Cowabunga!"},{"id":280,"app_name":"Game of War - Fire Age","status":1,"app_developer_name":"Machine Zone, Inc.","app_score":"3.426586","app_category":"Strategy","group_label":"Strategy","app_package":"com.machinezone.gow","introduction":["Game of War - Fire Age is a legendary interactive strategy game that lets you command massive armies and lead them into epic battles against dragons, monsters, and players from around the globe! The game takes you on an action-packed adventure, allowing you to experience what it's like to lead an army, build an empire, and be a hero. Be ready to step up and take a chance at becoming legendary in the most addictive strategy game!"],"app_summary":"Become a legend, fight epic creatures and unlock rare treasure in Game of War!"},{"id":281,"app_name":"Pet Rescue Saga","status":1,"app_developer_name":"King","app_score":"4.6062856","app_category":"Casual","group_label":"Casual","app_package":"com.king.petrescuesaga","introduction":["Venture into the delightful and colorful world of Pet Rescue Saga. This addictive puzzle adventure game, crafted by the makers of Candy Crush Saga, Farm Heroes Saga, and Bubble Witch 3 Saga, invites you on a mission to rescue adorable pets trapped between puzzle blocks. With an evil pet snatcher on the loose, every single move you make plays a pivotal role in ensuring the safety of your furry friends. Packed with over 5,600 levels and regularly updated with new challenges, Pet Rescue Saga promises endless hours of block-busting fun."],"app_summary":"Animal matching puzzle - Earn points! Save the pets! Dog and cat rescue game."},{"id":282,"app_name":"Plants vs. Zombies™ 2","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.130149","app_category":"Casual","group_label":"Casual","app_package":"com.ea.game.pvz2_na","introduction":["Step into the world of Plants vs. Zombies™ 2, a thrilling action-strategy adventure game. This exhilarating escapade will lead you to meet, greet, and vanquish all types of hilarious zombies, from primitive era to the apocalypse. Gather a multitude of incredible plants, boost them with Plant Food, and formulate the perfect defense plan to safeguard your cerebrum. You're not just combating a horde of amusing zombies; you're racing through time to defuse the undead threat."],"app_summary":"The spooky season is almost here again!"},{"id":283,"app_name":"Left to Survive: zombie games","status":1,"app_developer_name":"MY.GAMES B.V.","app_score":"4.4866805","app_category":"Action","group_label":"Action","app_package":"com.glu.zbs","introduction":["Let’s get ready to rumble as we dive into an action-packed world overrun by undead creatures in Left to Survive: zombie games! Brace yourself for an adrenaline-pumping journey through a post-apocalyptic world where survival is everything. This immersive game transforms Earth into a zombie-ridden reality where humans are pitted against the living dead in a fight for survival. It's time to whip out your guns, gather your courage and embark on a daring mission to save humankind from the zombie apocalypse. Stand tall amidst the ashes of a world gone to ruin, and face undead enemies with heat-clenching zeal as you resolve to reclaim your planet back from the zombie horde. The fight has begun, are you ready to step into the battleground?"],"app_summary":"Life among dead after apocalypse on earth. Zombie survival & multiplayer game"},{"id":284,"app_name":"Tap master: Tap it 3D","status":1,"app_developer_name":"Sonatgame","app_score":"4.4986596","app_category":"Casual","group_label":"Casual","app_package":"tap.it.away.block.taptile3d.tile.master","introduction":["Tap it 3D: Tap Master is a standout app that tests your solving skills in an exciting 3D puzzle world. It is a challenge to brain-tease you, engaging you to stay focused and tap away all the blocks in the quickest possible ways. Presented in a myriad of themes, the 3D Blocks render an exclusive experience to the users, and it's a thrill to guess which level will raise the difficulty. It's more than a mundane puzzle, it's a cerebral expedition that's cleverly addictive.","Not only does this exceptional app offer a fun-filled ambiguous 3D puzzle, but it also helps augment your intellectual abilities, enhancing your thinking prowess. The enchanting 3D blocks in diverse shapes would mesmerize you, as you need to be alert while unpuzzling these. So, if you're skilled enough to unpuzzle all the 3D blocks, take a dive into this remarkable app, and be the Tap master!"],"app_summary":"Tap it 3D Blocks to challenge your brain skill in this exciting puzzle game!"},{"id":285,"app_name":"Fire Emblem Heroes","status":1,"app_developer_name":"Nintendo Co., Ltd.","app_score":"4.484448","app_category":"Simulation","group_label":"Simulation","app_package":"com.nintendo.zaba","introduction":["Embark on an epic adventure with Nintendo's hit strategy-RPG series, Fire Emblem Heroes. Celebrating over 30 years of exciting gameplay, Fire Emblem now extends its prowess to smart devices. Fight strategically designed battles, perfect for touch screens and on-the-go gaming. Summon your favorite characters from across the Fire Emblem universe and hone their skills to unprecedented heights. This is your ultimate Fire Emblem experience like you've never seen before. The app is free to download with optional in-app purchases, ready to immerse you in its captivating narrative and intense battles."],"app_summary":"[Book VIII Begins] The curtain lifts, deception around every corner..."},{"id":286,"app_name":"Gym Workout Clicker: Muscle Up","status":1,"app_developer_name":"UltraPub","app_score":"4.25","app_category":"Casual","group_label":"Casual","app_package":"com.gym.idle.battle.simulation","introduction":["Get fit, save the city, and become a hero - all in a day's work as a fitness trainer in Gym Workout Clicker: Muscle Up. This captivating mobile game is all about pushing the boundaries, literally - with your fingertips! You'll be tasked with the incredible responsibility of transforming ordinary individuals into extraordinary superheroes, intent on defending the city from looming threats. Your virtual gym becomes the arena for valor, your trainees – the city's potential protectors. It's a game that combines elements of idle clicking, RPG, and simulation into an enthralling comic book-like experience."],"app_summary":"Tap fast to train your muscles. Become the lifting hero in idle workout game"},{"id":287,"app_name":"Talking Ginger 2","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.042128","app_category":"Entertainment","group_label":"Entertainment","app_package":"com.outfit7.gingersbirthdayfree","introduction":["Talking Ginger 2 is an adorable, fun-packed app that lets you join in on little kitten Ginger's birthday celebration! The interactive app brings you into a world of cute antics, funny reactions and best of all, lots of birthday fun. Users get to mingle with the cutest little cat in cyber city, engage him in hilarious conversations - in which he repeats your words back in his qirky voice, and party like there's no tomorrow! If that's not all, users also get to record all the fun and share videos of Ginger's antics with their friends."],"app_summary":"It’s time for some birthday fun!"},{"id":288,"app_name":"2 Player games : the Challenge","status":1,"app_developer_name":"JindoBlu","app_score":"4.52693","app_category":"Arcade","group_label":"Arcade","app_package":"com.JindoBlu.TwoPlayerGamesChallenge","introduction":["Witness a sidesplitting multiplayer gaming experience with 2 Player Games: The Challenge - an over-the-top dueling game that can be played alone or with a friend and promises endless fun rolled into one! A collection of simple yet engaging minigames designed to test your reflexes, ideal for days when fun's hard to come by. Whether competing with a friend on the same device or battling it against an AI, this game brings out the true spirit of friendly rivalry and provides hours of non-stop entertainment."],"app_summary":"Challenge your friends in this game! Two players on one device!"},{"id":289,"app_name":"Hidden Stuff","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.4664536","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.my.little.things","introduction":["Dive into a mesmerizing world of visual delight with Hidden Stuff; an enthralling game designed to both entertain and help alleviate stress. The game blends simplicity with stylish, artistic elements to create an exquisite puzzle-game experience. With each level unraveled, players are exposed to a picturesque realm of calming artwork. Every level presents a different, enjoyable challenge, tasking you to locate a multitude of objects concealed within an elegant silhouette."],"app_summary":"Find hidden objects! Every single level is a gorgeous and relaxing work of art"}]
