[{"id":312,"app_name":"Kung Fu Saga","status":1,"app_developer_name":"TTHmobi","app_score":"4.695787","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.rxsjus.an.watt","introduction":["Immerse in the land of mystics and martial arts with Kung Fu Saga. This is not just any other RPG, it's a journey steeped in oriental mystique and martial excellence. Feel the change of seasons, the interplay of shadow and light, and the icing cold of a glacial terrain that has stood the test of thousands of years. Take on the mantle of a Kung Fu master and traverse through ancient forests, peaceful banyan trees, interacting with a myriad of free-wandering pets. As you step into this fantasy adventure, expect miracles, drama, and an ultimate quest for power."],"app_summary":"Winter Era: Tiger Man Makes His Debut!"},{"id":376,"app_name":"Hero Clash","status":1,"app_developer_name":"Glaciers Game","app_score":"3.0142858","app_category":"Casual","group_label":"Casual","app_package":"com.xgame.newglobal.na.gp","introduction":["Hero Clash is an exciting, free-to-play mobile game available on Google Play. In a continent mired by evil voids, you are the beacon of hope set out to restore peace and balance. Immerse yourself in a dangerous and mysterious world adorned with numerous levels that will surely get your adrenaline pumping. Be it endurance tests that push you to the brim or intellectual challenges that make you think, they all form an integral part of the journey. Victory is seldom easy but attaining it brings an unparalleled level of satisfaction."],"app_summary":"A fun and relaxing idle RPG game."},{"id":377,"app_name":"Hole.io","status":1,"app_developer_name":"VOODOO","app_score":"3.5456295","app_category":"Arcade","group_label":"Arcade","app_package":"io.voodoo.holeio","introduction":["Get ready to dive into the most addictive black hole game, Hole.io. Designed with a singular purpose to turn your free time into a fun time, this game is all about controlling a black hole and swallowing everything that comes your way. Whether it's towering buildings or bustling cars, you are an attacking hole master, ever ready for a feeding frenzy. But remember, the clock is ticking, and your quick wits are the only thing standing between success and end game. Engage in a fierce battle in the arena and show them who's the biggest black hole in town! All this wrapped up in a sleek and user-friendly interface that provides an experience that is satisfying, challenging, and most importantly, fun."],"app_summary":"Eat the world"},{"id":266,"app_name":"Eyes Horror & Coop Multiplayer","status":1,"app_developer_name":"Fearless Games sp. j.","app_score":"4.4293623","app_category":"Adventure","group_label":"Adventure","app_package":"com.eyesthegame.eyes","introduction":["Step into the world of 'Eyes Horror & Coop Multiplayer', a thrilling multiplayer game where fear and survival go hand in hand. Venture into the frightful mansion at night, with its labyrinthine design intended to get you lost. Strive to flee but eerie beings and chilling jump scares lurk in every corner. As the adrenaline builds, the monstrous chase initiates. However, remember – no one should ever play alone in the dark. This atmospheric horror game amps up the tension and terror, requiring your smart thinking and instincts to survive."],"app_summary":"Horror game with creepy story & coop multiplayer! Scary thriller with jumpscares"},{"id":271,"app_name":"Solitaire - Classic Card Games","status":1,"app_developer_name":"Kidult Lovin","app_score":"4.654679","app_category":"Card","group_label":"Card","app_package":"beetles.puzzle.solitaire","introduction":["Discover a world of instant entertainment with Solitaire - Classic Solitaire Card Games by Beetles. This app transforms the classic card game into an inviting, addictive, and challenging mobile experience that all card game enthusiasts will love. Included are spider solitaire, solitaire, pyramid solitaire and many more games, all of them more entertaining than ever before. This used to be a quintessential computer game but we've brought it to the modern age and now you can easily play on your phone or tablet, making it accessible anywhere, anytime to keep your mind sharp."],"app_summary":"Solitaire-like spider & freecell , the addicting Solitaire Classic Card Games"},{"id":378,"app_name":"Whiteout Survival","status":1,"app_developer_name":"Century Games Pte. Ltd.","app_score":"4.47958","app_category":"Strategy","group_label":"Strategy","app_package":"com.gof.global","introduction":["Step into a world of icy despair and frostbitten survival in Whiteout Survival. This gripping survival strategy game puts you at the helm of humanity's last city in the aftermath of a global temperature catastrophe. As civilization crumbles and mankind is faced with vicious blizzards, insatiable beasts, and merciless bandits, it's your job to navigate your people through this chilling reality. Can you outsmart the cold, establish a functioning society, and safeguard the remnants of humanity against brutal external threats? It's time to brace the cold and usher in a new dawn!","Brace yourself as you embark on a chilling journey to a post-apocalyptic glacial landscape. Confronted with lurking dangers, scarce resources and the relentless cold, your sole mission in Whiteout Survival is to ensure the survival of the last city on earth. With complex mechanics and attention to intricate details, every decision you make matters. Are you ready to take the lead and conquer these icy wastes?"],"app_summary":"Idle, strategy, survival—experience all three upon the frozen wastes!"},{"id":379,"app_name":"Nitro Nation World Tour","status":1,"app_developer_name":"Mythical Games","app_score":"4.36","app_category":"Racing","group_label":"Racing","app_package":"com.nitronationrivals.game","introduction":["Nitro Nation World Tour is an exhilarating free-to-play drag racing game that brings the world's fastest cars to your fingertips. It is a high-octane multiplayer car game specifically designed to pay tributes to the international car culture. With a roster of real-world manufacturers' supercars, Nitro Nation pushes the boundary of your racing prowess. Prepare for a full-on car festival with a challenging campaign mode and experience high-stakes duels packed with real speed and fierce competition with racers all around the globe."],"app_summary":"Join an exciting car game for high speed racing tournaments & drag racing"},{"id":397,"app_name":"Dragon Champions: Call Of War","status":1,"app_developer_name":"AppQuantum","app_score":"4.248457","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.playquantum.battler","introduction":["Embark on a fantasy adventure with epic heroes in Dragon Champions: Call Of War. This free, fantasy-themed, turn-based RPG for mobile devices takes you on a thrilling journey filled with tactical battles, intriguing storyline, PvP and PvE engagements, and much more. Meet an array of quests filled with dragon magic as you navigate through the world of Korador fighting against demon warriors and mysterious Reflections. If you are a fan of MMORPG or miss the vibe of old computer games, Dragon Champions is your game. Its graphics and gameplay will give you a nostalgic feel while you also embark on a fresh adventure."],"app_summary":"Become the strongest hero in the Battle Arena! Be a dragon champion in this RPG!"},{"id":291,"app_name":"Magic Jigsaw Puzzles－Games HD","status":1,"app_developer_name":"ZiMAD","app_score":"4.676836","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.bandagames.mpuzzle.gp","introduction":["Immerse yourself in the joyous world of Magic Jigsaw Puzzles－Games HD! Boasting a humongous 120 million global downloads, this game offers a virtual playground for all jigsaw puzzle lovers. Not only is it the largest online jigsaw puzzle community, but it also holds a rich reservoir of over 40,000 HD pictures for you to piece together. In partnership with Nickelodeon, new free daily puzzles and exclusive collections are added, ensuring endless fun! With 50 million puzzles being solved every month, there's plenty for you to enjoy."],"app_summary":"Daily relaxing jigsaw puzzles games for adults! Offline puzzle collection!"},{"id":292,"app_name":"Candy Crush Soda Saga","status":1,"app_developer_name":"King","app_score":"4.621097","app_category":"Casual","group_label":"Casual","app_package":"com.king.candycrushsodasaga","introduction":["Welcome to the refreshing world of Candy Crush Soda Saga! The popular sequel to the legendary Candy Crush Saga, this bubbly game takes match 3 puzzles to unprecedented heights of enjoyment. Bursting with fizzy fun, this game offers more mouth-watering adventures in countless magical dimensions. With a gallery of distinctive modes and exciting season updates adding unique quests, this delightful game promises to quench your thirst for quality entertainment. Whether you prefer to blast through the sweet Soda Saga solo or team up with friends for the highest score, Candy Crush Soda Saga is your go-to recipe for fun."],"app_summary":"A sweet sugar rush puzzle game: Match & Blast candies in soda pop match 3 games!"},{"id":351,"app_name":"Talking Tom & Ben News","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.3626275","app_category":"Entertainment","group_label":"Entertainment","app_package":"com.outfit7.talkingnewsfree","introduction":["Step into the broadcast world with the humorous Talking Tom & Ben News app. Be ready for some rib-tickling fun as Talking Tom and Talking Ben turn into charismatic news anchors, delivering your words in their unique style. Set in a lively TV studio, this app expands your interactive experience with digital news anchors. Watch the duo bring your words to life on the screen as they take turns to mimic you. From amusing banters to laugh-out-loud mishaps, this app promises moments of comedy."],"app_summary":"Tom and Ben are even chattier and more entertaining as TV news anchors!"},{"id":380,"app_name":"Scary Santa Granny","status":1,"app_developer_name":"Anas Msiradi","app_score":"4","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.santascary.horrorgranny","introduction":["Scary Santa Granny Chapter 3 Horror Mod is a chilling game that pulls you into a thrilling hide-and-seek play with the spooky Santa Granny and the eerie Millionaire Grandpa. These aren't just ordinary neighbors, but professional hunters of fear who are always eager to initiate a new neighbor into their haunting survival game! As the unintended player, you are tasked with the daunting job of escaping this creepy house without succumbing to the terror these terrifying figures pose. Will you outsmart Santa Granny and Millionaire Grandpa, or become a resident of their horror mansion? This gripping app could serve as the perfect companion for your Halloween season."],"app_summary":"Granny santa new scary Mood"},{"id":384,"app_name":"Bloons TD Battles 2","status":1,"app_developer_name":"ninja kiwi","app_score":"4.172727","app_category":"Strategy","group_label":"Strategy","app_package":"com.ninjakiwi.bloonstdbattles2","introduction":["Meet Bloons TD Battles 2, the ultimate tower defense game that will sweep you off your feet! With a thrilling return, it's now bigger, better, and more exhilarating than ever. Fight powerful Heroes, make your way through epic Monkey Towers, discover dynamic new Maps and pop as many Bloons as you can to emerge victorious. Enter the arena with fearless spirit to conquer the Hall of Masters and claim the ultimate prize. This game is a cutthroat Player vs Player (PvP) Tower Defense that keeps you on your toes as you cleverly strategize your path to victory."],"app_summary":"Competitive Tower Defense"},{"id":306,"app_name":"Ulala: Idle Adventure","status":1,"app_developer_name":"X.D. Global","app_score":"4.044874","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.xdg.and.wll","introduction":["Immerse yourself in the fun and vibrant world of Ulala: Idle Adventure, an unique idle MMORPG set in the animated and adventurous time of the Stone Age. This interesting mobile game allows you to transport you to ease life of the ancient era while also giving you unlimited adventure possibilities. Whether you're eating, sleeping, commuting, or just seeking a burst of joy, Ulala: Idle Adventure is at your fingertips. Built around a carefree gameplay style, this venture involves warring elements, happy Ulalas, cute monsters, thrilling activities, and many more, all set across the wild landscapes of desert, volcano and the wilderness."],"app_summary":"Ulala is an ultra friendly idle mobile game set in the stone age"},{"id":385,"app_name":"Color Match","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"3.9983892","app_category":"Casual","group_label":"Casual","app_package":"com.JacobVanHaag.ColorMatch","introduction":["Introducing 'Coloring Match', a game that takes you on an adventurous journey into a world of colors. This exciting color-matching game tests your color blending skills by tasking you with painting over 200 unique 3D objects - from simple fruits to luxury cars, and from everyday appliances to exotic animals. Unleash your inner artist and transform bland objects into vibrant masterpieces."],"app_summary":"Blend & Match! Mix colors on paper, compare with objects, aim for perfect match!"},{"id":387,"app_name":"Motorsport Manager Game 2024","status":1,"app_developer_name":"Playsport Games","app_score":"4.0019083","app_category":"Racing","group_label":"Racing","app_package":"com.playsportgames.mmo","introduction":["If you're on the hunt for a heart-pounding, exhilarating mobile racing game, then Motorsport Manager Online 2024 is your pitstop! This spectacular racing manager game not only grants the opportunity to design your own speed machines but also recruit world-class drivers. With real-life competitors from around the globe, you get to test your management skills against ten players on multiplayer online races, all in captivating 3D graphics. Motorsport Manager Online 2024 provides an intoxicating mix of adrenaline, strategy, and competition."],"app_summary":"Manage a car racing team - play real simulation races"},{"id":398,"app_name":"Boba Recipe: Tea Drink Prank","status":1,"app_developer_name":"HIGAME Jsc","app_score":"4.6168222","app_category":"Casual","group_label":"Casual","app_package":"com.higame.apus.drink.boba","introduction":["If you've ever dreamt of being a bubble tea maestro, then Boba Recipe: Tea Drink Prank is your perfect mobile companion! This delightful game application brings to life the fun and creativity of creating your own concoction of bubble tea. Best part? Mistakes are allowed and even encouraged! Go wild and mad, blend the sweetest, wackiest, or even strangest flavors together. No spills, no mess, just pure fun! This app comes straight from the Google Play Store, offering a colorful virtual playground where tea dreams come true!"],"app_summary":"Drink virtual boba tea and prank with friends."},{"id":311,"app_name":"Devil Eater: Counter Attack to","status":1,"app_developer_name":"LoadComplete","app_score":"4.330793","app_category":"Action","group_label":"Action","app_package":"com.loadcomplete.hankanaction","introduction":["Step into the dark world of Devil Eater: Counter Attack, a thrilling action game inspired by the age-old clash between good and evil. The protagonist is imbued with a demonic curse following Elise's death, and what follows is a desperate attempt to retaliate with a dual pistol and cursed demonic force. The soul hangs in a precarious balance as you must continuously defeat the devils in order to guard against their growing influence. With multi-level cities cloaked in ominous shadows and evildoers lurking in every corner, the game sets a chilling stage for a supernatural showdown. The story arc is equally gripping, leaving players haunted by Elise's mysterious demise and the protagonist's curse-driven descent into the abyss."],"app_summary":"Kill evils to guard your soul against demonic force taking over you!"},{"id":316,"app_name":"Airplane Chefs - Cooking Game","status":1,"app_developer_name":"Nordcurrent Games","app_score":"4.4205713","app_category":"Arcade","group_label":"Arcade","app_package":"com.nordcurrent.flyingfever","introduction":["Airplane Chefs - Cooking Game takes the exhilarating heat from the kitchen to the evocative ambiance of the skies. This game is an exciting mash-up of cooking, time-management, and flying across a myriad of bustling cities. Players get the chance to become Airplane Chefs, cooking and serving international cuisines on their very own aircraft. As you soar through the blue heavens, iconic dishes from the world's renowned gastronomic stations, such as Sydney, Singapore, London, and New York, can be prepared and served for your amiable passengers. If the thought of turning your aircraft's pantry into a five-star restaurant excites you, so will the distinct time-management mechanics incorporated in the game."],"app_summary":"Cook tasty & delicious dishes on your own plane and travel the world!"},{"id":317,"app_name":"Flow Free","status":1,"app_developer_name":"Big Duck Games LLC","app_score":"4.639198","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.bigduckgames.flow","introduction":["Immerse yourself in the clever yet addictive world of Flow Free, a simple puzzle game that's anything but ordinary. Challenge your mental agility by connecting matching colors via piping to create a flowing network. Sounds easy, right? But don't be fooled - as the board fills up, so do the complexities. You will easily lose yourself in hundreds of levels - each one designed to both stimulate and engage. From tranquil and relaxed to intense and manic, the difficulty molds itself to suit your play style. So why not put your brain to the test and step into a world where matching colors become a full-fledged adventure?"],"app_summary":"The hit app. Simple and addictive puzzle game. Flow Free® today!"},{"id":390,"app_name":"Score! Hero","status":1,"app_developer_name":"First Touch Games Ltd.","app_score":"4.257997","app_category":"Sports","group_label":"Sports","app_package":"com.firsttouchgames.story","introduction":["Join the illustrious world of soccer and glory with Score! Hero, an outstanding gaming application that lets you live your football fantasies to the fullest. This wildly popular game offers a remarkable blend of puzzle-inspired challenges presented in a real football setting. Experience the thrilling 3D animations, create your unique hero, sign for your favourite team or represent your country; with Score! Hero, you are in for an immersive football journey! The game is free to play. You have the talent and sincerity, now compare yourself with the world's best soccer players. We also ensure you'd be kept entertained with the hundreds of engaging gameplay levels that await you."],"app_summary":"BE THE HERO! Pass, Shoot & Score your way to legendary status!"},{"id":392,"app_name":"Run Race 3D — Fun Parkour Game","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.4399953","app_category":"Sports","group_label":"Sports","app_package":"com.mgc.runnergame","introduction":["Dive into a world full of adrenaline and excitement with Run Race 3D — Fun Parkour Game. This addictive parkour-based game muscle checks your quick thinking and agility as you dash, jump, and climb your way to victory. Pit yourself against others in thrilling races, maneuvering through challenging obstacle courses and rugged terrains. With an array of maps to choose from, each demanding a unique set of dexterity, your parkour skills will be put to an intense test."],"app_summary":"Run fast and jump high to get through the obstacle course on breathtaking tracks"},{"id":501,"app_name":"Galaxy Attack: Shooting Game","status":1,"app_developer_name":"1SOFT","app_score":"4.690973","app_category":"Arcade","group_label":"Arcade","app_package":"com.alien.shooter.galaxy.attack","introduction":["Galaxy Attack: Shooting Game, offered on Google Play, is Earth's last hope in the hands of players worldwide. Prepare to take control of a lone spaceship, your only defense against the threatening alien swarm attack. With an ethereal backdrop of interstellar battles, this space shooting game offers an engaging and immersive gaming experience. The formidable mission is no walk in the park - protecting Earth from the very onslaught of extraterrestrial forces. Each level brings you face-to-face with an increasingly large number of infinity galaxy enemies. Brace yourself to fight the very elements of the cosmos, and save the universe from its evil enemies."],"app_summary":"Save the Galaxy from galaxiga alien - Classic arcade shooter game"},{"id":502,"app_name":"Star Wars™: KOTOR","status":1,"app_developer_name":"Aspyr Media, Inc.","app_score":"4.2548766","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.aspyr.swkotor","introduction":["Step into the shoes of a Jedi in full control of the Force in Star Wars™: KOTOR, an expansive role-playing experience set 4000 years before the Galactic Empire. No detail was spared in adapting this classic game for Android, providing the full KOTOR experience on a mobile platform. Prepare to find your place in a chaotic galaxy, wrestling with the lure of the dark side whilst swatting away Sith, gathering unique allies, and shaping the destiny of an entire galaxy, set against the iconic backdrop of the Star Wars universe."],"app_summary":"Star Wars™: Knights of the Old Republic™"},{"id":258,"app_name":"Zombeast: Zombie Shooter","status":1,"app_developer_name":"AKPublish pty ltd","app_score":"4.838371","app_category":"Action","group_label":"Action","app_package":"com.akpublish.zombie","introduction":["Zombeast: Zombie Shooter is an invigorating offline survival shooter app designed to test your grit and skill in an apocalyptic world swarming with undead. The game thrusts you right into the heart of a city overrun by zombies, where your very survival depends on your ability to morph into an exceptional zombie killer. Each day becomes an adrenaline-pumping struggle for survival as you navigate through a city crawling with grotesque zombies, staging bloody, action-packed hunts in this nail-biting FPS zombie game. Remember, in this grand game of life and death, there's no room for mistakes!"],"app_summary":"Zombie killer in OFFLINE action!"},{"id":321,"app_name":"Rainbow.io Origin Story","status":1,"app_developer_name":"Great Arcade Games","app_score":"4.31","app_category":"Action","group_label":"Action","app_package":"com.blue.monster.rainbow.impostor.v2","introduction":["Find yourself immersed in the enchanting world of Rainbow.io Origin Story, an engaging mobile game that will take your breath away. As an innocent sausage run child abducted on a seemingly ordinary school trip to an amusement park, you are plunged into an otherworldly survival challenge in the Rainbow House. Five eerie nights of endless captivating challenges stand between you and your freedom, as you navigate through a labyrinth haunted by the enigmatic Rainbow Monsters. Each night, a new assignment awaits you, pushing your survival instincts to the limit against your technicolored predators."],"app_summary":"Rainbow Monster But It's Sausage io! Blue Monster is coming!"},{"id":503,"app_name":"Muscle Rush - Smash Running","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.5013056","app_category":"Casual","group_label":"Casual","app_package":"com.muscle.rush","introduction":["Feel small? Don't sweat out in real life, just get into the action-packed world of MUSCLE RUSH - Smash Running. This is a fun-filled running game that can turn a skinny guy into a muscle-flexing superhero. Your challenge involves running through various obstacles while smashing barriers, swatting bullies, and grabbing as many energy drinks and batteries as one can. With MUSCLE RUSH, get ready to experience a growth in musculature power and become a perfect specimen of humanity in a dynamic gaming space."],"app_summary":"Pump up your Muscles and сrush bad guys to Run this crazy Obstacle Course"},{"id":505,"app_name":"Craftsman: Building Craft","status":1,"app_developer_name":"StarGame22","app_score":"3.9370835","app_category":"Simulation","group_label":"Simulation","app_package":"com.craftsman.go","introduction":["Unleash your creativity with Craftsman: Building Craft, a captivating game where your task is to step into the shoes of a craftsman and design awe-inspiring houses and castles from scratch. Dive into a vivid virtual world, where you are the master of your own universe, constructing remarkable structures without any limitations. The beauty of this game lies not just in the creation, but also in the wonderful journey of bringing your innovative designs to life. Whether you choose to play solo or collaborate with friends, Craftsman: Building Craft offers an engaging platform for anyone who enjoys building, designing, and expressing their creative flair."],"app_summary":"You are a craftsman, your task is to design houses, castles and build them"},{"id":326,"app_name":"The Battle Cats","status":1,"app_developer_name":"PONOS Corporation","app_score":"4.5614934","app_category":"Casual","group_label":"Casual","app_package":"jp.co.ponos.battlecatsen","introduction":["The Battle Cats is not your average cat game. This oddly charming and weirdly enjoyable game takes you on a journey across time and space where you command an army of peculiar looking cats as they wage a full-scale war against a host of weird enemies. Not only do you get to develop your feline army without needing to register, but you can also test your strategic wits in the never-ending battle with ALL THE CATS!"],"app_summary":"Weirdly Cute Cats (?) rampage across the world!"},{"id":331,"app_name":"Pure Sniper: Gun Shooter Games","status":1,"app_developer_name":"Miniclip.com","app_score":"4.536135","app_category":"Action","group_label":"Action","app_package":"com.miniclip.realsniper","introduction":["Pure Sniper: Gun Shooter Games, developed by Miniclip, is a thrilling and intricately designed sniper shooting game that offers a realism rarely found in mobile games. The game boasts a robust campaign mode teeming with high-stakes missions that can be played both offline and online. Prepare to be taken into the dangerous depths of enemy territory, armed with an impressive arsenal of sniper rifles, machine guns, shotguns and pistols. From virtually touring cities around the globe to saving hostages from the clutches of criminals, this game will keep you hooked with its endless action and adrenaline-packed missions."],"app_summary":"Hunt your target & become a strong PVP sniper in this Epic 3D sniper FPS game"},{"id":510,"app_name":"Agar.io","status":1,"app_developer_name":"Miniclip.com","app_score":"3.8483772","app_category":"Action","group_label":"Action","app_package":"com.miniclip.agar.io","introduction":["Agar.io is an online multiplayer game that brings you into an arena full of competing cells vying for dominance. Featuring a captivating simplicity, the game invites you to navigate a tiny cell through a grid filled with other players from all around the globe. The goal is simple, but the road to realization is full of danger and strategy. Your task is to grow your cell by devouring others, but remember, there are always bigger cells out there ready to gobble you up. The ultimate quest – to become the biggest cell of all!"],"app_summary":"The browser game phenomenon comes to mobile! It's a cell-eating frenzy!"}]
