[{"id":77,"app_name":"Sonic 4™ Episode I","status":1,"app_developer_name":"SEGA","app_score":"3.9280577","app_category":"Arcade","group_label":"Arcade","app_package":"com.sega.sonic4epi","introduction":["Fasten your seatbelts, it's time to experience the thrilling ride with Sonic 4™ Episode I! A real delight for Sonic fans, this game carries on the saga from where Sonic and Knuckles™ left off. Complementing the heritage of the Sonic series, it incorporates all the classic moves of Sonic along with some enhanced gameplay elements, all carefully weaved into a plethora of unique stages and challenges. In addition to the game's impressive storyline, the reimagined boss battles featuring Dr. Eggman, paves the way for an adrenaline-pumping gaming experience."],"app_summary":"The sequel fans have waited 16 years for is finally here!"},{"id":12,"app_name":"Snake.io - Fun Snake .io Games","status":1,"app_developer_name":"Kooapps Games | Fun Arcade and Casual Action Games","app_score":"4.4007382","app_category":"Action","group_label":"Action","app_package":"com.amelosinteractive.snake","introduction":["Enter the world of Snake.io - Fun Snake .io Games, where the classic arcade game gets a thrilling modern twist. Slither through a competitive playground full of food, grow in size, and survive as long as you can! The objective? Outshine others and become the biggest snake across the leaderboard. This beloved title combines the oldest, cherished snake game mechanics with new and trendy art styles - promising a truly captivating gaming experience."],"app_summary":"Slither Eat Battle. Play this addicting online & offline arcade snake blast game"},{"id":78,"app_name":"Stickman Soccer","status":1,"app_developer_name":"Djinnworks GmbH","app_score":"4.0678897","app_category":"Sports","group_label":"Sports","app_package":"com.djinnworks.ss18","introduction":["Step onto the pitch with Stickman Soccer 3D, the latest installment in the hugely popular Stickman Soccer series. This game has built on the success of the previous titles, amassing an astonishing 75 million players worldwide. It's not just a game - it's a completely immersive soccer experience. With fast-paced gameplay that really gets your heart racing, stunningly fluid animations and the freedom to control every aspect of your team, from the players to the tactics, this is the ultimate soccer game for all the sports enthusiasts out there. Whether you're battling it out in the World Cup or taking on friends in online matches, Stickman Soccer 3D will keep you hooked from the first whistle to the last."],"app_summary":"Pure soccer fun with real soccer feeling! Better than ever!"},{"id":81,"app_name":"Where's My Water?","status":1,"app_developer_name":"Disney","app_score":"4.267974","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.disney.WMW","introduction":["Where's My Water?, a game of the year award-winning puzzle app by Disney, is addictive fun for everyone. Following the shenanigans of Swampy - the lovable alligator who lives in the sewer and just wants to take a shower, players are tasked with solving physics-based puzzles to ensure water reaches its destination. The game takes place underground where players dig through dirt to guide fresh water to Swampy's broken shower, and continue to use their wits to negotiate with dirty water, toxic water, steam, and ooze! Each level offers different and challenging scenarios that ensure the game never gets monotonous. With over 500 levels to tackle, the game promises a whole lot of fun-filled hours."],"app_summary":"Get the GAME OF THE YEAR award-winning puzzler!"},{"id":23,"app_name":"Geometry Dash Lite","status":1,"app_developer_name":"RobTop Games","app_score":"4.3553357","app_category":"Arcade","group_label":"Arcade","app_package":"com.robtopx.geometryjumplite","introduction":["Geometry Dash Lite is an exciting rhythm-based action platformer game that tests your skills to the limit. Guided by electrifyingly addictive tunes, players must jump, fly and flip their way through increasingly challenging levels filled with dangerous passages and sharp obstacles. The pressure is high, but so is the opportunity for endless fun. Prepare for a near impossible quest in this dynamic world of Geometry Dash Lite, a one-touch game that's intricate in design, but simple in concept. With eye-catching graphics and addictive audio, this game will keep you on your toes and entertained for hours on end."],"app_summary":"Jump and fly your way through danger in this rythm-based action platformer!"},{"id":21,"app_name":"Angry Birds 2","status":1,"app_developer_name":"Rovio Entertainment Corporation","app_score":"4.2438946","app_category":"Casual","group_label":"Casual","app_package":"com.rovio.baba","introduction":["Angry Birds 2 is a highly captivating sequel to the infamous Angry Birds saga, brought to you by the team at Rovio. This free-to-play adventure catapults you into a world where you'll team up with your feathered friends, furbish them in wacky hats, participate in thrilling challenges, and initiate an all-out war on those pesky pigs. The gameplay that has stolen the hearts of millions around the globe is back and more exhilarating then ever! So gather your flock, prepare for battle and show the world your slingshot skills in this epic saga of bird versus pig."],"app_summary":"Play the Angry Birds game enjoyed by millions of players every day!"},{"id":24,"app_name":"Moto X3M Bike Race Game","status":1,"app_developer_name":"Ace Viral","app_score":"4.598955","app_category":"Racing","group_label":"Racing","app_package":"air.com.aceviral.motox3m","introduction":["Gear up for a thrilling ride with Moto X3M Bike Race Game. This adrenaline-fueled app brings the much adored web game straight to your mobile device. With beautifully crafted levels, players immerse themselves in off-road circuits, taking leaps over obstacles, and racing against time. Grip your mobile device as if it was your handlebar and prepare for an epic biking adventure."],"app_summary":"High speed bike racing thrills in the fastest moto game around"},{"id":25,"app_name":"Count Masters: Stickman Games","status":1,"app_developer_name":"Freeplay Inc","app_score":"4.331145","app_category":"Action","group_label":"Action","app_package":"freeplay.crowdrun.com","introduction":["Unleash your inner warrior with Count Masters: Stickman Games, a thrilling 3D running game that promises endless fun and excitement. In the world of Count Masters, you're not just a lone fighter, but the commander of a stickman army on a mission to conquer the city. Navigate through shifting gates, amass a mighty horde and clash with rival crowds in intense battles. With countless obstacles to smash and rivals to overcome, this game allows you to immerse yourself in the adrenaline-filled world of stickman battles. Featuring mesmerizing graphics and engaging mechanics, it guarantees hours of non-stop action. Whether you're looking to escape reality for a while or seeking an exciting new challenge, Count Masters has got you covered."],"app_summary":"Join stickman game － runner & fun race with a crowd. Epic battle & running game"},{"id":29,"app_name":"Human Fall Flat","status":1,"app_developer_name":"505 Games Srl","app_score":"3.6388888","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.and.games505.humanfallflat","introduction":["Human Fall Flat is an exceptionally amusing, light-hearted physics platformer crafted in a series of dreamscapes. It is a fantastic blend of fun, adventure, and puzzle-solving, which can satisfy your solo gaming cravings or can be enjoyed with up to 4 players. Exploring a wide range of environments from majestic mansions and castles to adventurous Aztec ruins and snow-capped mountains provides a fresh challenge at every level. There's so much more to look forward to, such as industrial landscapes, spooky nightscapes, and mind-bending puzzles, all meticulously designed to reward ingenuity and exploration.","If mayhem is what you crave, Human Fall Flat has you covered. The multiplayer mode invites up to four players for a unique gameplay experience. An open-ended level structure ensures ample space for hilarious distractions and challenges. The game is also beloved by the streaming community, with billions of views on YouTube, adding to the title's popularity."],"app_summary":"Discover the funniest multiplayer physics puzzle platformer!"},{"id":30,"app_name":"Block Blast!","status":1,"app_developer_name":"Hungry  Studio","app_score":"4.3509135","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.block.juggle","introduction":["Block Blast is a top-rated and entertaining block puzzle game that delivers both challenge and relaxation, depending on your mood. Created to be the perfect pastime, it simultaneously sharpens your mind with its logic-based gameplay. Simple but entertaining, your mission here is to match and clear multicolored blocks on the board. To optimize your score, strategy is the key; skillful placement of the blocks to fill rows or columns does the trick. Block Blast is more than just a game; it’s also a brain gym, boosting your logical thinking and cognitive abilities.","The game presents two immersive modes: Classic Block Puzzle and Block Adventure Mode, ensuring a diverse and delightful gaming experience. Easy enough to play and mentally stimulating, this captivating block puzzle game is free and offline playable. So wherever you are, whether you’re online or off the grid, Block Blast is ready to take you for a delightful jigsaw puzzle journey!"],"app_summary":"Have fun with block puzzle games, match colors, and embark on a puzzle journey!"},{"id":31,"app_name":"Super Mario Run","status":1,"app_developer_name":"Nintendo Co., Ltd.","app_score":"3.9478002","app_category":"Action","group_label":"Action","app_package":"com.nintendo.zara","introduction":["Get ready to embark on an extraordinary adventure with Nintendo's Super Mario Run, a game that promises to bring all the fun of the Super Mario series wrapped in a modern, mobile-friendly package. Ever wanted to play a classic Mario game but found it challenging to manage the controls? Super Mario Run solves that problem by presenting a Mario game that can be played single-handedly. In Super Mario Run, our beloved plumber hero is constantly on the move, and your task is to control his actions by tapping the screen, meticulously timing each leap and bound as you navigate through nostalgic landscapes while collecting coins and reaching the finish line."],"app_summary":"Control Mario with just a tap!"},{"id":32,"app_name":"Among Us","status":1,"app_developer_name":"Innersloth LLC","app_score":"3.8036115","app_category":"Action","group_label":"Action","app_package":"com.innersloth.spacemafia","introduction":["Among Us, developed by InnerSloth, is an intriguing multiplayer game that puts your deception, strategy, and survival skills to the ultimate test. Set in an intergalactic spaceship, you are one of the 4 to 15 crew members preparing the spaceship for departure. But be wary! An impostor lurks amongst you, seeking to eliminate everyone on board. Will you emerge victorious as a diligent crewmate, or deceptive impostor? This thrilling online and local WiFi game compels you to outsmart your friends, or be outsmarted!"],"app_summary":"Join your crewmates in a multiplayer game of teamwork and betrayal!"},{"id":33,"app_name":"Candy Crush Saga","status":1,"app_developer_name":"King","app_score":"4.600762","app_category":"Casual","group_label":"Casual","app_package":"com.king.candycrushsaga","introduction":["Get ready to embark on a candy-filled adventure with Candy Crush Saga - the iconic match-3 puzzle game from the masters at King! Packed with sugary goodness and a delightful mixture of strategy and luck, it has served over a trillion incredible match-3 levels, making it one of the most popular and addictive games around. With tantalizing candy combos and sugar-coated matches, Candy Crush Saga offers a delicious blend of fun and challenge in every level. If you're seeking a supreme gaming experience that keeps you coming back for seconds, then welcome to the world of Candy Crush Saga!"],"app_summary":"Match 3 candies to blast sugar! Spread jam & master the sweetest of puzzle games"},{"id":34,"app_name":"Life Bubble - My Little Planet","status":1,"app_developer_name":"Homa","app_score":"4.126697","app_category":"Simulation","group_label":"Simulation","app_package":"com.ristretto.lifebubble","introduction":["Buckle up for a space adventure like never before with Life Bubble - My Little Planet! Put on your space cowboy hat, venture into the unknown, and shape your very own world as a resourcer. This universe simulation game will have you experience the thrill of creating a tiny monumental world within a bubble. Craft your planet, take down cosmic imposters and partake in rescue missions reminiscent of whiteout survival games. So, are you ready to navigate the depths of space, collect resources, and tailor your little big planet?"],"app_summary":"Expand your life bubble, save astronauts, and conquer the cosmos!"},{"id":319,"app_name":"Punch Bob","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.5387325","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.simplicity.punch_bob","introduction":["Enter the ring with Punch Bob, a game that is centric around an unlikely hero. Despite his size and easy-to-run-out-of-breath nature, our protagonist Bob is more than meets the eye. Buried beneath his hefty exterior lies the heart of a true warrior. Punch Bob mixes wrestling games with brain teasers in a unique way, challenging players to obliterate enemies onscreen solely using Bob's colossal body. Don't be fooled by Bob's slow movement and seemingly less intimidating appearance, our hero doesn't need weapons. He poses a threat so powerful that a mere touch from his massive body induces a heart-stopping fear in his enemies."],"app_summary":"Fight off your enemies in this fun physics platformer game!"},{"id":184,"app_name":"Monster Math 2: Fun Kids Games","status":1,"app_developer_name":"Makkajai: Math Games for 1st, 2nd, 3rd, 4th grade","app_score":"4.2244897","app_category":"Educational","group_label":"Educational","app_package":"com.makkajai.monstermath2free","introduction":["Looking for a fun and engaging way to rekindle your children's interest in math? Say hello to Monster Math 2, a captivating education game designed to better your child’s command of math facts. Monster Math 2 takes your children through an exciting journey with exercises on addition, subtraction, multiplication, division and fractions. This game caters to kids from KG to 5th grade, offering them a fun-filled learning environment. It’s perfect for homeschooling parents as well as classroom settings, tailored to fit your child's aptitude."],"app_summary":"Math practice game for grade k-5. Learn Addition, Multiplication Facts."},{"id":37,"app_name":"Fireboy & Watergirl: Forest","status":1,"app_developer_name":"Oslo Albet","app_score":"3.47","app_category":"Action","group_label":"Action","app_package":"com.osloalbet.forest","introduction":["Immerse yourself in an exciting expedition through the mystical Forest Temple with Fireboy and Watergirl. This app, also known as Fireboy & Watergirl: Forest, is designed to challenge your puzzle-solving skills while offering adrenaline-pumping fun. Using strategy and teamwork, you will venture into the forest, overcome tricky obstacles, and collect precious diamonds. The game is interactive and encourages players to put their wits and reflexes to test while exploring the enchanting forest packed with adventures."],"app_summary":"Help Fireboy and Watergirl explore the Forest Temple!"},{"id":88,"app_name":"Cut the Rope","status":1,"app_developer_name":"ZeptoLab","app_score":"4.4753366","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.zeptolab.ctr.ads","introduction":["Embrace the action-packed journey in 'Cut the Rope', the first installment of an enthralling logical puzzle series. This award-winning, physics-based game is all about a little monster named Om Nom. Stumble upon a mysterious box and help Om Nom satisfy his sweet tooth for candy! It's a game loved by millions across the globe, so jump in now and let the fun begin!"],"app_summary":"Cut the Rope, catch a star, and feed Om Nom candy in this award-winning game!"},{"id":38,"app_name":"Temple Run","status":1,"app_developer_name":"Imangi Studios","app_score":"4.322636","app_category":"Arcade","group_label":"Arcade","app_package":"com.imangi.templerun","introduction":["Get ready for the thrilling escape in Temple Run, now available for Android users! This exhilarating game sees you on the run for your life after stealing a cursed idol from a temple. You're chased relentlessly by a band of Evil Demon Monkeys, and only the quickest reflexes will get you past the hazardous obstacles. With enchanting ancient temple walls and vertiginous cliffs, it's a nerve-wracking chase to survival that you can't afford to miss! Does your wit match your dexterity? Let's find out!"],"app_summary":"Run for your life!"},{"id":39,"app_name":"Subway Surfers","status":1,"app_developer_name":"SYBO Games","app_score":"4.5698676","app_category":"Arcade","group_label":"Arcade","app_package":"com.kiloo.subwaysurf","introduction":["Subway Surfers is an exhilarating action-packed game that will keep gamers of all ages on their toes, developed originally by SYBO and Kiloo. The story unfolds around Jake, Tricky and Fresh who are trying to escape the wrath of a grumpy Inspector and his menacing dog. Join them on their quest and dash as fast as your fingers allow, outmaneuvering and dodging the oncoming trains that pose a threat. It's an urban adventure where players are literally on the run, challenging their reflexes and racing against time to outrun authority while simultaneously exploring the depths of a vast and vivid subway system."],"app_summary":"Help Jake, Tricky & Fresh escape from the grumpy Inspector and his dog!"},{"id":495,"app_name":"Last Empire - War Z: Strategy","status":1,"app_developer_name":"GAME FOCUS NETWORK LIMITED","app_score":"3.9248343","app_category":"Strategy","group_label":"Strategy","app_package":"com.longtech.lastwars.gp","introduction":["Immerse yourself in the apocalyptic world of Last Empire - War Z: Strategy, a thrilling free-to-play strategy RPG and base-building war game. This exhilarating game puts you up against an ever-growing zombie horde intent on stealing your vital resources. Team up with players from around the world as you build an army, establish your kingdom, and unite with empire allies to stave off both zombie and human foes. Is your strategic prowess up to the task? Your survival hangs in the balance."],"app_summary":"Zombie Defense Strategy Game: Build, Battle & Fight Zombies"},{"id":185,"app_name":"Coin Master","status":1,"app_developer_name":"Moon Active","app_score":"4.694825","app_category":"Casual","group_label":"Casual","app_package":"com.moonactive.coinmaster","introduction":["Join millions of players worldwide in the epic saga of Coin Master! In this free-to-play mobile game, you are thrown into a world of deception, plunder and battles. Your journey begins as a humble Viking settling in an uncharted village, but your ambition is to rise and become the one and only Coin Master. Traverse through time and magical lands to challenge others in order to earn the title of the greatest Pirate, Hippie, King, Warrior and Viking! But be warned, the path is treacherous and you will need cunning, strategy, and a bit of luck to rise to the top."],"app_summary":"Play the Best Adventure Game with Friends !"},{"id":143,"app_name":"The King of Fighters ALLSTAR","status":1,"app_developer_name":"Netmarble","app_score":"4.0655737","app_category":"Action","group_label":"Action","app_package":"com.netmarble.kofg","introduction":["Step into the thrilling world of The King of Fighters ALLSTAR! A high octane fighting tournament where only the best emerge victorious. Build a formidable team of fighters, hailing from the entire spectrum of The King of Fighters series, and engage in visceral battles that will keep you on the edge of your seat. With breathtaking graphics, smooth controls, and fast-paced gameplay, this action-brawler game is an absolute must for all fighting game enthusiasts."],"app_summary":"KOF ALLSTAR: A hard-hitting, beat 'em up action game!"},{"id":150,"app_name":"Identity V","status":1,"app_developer_name":"NetEase Games","app_score":"3.5501995","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.netease.idv.googleplay","introduction":["Dive into the world of mystery and horror with Identity V, a 1 vs 4 asymmetrical horror mobile game developed by NetEase. This spine-chilling adventure, with its gothic art style and enigmatic storylines, is sure to give you an adrenaline rush like no other! With 1vs4 gameplay dynamics, prepare yourself for an intense battle of fear, mystery, and survival - because in the world of Identity V, 'Fear Always Springs from the Unknown!'"],"app_summary":"1v4 Asymmetrical Battle Game"},{"id":87,"app_name":"Lords Mobile Shrek Kingdom GO!","status":1,"app_developer_name":"IGG.COM","app_score":"4.4604583","app_category":"Strategy","group_label":"Strategy","app_package":"com.igg.android.lordsmobile","introduction":["Pack your bags and prepare for an epic adventure in the magical world of Lords Mobile Shrek Kingdom Go! In collaboration with Dreamworks Shrek, this real-time mobile strategy game invites you to explore the Kingdoms of Athena with your favorite characters from Shrek. Will you rise to the challenge and become a true Lord, capable of unifying the Kingdoms? Assemble your diverse army of heroes, ranging from dwarfs to steampunk robots, and let the battles begin!","Experience thrilling animated battles in stunning 3D graphics and build your own empire. The game offers a myriad of strategic options, including conducting research, training your troops, and upgrading your buildings. But remember, the power of your heroes is just as essential. So, gather your fearless team, and let them lead your Kingdom to glory!"],"app_summary":"Embark on an adventure in the Kingdoms of Athena with Shrek and his companions."},{"id":56,"app_name":"Super Meat Boy Forever","status":1,"app_developer_name":"Headup","app_score":"4.14","app_category":"Adventure","group_label":"Adventure","app_package":"com.thunderful.smbf","introduction":["Introducing Super Meat Boy Forever, a heart-pumping adventure game that takes place years after the events of Super Meat Boy. In this title, our heroes Meat Boy and Bandage Girl are enjoying a peaceful life with their adorable offspring, Nugget, when out of nowhere, Dr. Fetus shows up and kidnaps Nugget, sparking an epic quest for redemption. As Meat Boy and Bandage Girl, players are thrust into a relentless pursuit of Dr. Fetus, through an unforgiving and challenging world decked with obstacles at every turn."],"app_summary":"Super Meat Boy is BACK!"},{"id":43,"app_name":"Pokémon GO","status":1,"app_developer_name":"Niantic, Inc.","app_score":"4.091664","app_category":"Adventure","group_label":"Adventure","app_package":"com.nianticlabs.pokemongo","introduction":["Pokémon GO is a chart-breaking, global gaming sensation that has already hit over 1 billion downloads. Endorsed by the Game Developers Choice Awards as the 'Best Mobile Game' and named 'Best App of the Year' by TechCrunch, Pokémon GO amazingly blends the real world with the sought-after, exciting world of Pokémons! It invites Trainers around the world on an adventurous journey of discovering various Pokemons in accordance with their real-life locations and surroundings."],"app_summary":"Discover Pokémon worldwide"},{"id":45,"app_name":"Minecraft","status":1,"app_developer_name":"Mojang","app_score":"4.5102677","app_category":"Arcade","group_label":"Arcade","app_package":"com.mojang.minecraftpe","introduction":["Minecraft is a wistfully imaginative world built of versatile blocks, giving you the freedom to transform it into just about anything that comes to mind. The game offers an immersive experience, diving into a limitless universe blessed with haphazard generation of rewarding terrains, abundant with blocks to mine, biomes to venture through and mobs to either befriend or battle. Switch between the constructive and carefree Creative mode and the thrilling, adrenaline-filled Survival mode, or enjoy seamless cross-platform play on Minecraft: Bedrock Edition with buddies for a fun-filled adventure! Regardless of your style, Minecraft is your game, hence you play your way!"],"app_summary":"Millions of crafters have smashed billions of blocks! Now you can join the fun!"},{"id":46,"app_name":"League of Legends: Wild Rift","status":1,"app_developer_name":"Riot Games, Inc","app_score":"3.3157976","app_category":"Strategy","group_label":"Strategy","app_package":"com.riotgames.league.wildrift","introduction":["Dive headfirst into the intense PvP MOBA action that has taken the world by storm with League of Legends: Wild Rift by Riot Games! Rebuilt from scratch to suit the mobile gameplay, Wild Rift guarantees a high-octane 5v5 multiplayer online battle arena (MOBA) game where your skills, strategies, and senses are constantly put under the microscope. Brace yourself for the ultimate PvP multiplayer experience packed with unique content and thrilling features. This is your chance to team up with friends, pick your champ, flex your strategic muscles, and walk the path of victory."],"app_summary":"5v5 MOBA Action! Team up with friends, select a champion, & dive into the Rift."},{"id":52,"app_name":"GODDESS OF VICTORY: NIKKE","status":1,"app_developer_name":"Level Infinite","app_score":"4.624222","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.proximabeta.nikke","introduction":["Step into an exhilarating blend of fantasy and sci-fi with GODDESS OF VICTORY: NIKKE. This game lets you dive deep into an immersive and devastatingly beautiful world where mankind's last hope lies in the wake of alluring maidens, code-named Nikke. It's an RPG shooter game set in a world overrun by an unmerciful invasion where you strategize and command a team of uniquely gifted girls, armed with badass sci-fi weapons. Humanity lies available at their feet, and their victory shall be yours. Every mission, strategy, and bullet fired tells a tale of survival, hope, and vengeance."],"app_summary":"Immersive Sci-Fi RPG Shooter"},{"id":186,"app_name":"Knives Out","status":1,"app_developer_name":"NetEase Games","app_score":"3.8846986","app_category":"Adventure","group_label":"Adventure","app_package":"com.netease.ko","introduction":["Knives Out is an action-packed survival game where realistic graphics meet epic combat. As you land on an extra large map filled with over 100 other players, each seeking survival, your mission entails surviving through the uncertainties that the battlefield presents. Beyond survival, the game packs an intoxicating level of excitement, as you not only battle for your life but also meet new friends on this thrilling journey."],"app_summary":"Start a new era with excitement and love!"}]
