[{"id":414,"app_name":"Teen Titans GO Figure!","status":1,"app_developer_name":"Cartoon Network","app_score":"4.1786942","app_category":"Action","group_label":"Action","app_package":"com.turner.ttgfigures2","introduction":["Get ready for an exciting action-packed journey with Teen Titans Go! Figure. This game is a sequel to the widely popular game, Teeny Titans, and brings with it new adventures, battles, and mysteries to unravel. Your favorite toy store is at risk of closing down, and it is up to you to save the day! Journey through various iconic locations, collect more than 100 figures, and battle it out with villains to protect your store and prove your prowess."],"app_summary":"Collect, customize and battle your favorite DC heroes! Multiplayer Beta is here!"},{"id":415,"app_name":"Moncage","status":1,"app_developer_name":"X.D. Network","app_score":"3.9861112","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.Optillusion.Moncage","introduction":["Moncage is an extraordinary puzzle-adventure game master crafted by Optillusion, where the realm of optical illusion unveils itself in style. Nestled inside a mysterious cube lies a myriad of unique landscapes, be it a hushed church or a bustling amusement park. Although they may appear initially unrelated, as you delve in, you'll discover the mesmerizing intricate connections hidden deep within its corners. Ready your brain cells for a wild kaleidoscope exploration, where every edge of the cube promises a new world beyond your expectations."],"app_summary":"Mind-Boggling Optical Illusions Puzzle Game"},{"id":417,"app_name":"Volcano Island: Tropic Paradis","status":1,"app_developer_name":"PopReach Incorporated","app_score":"4.7717986","app_category":"Adventure","group_label":"Adventure","app_package":"com.kiwi.volcanoisland","introduction":["Volcano Island: Tropic Paradis is an adventurous exploration game that revolves around an uncharted fiery island waiting to be discovered and nurtured. This game will take the gamers on a scintillating journey from being marooned due to a maritime misadventure to leading an island civilization of their dreams. Amid the daunting jungles and the rumbling volcano, gamers will dive into a world of secret treasures, pirate invasions, and the thrill of establishing a thriving colony safe from the volcano."],"app_summary":"Uncover volcanic farms in ourworld & setup bustling garden city.Build and Farm!"},{"id":418,"app_name":"Woodoku - Wood Block Puzzle","status":1,"app_developer_name":"Tripledot Studios Limited","app_score":"4.32867","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.tripledot.woodoku","introduction":["Welcome to the world of Woodoku - a tranquil, yet challenging fusion of wood block puzzle and traditional Sudoku. This addictive pastime will quickly entice you with its calming ambiance and tricky challenges. The intricacy of Sudoku intertwined with the creative delight of wooden block puzzle creates a unique and captivating experience that continuously pushes your boundaries and sharpens your focus. Whether you're an experienced game player or a newbie, Woodoku will wrap you up in a serene vortex of endless fun and mental titillation."],"app_summary":"Logic Puzzles & Brain Games to Test your IQ! Woody Block Puzzle Game Sudoku 99."},{"id":419,"app_name":"Save The Girl","status":1,"app_developer_name":"Lion Studios","app_score":"3.8307803","app_category":"Casual","group_label":"Casual","app_package":"com.xmgame.savethegirl","introduction":["Save The Girl is the long-awaited, tricky, and relaxing puzzle game that you've likely seen all over before. Captivating the smartest and most persistent players with enigmatic brain teasers, only the most cunning will be successful in saving our heroine from the villains hot on her tail. Each level throws you into a unique scenario requiring your wit and IQ to solve. Solve it well, our girl makes it through; make a mistake, and it won't end well for our lady of the stage. An addicting and satisfying game, Save The Girl is sure to grip you with its funny and challenging predicaments. Feel the accomplishment of solving these troublesome tasks and place yourself as the protector of the dashing damsel."],"app_summary":"Can you help her escape?"},{"id":422,"app_name":"Jetpack Joyride","status":1,"app_developer_name":"Halfbrick Studios","app_score":"4.5428615","app_category":"Arcade","group_label":"Arcade","app_package":"com.halfbrick.jetpackjoyride","introduction":["Jetpack Joyride is a high-octane, action-packed endless runner game from the creators of Fruit Ninja. In this game, you join the adventure of Barry Steakfries, a fearless protagonist who is up against sinister scientists in a madcap lab. With bullet-powered jetpacks, crazy vehicles, and over-the-top costumes, the game offers a thrilling experience that keeps players on the edge of their seat. Embark on an endless running quest through a chaotic lab like no other, with original gameplay and plenty of fun and exhilarating moments."],"app_summary":"Powerful Jetpacks, Explosive Vehicles, & Outrageous Costumes. Collect them all!"},{"id":423,"app_name":"Angry Birds Journey","status":1,"app_developer_name":"Rovio Entertainment Corporation","app_score":"4.518451","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.rovio.abcasual","introduction":["Embark on a delightful adventure with the notorious Red and his merry band of feathered friends in Angry Birds Journey. Trade the humdrum of everyday life for the changing seasons filled with challenging levels, zestful puzzles, and joyful destruction! Fuse fun with strategy by launching these restless birds, using them to topple towers, pursue the ever-naughty piggies, and rescue the adorable Hatchlings. Angry Birds Journey loosens the slingshot game to a contemporary and enjoyable experience, perfect for anyone wanting a break from the busy world."],"app_summary":"Fling the Birds, Solve the Puzzles!"},{"id":428,"app_name":"Mask Mixture: ASMR Makeover","status":1,"app_developer_name":"ABI Game Studio","app_score":"4.19802","app_category":"Simulation","group_label":"Simulation","app_package":"com.fennik.facemask.diy.mixture","introduction":["Step into the captivating world of Mask Mixture: ASMR Makeover app! If you're a fan of skin-care, makeup, or ASMR sound, the app opens a gateway to a tranquil, relaxing, and captivating world. Mask Mixture allows you to create your DIY face masks, testing your skills as a beauty consultant, and solving skincare issues. It caters to all skin problems, including acne, dry skin, oily skin, uneven tone, and much more. This app transforms your everyday kitchen ingredients into a full-fledged, personalized beauty mask, taking your beauty game up a notch! This game is all about finding the perfect mix to soothe skin dilemmas."],"app_summary":"ASMR Makeover salon. ASMR facemask making project. Makeup and Skincare."},{"id":429,"app_name":"Harry Potter: Magic Awakened","status":1,"app_developer_name":"Warner Bros. International Enterprises","app_score":"4.2028413","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.netease.wb.goog.hpma","introduction":["Harry Potter: Magic Awakened is an exhilarating and immersive card collection game (CCG) and role-playing game (RPG) set in the beloved wizarding world of Harry Potter. Step into the hallowed halls of Hogwarts, ten years after the defeat of Voldemort, and jump on a magical journey to master spells and summon fantastic beasts. Whether you're a Harry Potter fan or a gaming enthusiast, this game is sure to cast a spell on you.","Just like the Harry Potter series, Magic Awakened goes beyond the limits of traditional games. It ingeniously combines elements of card collection, role-playing, and multiplayer duels into one action-packed game. You can play against friends, taste the life of a Hogwarts student, or explore the forbidden forest, all in the comfort of your mobile. Not to mention, the power is all in your hands to shape your unique wizarding adventure."],"app_summary":"Master the Magic with cards and spells in this Wizarding World adventure!"},{"id":430,"app_name":"BASEBALL 9","status":1,"app_developer_name":"playus soft","app_score":"4.5259614","app_category":"Sports","group_label":"Sports","app_package":"us.kr.baseballnine","introduction":["BASEBALL 9 is a fast-paced, engagingly realistic baseball game that offers a condensed, action-packed gameplay with an array of statistical data. This epic game allows you to step into the shoes of a professional baseball player and take a mighty swing at becoming the Legend League Champion. With a mix of casual characters and serious game mechanics, BASEBALL 9 captures the exciting essence and intricate strategies of baseball, seamlessly combining them into a compact game for the ultimate baseball experience.","BASEBALL 9 is designed to put your baseball skills and strategic abilities to the test with its series of challenges. You're not just a player, but also a manager with the power to rename, gear up, and customize your players. Prepare for some thrilling strikeouts and hit some massive dingers in an offline mode that lets you play anytime, anywhere. So, choose your team, step onto the pitch, and make a beeline for the championship."],"app_summary":"Build and play your own team!\nBaseball at your fingertips! BASEBALL NINE!"},{"id":432,"app_name":"CookieRun: Kingdom","status":1,"app_developer_name":"Devsisters Corporation","app_score":"4.50674","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.devsisters.ck","introduction":["Embark on an epic adventure with CookieRun: Kingdom, an immersive mobile game developed by Devsisters. In this delightful world, our favorite tiny heroes, the Cookies with unique personality and skill, are all voiced by an astoundingly talented cast of voice actors. The story centers around the mysteries of ancient Cookie kingdoms and the battle against the sinister Dark Enchantress Cookie and her dark legion. As the chronicles unfold, players will uncover the secrets and construct their delectable kingdom.","Shape your destiny in CookieRun: Kingdom, where imagination reigns supreme. Work with GingerBrave and his Cookie friends to save Earthbread from the menacing shadows of the Dark Enchantress Cookie. With a distinctive design and striking execution, CookieRun: Kingdom provides you limitless opportunities to craft a kingdom of your dreams, complete with diverse decorations and endless exciting activities."],"app_summary":"Build your Cookie Kingdom and team! An epic town building & adventure RPG game"},{"id":433,"app_name":"Alice's Dream：Merge Island","status":1,"app_developer_name":"Gaming Laboratory","app_score":"4.380342","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.mergeland.alices.wonder.adventure","introduction":["Dive into the magical realm of Alice's Dream: Merge Island, the best merge game available on the Play store. The game transports you into a dreamy universe where you can merge, build, and match your way to create a gorgeous dreamland. A playful adaptation of the classic 'Alice in Wonderland' narrative, it offers an immersive and beautiful gaming world full of characters to meet and wonders to explore. The conceivable combinations of elements in this game are virtually infinite, presenting you with an open-ended gaming adventure full of charm and whimsy."],"app_summary":"Save your very own wonderland by matching and merging!"},{"id":435,"app_name":"Poly Bridge 2","status":1,"app_developer_name":"Dry Cactus Limited","app_score":"4.6245213","app_category":"Simulation","group_label":"Simulation","app_package":"com.drycactus.polybridge2","introduction":["Engage in a challenging, fun-filled expansion of your engineering creativity with Poly Bridge 2. Packed with new levels, mechanics, and a unique physics engine, this game offers even more hours of intriguing fun than you're used to. With the soothing soundtracks provided by Adrian Talens, you can relax and immerse yourself in this puzzle game while remembering to bob your head gently to the acoustic guitar rhythms."],"app_summary":"The acclaimed bridge-building indie-hit is back and better than ever!"},{"id":437,"app_name":"Demon God","status":1,"app_developer_name":"Dreamstar Network Limited","app_score":"4.1443567","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.indie.jz3d.google.en","introduction":["Step into a world of fantasy and myth in Demon God, an idyllic MMORPG where you control your destiny. This captivating game brings you to an unknown realm where the line between good and evil is blurred. Are you destined to be a God or a Demon? The choice is yours. Demon God allows you to develop your characters, choose your classes, group up in dungeons, and battle evil Demons. The new release brings an exciting update where you can return to a new server by rebirth and earn more Jade and Gold. With the power to change your fate in this immortal journey, are you ready to embark on this epic adventure?"],"app_summary":"To be a God or a Demon?"},{"id":438,"app_name":"Farm Land - Farming life game","status":1,"app_developer_name":"Homa","app_score":"4.527906","app_category":"Adventure","group_label":"Adventure","app_package":"com.loltap.farmland","introduction":["Welcome to Farm Land - a game that takes on an interactive exploration of a countryside life. This free game is not just another typical farming simulator; it's an immersive idle farming experience that's fun and engaging. It sends you on exciting adventures as you manage your golden farm, raise various animals like dogs, cows, sheep and hens, and even engage in local trade with other farmers. You get to harvest a wide range of crops that include apples, wheat, tomatoes, eggplants and a host of other veggies and fruits. Plus, there's a whole wide island filled with farm adventures waiting to be explored. So, are you ready to put on your farmer's hat and live the big farm life?","The primary goal in Farm Land is to be the best farmer boy around. You do this by growing fields, milking cows, doing daily harvests, taking care of your animals and hiring workers to build bigger barns. As the season of harvest comes around, you get to sell your products in town and aim to become the greatest farming tycoon."],"app_summary":"Hey farmer boys! Love your big farm? Enjoy harvesting and raise your animal farm"},{"id":439,"app_name":"Help Me: Tricky Story","status":1,"app_developer_name":"ABI Game Studio","app_score":"4.540146","app_category":"Casual","group_label":"Casual","app_package":"com.help.me.please","introduction":["Introducing 'Help Me: Tricky Story', a revolutionary addition to the world of brain games. Equipped with original scenarios taken from real-life experiences, this game will challenge your brain like never before and make you a master of riddles. It’s a fun and exciting brain puzzler that offers the same level of enjoyment as braindom games. Enjoy the thrill of decision making and puzzle solving with its mind-blowing brain teasers and become the king of logic puzzles."],"app_summary":"Help the characters to solve their problem."},{"id":440,"app_name":"Troll Face Quest: Horror","status":1,"app_developer_name":"Azerion Casual","app_score":"4.335372","app_category":"Puzzle","group_label":"Puzzle","app_package":"air.com.spilgames.TrollFaceQuestHorror","introduction":["Are you a fan of scary movies or looking for something that'll give you a few jump scares? Then your search ends here! With the release of Troll Face Quest: Horror, your craving for a terrifying yet hilarious gaming experience can be satisfied. This installment of the incredibly popular game series dishes out references to several of your most loved horror movies, TV shows, and even video games. The game brings scary, funny, and strange-together in an entertaining package that's guaranteed to keep you on your toes!"],"app_summary":"Troll Face Quest is back and this time it’s packed with truly horrifying pranks!"},{"id":443,"app_name":"Attack Hole - Black Hole Games","status":1,"app_developer_name":"Homa","app_score":"4.2869873","app_category":"Arcade","group_label":"Arcade","app_package":"com.redlinegames.attackhole","introduction":["Welcome to Attack Hole - Black Hole Games, an ingenious io game where each player controls a black hole. Your mission? To devour weaponry by moving your black hole around in a hungry frenzy. The premise is simple, but don't be fooled; this game requires strategic thinking and quick reflexes. The race against the clock adds excitement, making each venture down the hole a thrilling journey. In this universe, you are the hoard master, eating your way through obstacles and enemies. Find yourself captivated as you dive into the unique and chaotic world of Attack Hole - Black Hole Games.","Attack Hole challenges players to a unique game mechanics, combining elements of arm swallowing like a vacuum cleaner in a full hall of weapon and bullet stacks. As the name suggests, your black hole ‘attacks’ the arena by engulfing everything in sight. Beyond filling your black hole with bullets and arms, Attack Hole throws a gigantic boss into the mix, taking the game to the next level. Can you become the black hole hero and defeat the boss after devouring the world of weapons? Let's see if you have what it takes."],"app_summary":"Move the black hole to swallow arms down the hole like an attacking hoard master"},{"id":444,"app_name":"Thief Puzzle: to pass a level","status":1,"app_developer_name":"TapNation","app_score":"4.5737705","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.weegoon.thiefpuzzle","introduction":["Step into the tantalizingly twisted world of 'Thief Puzzle: to pass a level', a delightful concoction of brain teasers, escape games, and robbery games that will tease your mind and tickle your whimsy. This addictive puzzle game is an elixir of fun and relaxed gameplay crafted to exercise your grey cells and test your IQ. Every level unfurls a new challenge, making Thief Puzzle a cornucopia of brain-twisting entertainments. It is an offline puzzle game blended perfectly with puzzle jigsaw challenges and thief games. Making you feel like a master thief solving riddles and snatching treasures as you navigate through its intriguing gameplay."],"app_summary":"Solve IQ Brain Test in thief stickman Puzzle Games"},{"id":445,"app_name":"Mafia City","status":1,"app_developer_name":"Phantix Games","app_score":"4.522811","app_category":"Strategy","group_label":"Strategy","app_package":"com.yottagames.mafiawar","introduction":["Immerse yourself in the compelling world of Mafia City, a real-time strategy game that demands your wit and masterful time management. Strive to rise through the ranks and become the revered Godfather. Engage in daring heists, form powerful alliances with fellow players, and claim dominance over the city and the mafia world. With daily challenges, romantic interests to pursue, and a vibrant turf war landscape, this game weaves a thrilling narrative that will keep you hooked!"],"app_summary":"That's how mafia work!"},{"id":449,"app_name":"Lara Croft: Relic Run","status":1,"app_developer_name":"CDE Entertainment","app_score":"4.2113423","app_category":"Action","group_label":"Action","app_package":"com.squareenix.relicrun","introduction":["Embark on a thrilling adventure as Lara Croft in the game - Lara Croft: Relic Run. This action-packed game offers a unique mix of running, driving, and diving through various captivating environments. As Lara Croft, your mission is to unearth ancient relics and uncover a dangerous conspiracy that threatens the world. The game takes you through different landscapes - the jungle, the desert, the mountains - each teeming with secrets and hardships waiting to be discovered and overcome respectively."],"app_summary":"Spectacular running action!"},{"id":450,"app_name":"Carpet Roller - Dress & Rugs","status":1,"app_developer_name":"Apps Mobile Games","app_score":"4.02","app_category":"Arcade","group_label":"Arcade","app_package":"tr.com.apps.carpet.roller","introduction":["Roll up the excitement with Carpet Roller - Dress & Rugs, the much-anticipated game of the year. This riveting game has already made waves on TikTok and proven to be a trendsetter. In a unique blend of fashion and adventure, Carpet Roller sparks joy as you collect pieces to grow a stunning carpet while dodging obstacles. With surprise gifts, exclusive clothing, and a potential spotlight shining on you, this game is all you need to get that adrenaline pumping and your fashion senses tingling."],"app_summary":"Roll on the carpet with your high heels and try to reach the end!"},{"id":452,"app_name":"Tall Man Run","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.1813984","app_category":"Casual","group_label":"Casual","app_package":"com.VectorUpGames.TallManRun","introduction":["Engage yourself in a thrilling battle against the bots in the exhilarating game Tall Man Run. Captivating and engaging, Tall Man Run immerses you in a world where you strive to get taller and wider, with the sole objective of taking out bots and conquering the level. It's no ordinary run and jump game; it cleverly blends strategy and action to offer a uniquely addictive gaming experience. The game is made of various levels of increasing difficulty, each presenting a unique set of challenges that will bring out the competitor in you."],"app_summary":"Run tall, run wide!"},{"id":453,"app_name":"Jackpot Party Casino Slots","status":1,"app_developer_name":"SciPlay","app_score":"4.5650854","app_category":"Casino","group_label":"Casino","app_package":"com.williamsinteractive.jackpotparty","introduction":["Get the party started with Jackpot Party Casino Slots, your personal ticket to the real casino experience! With over 200+ premium casino slot machine games complete with realistic graphics and exciting features, this app exemplifies the best of Las Vegas entertainment. Ideal for those who are looking for a thrilling casino adventure right in the comfort of their own homes, it comes with a generous 45 million coin welcome bonus. From the creators of famed slots like Planet Moolah, 777 slots, and Zeus Slots, this free to play game promises you the ultimate social casino ride, complete with all the thrills and spills that come with spinning to hit the jackpot."],"app_summary":"Hit the Jackpot on Las Vegas Casino Slots! Online Casino Game with Slot Machines"},{"id":455,"app_name":"Sea of Conquest: Pirate War","status":1,"app_developer_name":"FunPlus International AG","app_score":"4.4024143","app_category":"Strategy","group_label":"Strategy","app_package":"com.seaofconquest.global","introduction":["Welcome aboard in the SEA OF CONQUEST: Pirate War! Step into the boots of a legendary pirate captain and embark on an exhilarating seafaring adventure. From the enigmatic heart of the Devil's Seas, a realm bursting with magic, boundless riches, and thrilling quests, you’ll set sail into the uncharted waters. As the reputable pirate captain, you'll undertake the thrill of navigating the unforeseen terrains, the joy of cabin building, the fellowship of forming your fleet, and the honor of customizing your flagship. Your exploits range from heroic pirate duels to strategic maritime confrontations, guaranteeing a spine-tingling experience throughout."],"app_summary":"Command a ship, survive epic battles & conquer the sea in this RPG strategy game"},{"id":456,"app_name":"Dumb Ways to Die 2: The Games","status":1,"app_developer_name":"PlaySide Studios Ltd","app_score":"4.3392024","app_category":"Casual","group_label":"Casual","app_package":"air.au.com.metro.DumbWaysToDie2","introduction":["Coming as a breath of fresh air after the colossal success of Dumb Ways to Die - we introduce to you - Dumb Ways to Die 2: The Games, the sequel that’s got gamers across the world hooked. Riding high on popularity, this game wraps an important train safety message under cute and smile-inducing graphics. Flaunting a wide array of fresh, new levels and challenges, as well as a bevvy of colorful new characters - Dumb Ways to Die 2: The Games is a sparkling gem in the treasure trove of tongue in cheek humor and fun gameplay."],"app_summary":"The official sequel to the world-famous hit game!"},{"id":457,"app_name":"Monster Hunter Now","status":1,"app_developer_name":"Niantic, Inc.","app_score":"3.6246932","app_category":"Action","group_label":"Action","app_package":"com.nianticlabs.monsterhunter","introduction":["Welcome to Monster Hunter Now, a thrilling hunting adventure where the real world becomes your hunting ground. Inspired by the immensely popular Monster Hunter universe, this app summons exciting creatures into your own neighborhood, giving you the chance to become a renowned hunter. Strap yourself in for a real-world Monster Hunter experience, reimagined for mobile, with high fidelity graphics and simplified controls. Whether you're casually strolling through the forest, braving the desert, or venturing into the swamp, be ready, for monsters could appear from anywhere!"],"app_summary":"Hunt Monsters in the real world!"},{"id":459,"app_name":"Dream League Soccer 2024","status":1,"app_developer_name":"First Touch Games Ltd.","app_score":"4.317621","app_category":"Sports","group_label":"Sports","app_package":"com.firsttouchgames.dls7","introduction":["Step into the thrilling world of football with Dream League Soccer 2024. Delivering an unprecedented soccer experience, this game lifts the veil on a visually impressive soccer universe teeming with thousands of licensed players and prestigious clubs. Get lost in the heart of the action, climbing division ranks, customising your team, enjoying immersive match commentary, and watching fully 3D motion-captured animations. Dream League Soccer 2024 not only simulates the beautiful game; it breathes new life into it."],"app_summary":"Official FIFPRO™ licensed soccer"},{"id":460,"app_name":"Goods Sort - Sorting Games","status":1,"app_developer_name":"Mind Crush","app_score":"4.5075655","app_category":"Casual","group_label":"Casual","app_package":"closet.match.pair.matching.games","introduction":["Welcome to the whimsical world of Goods Sort - Match Triple Goods, a delightful casual game that's a perfect blend of strategic thinking and relaxation. This game offers the soothing yet challenging thrill of sorting games, plus the element of excitement in closet sort arrangement. The objective is simple - arrange snacks, beverages and fruits into triple matches. However, the fun is in navigating the 3D models, filling up vast shelves, and unlocking more products! It offers an easy-to-understand yet enjoyable escape that appeals to all ages, especially to those who enjoy a sense of organization and accomplishment."],"app_summary":"Goods Triple creates Match Triple Goods fun of Vending Sort in Closet Sort!"},{"id":461,"app_name":"Finger Heart: Monster Refill","status":1,"app_developer_name":"HIGAME Jsc","app_score":"4.515873","app_category":"Casual","group_label":"Casual","app_package":"com.higame.par.finger.heart","introduction":["Immerse yourself in a charming world full of lovable monsters in Finger Heart: Monster Refill. This delightfully fun game allows you to form finger hearts with unique and adorable monsters. You'll find yourself utterly captivated as you work your way to align your finger with the monsters in order to create the perfect heart. This game requires no prior knowledge or skills; all it takes is your creativity, intuition, and a little bit of luck. Whether it's easy, challenging, or downright hilarious, one thing is certain - you will always be entertained."],"app_summary":"Refill the hole to make perfect finger heart with adorable monster."},{"id":462,"app_name":"Ball Sort Puzzle - Color Game","status":1,"app_developer_name":"Guru Puzzle Game","app_score":"4.8640237","app_category":"Puzzle","group_label":"Puzzle","app_package":"ball.sort.puzzle.color.sorting.bubble.games","introduction":["Enter the colorful world of Ball Sort Puzzle - Color Game, the epitome of relaxation and mental stimulation. This addictive game is not only designed to entertain but to sharpen your mind as well, making it the perfect antidote for stress and everyday worries. With its simple yet challenging gameplay, expect to be engrossed in sorting colored balls into bottles, a task that seems easy at first but grows more complex as you progress, challenging your logic and strategic thinking."],"app_summary":"A little challenging but addictive color sorting game to stimulate your brain!"}]
