[{"id":229,"app_name":"Slendrina: The Cellar","status":1,"app_developer_name":"DVloper","app_score":"4.045","app_category":"Arcade","group_label":"Arcade","app_package":"com.dvloper.slendrinacellarfree","introduction":["Delve into the ominous world of 'Slendrina: The Cellar', a free horror game where the protagonist Slendrina is more menacing than ever before. This spine-chilling game is not for the faint of heart as you will be stepping into Slendrina's territory, a place she detests intrusions. Brace yourself for Slendrina would leave no stone unturned to stop you. Keep in mind, the golden rule to survive – never look back! The game, heavily inspired by the popular Slender Man, will keep you glued to your screens. If a thrill-filled, chilling experience is what you seek, then 'Slendrina: The Cellar' is the game you need to play."],"app_summary":"Slender like Horror game"},{"id":210,"app_name":"Fortnite","status":1,"app_developer_name":"Epic Games","app_score":"4.4","app_category":"Sports","group_label":"Sports","app_package":"fortnite","introduction":["Dive into the world of Fortnite, a vibrant, action-packed multiplayer game that channels the thrill of the battle royale genre. Gearing up with a mix of building, shooting, survival and strategy, Fortnite delivers a high-octane gaming experience. Set in an expansive, destructible environment, playersfrom all corners of the globe compete against each other in the ultimate fight for survival. Team up with your friends or go solo in this epic strategic squad game. With a plethora of diverse gameplay modes, Fortnite offers an endless stream of adrenaline-soaked fun.","On Fortnite, the goal is simple: be the last one standing. But this is easier said than done. The game starts with 100 players airdropped onto an island with no gear. As time passes, the playable area of the island shrinks and the fight intensifies. You will need to scavenge for weapons, resources and building materials, while also crafting impregnable fortresses to protect yourself from enemies. The unpredictable nature of the game and ability to adapt to ever-changing dynamics keeps the excitement levels soaring."],"app_summary":"The world's super popular online games, a variety of guns in the battlefield to play!"},{"id":202,"app_name":"Project Makeover","status":1,"app_developer_name":"Magic Tavern, Inc.","app_score":"4.4335566","app_category":"Casual","group_label":"Casual","app_package":"com.bgg.jump","introduction":["Unleash your inner fashionista with Project Makeover! This entertaining game from the creators at com.bgg.jump lets you indulge in a whirlwind of makeovers to help characters realize their dreams. You'll spend hours dressing up virtual clients with trendy clothes, stylish hairstyles, attractive makeup, and even designer furniture. But it's not all glamour and glitz. You'll also encounter dramatic personalities, ranging from egotistical fashion icons and conniving assistants to stubborn clients in desperate need for a new outfit. Didn’t we all know that fashion is a tough business now?"],"app_summary":"Enliven dramatic clients with chic clothes, hairstyles, makeup and furnitures."},{"id":348,"app_name":"Barbie Dreamhouse Adventures","status":1,"app_developer_name":"Budge Studios","app_score":"3.8959072","app_category":"Simulation","group_label":"Simulation","app_package":"com.budgestudios.googleplay.BarbieDreamhouse","introduction":["Step into the pink-tinted universe of Barbie with Budge Studio's Barbie Dreamhouse Adventures! This immersive mobile app invites you to build your own Barbie DreamHouse experience. Start living your glammed-up fantasy with a string of engaging activities such as baking, dancing, fashion and home designing, and lots more. Explore the sunny landscapes of Malibu with your pink convertible, participate in epic pool parties, give us a fashion spin, and join us for a whole lot of girly fun. This digital dollhouse, with a meteor shower of fun and glamour, allows you to live in a virtual Barbie world with a possibility to make it your own."],"app_summary":"Barbie fashion, design, dress up, cooking, makeovers, nails and fun girl games!"},{"id":349,"app_name":"Ultimate Draft Soccer","status":1,"app_developer_name":"First Touch Games Ltd.","app_score":"4.292308","app_category":"Sports","group_label":"Sports","app_package":"com.firsttouchgames.mpx","introduction":["Explore the thrilling world of soccer with Ultimate Draft Soccer, an innovative gaming app by the award-winning team at First Touch Games. This soccer game offers an exciting fusion of realistic football strategy, rewarding gameplay, and high impact visuals. You'll enjoy the exhilaration of live, multiplayer PVP action while you build your dream team from a pool of FIFPRO™ licensed players. Join us in a seasonal football experience, where your tactics can be brought to life in a beautifully depicted digital arena."],"app_summary":"FIFPRO™ multiplayer soccer game"},{"id":350,"app_name":"Seat Jam 3D","status":1,"app_developer_name":"FOMO GAMES","app_score":"4.5143228","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.magicgs.seatjam","introduction":["Unleash your strategic prowess with Seat Jam 3D, a captivating puzzle board game that will keep you hooked for hours on end. This addictive game constructs a high-stakes setting where you're pressed to solve complex seat assignments, contend with disgruntled passengers, and avoid escalating tensions into frustration. Your ability to think on your feet, foresee difficulties and map out a flawless seating plan will be continually challenged in this fun and rewarding game that possesses an uncanny knack for rekindling the thrill of conquering a difficult task, again and again."],"app_summary":"Sorting Puzzle Game: Can you get all passengers to the right seats?"},{"id":353,"app_name":"Breaker Fun - Rescue Adventure","status":1,"app_developer_name":"Amazbit","app_score":"4.367673","app_category":"Arcade","group_label":"Arcade","app_package":"com.bricksbreaker.balls.crusher.bricks","introduction":["It's time to test your aim and sharp mind with Breaker Fun - Rescue Adventure game, an innovative masterpiece that offers a unique combination of bricks ball crusher and rescue puzzle games. With Breaker Fun, you will be interacting with brilliantly designed challenges that allow you to have endless joy by having non-stop action paired with enthralling rescue adventures. The game envelopes a challenging storyline where the man is trapped, and you got to save him by crushing all the bricks. Decorate your favourite campsites after surpassing the intense bricks breaker levels. The game extends over 3000 levels for you to enjoy and make the most of your leisure time."],"app_summary":"Fun brick breaker with adventure puzzles! Challenging bricks and balls game!"},{"id":354,"app_name":"World of Peppa Pig: Kids Games","status":1,"app_developer_name":"Entertainment One","app_score":"3.4356568","app_category":"Educational","group_label":"Educational","app_package":"com.peppapig.worldofpeppapig_g","introduction":["Unleash your little ones in the exciting World of Peppa Pig: Kids Games. This app is a charming blend of fun and education, packed with hours of interactive games and beautiful animations. The intuitive interface guarantees a user-friendly experience for the youngest users. With a myriad of creative activities, puzzles, and engaging videos, it offers unparalleled entertainment, whether you're at home or on the go. Snorts, giggles, and cheerfulness are part of the package!","Dive into a safe, ad-free environment, where the beloved characters from the award-winning show welcome your children into their world. World of Peppa Pig not only adheres to COPPA and kidSAFE standards but also nurtures creativity and learning. Whether it’s building toys, baking birthday cakes, or throwing tea parties - it’s a place where creativity and imagination bloom."],"app_summary":"Pre-school Games, Activities & Videos with Peppa & Friends: Learn, Create & Play"},{"id":356,"app_name":"Masha and the Bear Educational","status":1,"app_developer_name":"DTC Lab","app_score":"4.4650455","app_category":"Educational","group_label":"Educational","app_package":"com.edujoy.masha.games","introduction":["Dive into the whimsical world of Masha and the Bear with this fantastic app filled with 30 educational games that cater to children up to the age of six. Journey with Masha, a gregarious girl under the care of a friendly bear, and her animal gang on various quests and playful activities. These games are derived from the popular TV series and focus on enhancing cognitive abilities, memory, comprehension, and creativity while ensuring the child has immense fun in the process. It's a magical journey that your kids would love to embark on, so step into the enchanted world of Masha and witness a perfect blend of education and entertainment."],"app_summary":"Have fun learning with Masha and the bear!  Educational Games for kids."},{"id":216,"app_name":"CATS: Crash Arena Turbo Stars","status":1,"app_developer_name":"ZeptoLab","app_score":"4.3336506","app_category":"Action","group_label":"Action","app_package":"com.zeptolab.cats.google","introduction":["Get ready for an adrenaline rush in CATS: Crash Arena Turbo Stars, a game that perfectly blends the thrill of engineering and high-octane combat. As a skilled engineer, you are tasked with designing and crafting a powerful combat machine, arming it with devastating weaponry, and setting it loose in fierce 1v1 battles. This isn’t just a game—it’s a battleground where chaos reigns, where destruction is the norm, and where the ultimate prize awaits the victor."],"app_summary":"Build battle car and dominate!"},{"id":217,"app_name":"Save the Guy: Funny Choice","status":1,"app_developer_name":"Brightika, Inc.","app_score":"4.083387","app_category":"Adventure","group_label":"Adventure","app_package":"com.miniit.save.the.guy.game","introduction":["Ever found yourself doubled over laughing while trying to solve a puzzle? Meet 'Save the Guy: Funny Choice', an innovative and comedic game with an intricate plot that draws you in. This game revolves around using your intellect to make choices that determine a mischievous character’s fate as he plots his escape from a dark prison. The story unfolds with a series of exciting and unpredictable turns based on the choices you make. The essence of ‘Save the Guy’ lies in its black humor, where the more bizarre your choice, the funnier the outcome. So, let loose your curiosity, stretch your IQ and ready your funny bone!"],"app_summary":"Help rescue Guy! Make choices by choosing a weird decision! Inappropriate games!"},{"id":357,"app_name":"Siren Head Game Haunted House","status":1,"app_developer_name":"Ingenious Gamers","app_score":"3.8","app_category":"Action","group_label":"Action","app_package":"com.ig.siren.head.haunted.house.horror.game","introduction":["Welcome to the fear-induced world of Siren Head Game: Haunted House Escape, an immersive horror game where you find yourself stranded in a spine-tingling haunted area due to unexpected car breakdown. If the gripping plot of a haunted house adventure with elements of ghost games was not enough, more terror unfolds, and you suddenly find yourself being haunted by a Scary Siren Head and Crazy Pipe Head. Will you manage to escape this horrific situation or become a permanent resident of this eerie abode? The decision is yours to make. Experience the chilling atmosphere of a truly horrifying game with outstanding graphics and riveting gameplay that is equally appealing and daunting."],"app_summary":"Enjoy Scary Siren Head Games in fun Haunted House 3D action Head Horror Games"},{"id":358,"app_name":"Wild West Cowboy Redemption","status":1,"app_developer_name":"Homa","app_score":"4.198098","app_category":"Action","group_label":"Action","app_package":"com.StudioGamebit.WildWestCowboy","introduction":["Welcome to Wild West Cowboy Redemption, an action-packed western sniper adventure that plunges you into the heart of the untamed Wild West. The game transports you to a vividly-detailed wild western world inspired by Red Dead Redemption and Breath of the Wild, replete with desolate deserts, rugged canyons, and bustling frontier towns. As a standout sheriff, it's your job to display your American marksman and bounty hunting skills. Face all challenging outlaws and prove your mettle as a formidable sniper in the west."],"app_summary":"Take your western sniper, target enemies & survive in this shooting west game!"},{"id":359,"app_name":"Word Search - Classic Game","status":1,"app_developer_name":"Pink Pointer","app_score":"4.4370766","app_category":"Word","group_label":"Word","app_package":"com.pinkpointer.wordsearch","introduction":["Dive into the world of words with Word Search - Classic Game, a perfect amusement for word game enthusiasts. Boasting more than 22000 puzzles spread across 37 languages, this game is designed to challenge you regardless of your skill level. With 3 sizes and 3 difficulties to select from, it promises hours of engaging gameplay while testing your vocabulary skills. Whether you are a language lover or a casual mobile gamer, Word Search - Classic Game is certain to keep you hooked."],"app_summary":"This Word Search game has thousands of puzzles in 37 languages!"},{"id":221,"app_name":"Tower of God: New World","status":1,"app_developer_name":"Netmarble","app_score":"4.61875","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.netmarble.tog","introduction":["Step into an enchanting universe with Netmarble's latest game adaptation, Tower of God: New World. Based on the massively loved webtoon which garnered a whopping 6 billion views globally, this game will whisk you off to a world of magic and battles. Fulfill your destiny as you accompany Bam, Khun, and Rak alongside a host of other characters on an epic journey up the Tower of God. Engage in original tales unique to the game, peppered with heart-pounding moments, and distinctively charming graphics that perfectly encapsulate the essence of the iconic webtoon."],"app_summary":"Half-Year Anniversary Festival Now Live! Play now to get an SSR+ teammate!"},{"id":360,"app_name":"Extra Hot Chili 3D:Pepper Fury","status":1,"app_developer_name":"Alictus","app_score":"4.2956524","app_category":"Casual","group_label":"Casual","app_package":"com.smo.extrahotchili3d","introduction":["Jump into the fiery world of chilies with Extra Hot Chili 3D:Pepper Fury, an exciting and fun game that's bound to challenge your taste buds and gaming skills alike! Are you sufficiently brave to sort and consume the globe’s fieriest peppers? The mantra that chilies make one strong and healthy becomes a reality in this game. Test your mettle by gobbling the brightest and most fiery chilies in this thrilling 3D adventure."],"app_summary":"Try to Handle Chilies!"},{"id":363,"app_name":"Hair Rush","status":1,"app_developer_name":"VOODOO","app_score":"4.0495048","app_category":"Arcade","group_label":"Arcade","app_package":"com.zeebagames.hairrush","introduction":["Gear up for an exhilarating journey of whimsical fun and daring challenges with Hair Rush. Step into a vibrant world where you have to run through a wide array of obstacles, while flaunting your stunning hair that rapidly grows longer and brighter. Glide through delish stars and twist high into the skies, leaving your rivals in the dust. This eccentric fusion of a hair growth and running game offers a unique gameplay experience that is not just addictive, but sheer fun! Grow the most magnificent, longest hair, and perform dizzying flights, all while being part of an enduring race."],"app_summary":"Grow the brightest and longest hair and make dizzying flights!"},{"id":364,"app_name":"Build A Queen","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.310788","app_category":"Casual","group_label":"Casual","app_package":"com.Polystation.BuildABabe","introduction":["Meet Build A Queen, an enticing and pro-fabricated game where you have the power to design the most beautiful queen of the land! It's uniquely tailored, offering an engaging and enthralling experience for both beauty enthusiasts and gamers. In this game, you become a queen-maker; your choices define beauty standards and let you realize your vision. Whether it's graceful elegancy or a daring demeanor, each decision you make shapes the queen's essence, personality, and aesthetic."],"app_summary":"Build the Most Beautiful Queen!"},{"id":236,"app_name":"The Game of Life 2","status":1,"app_developer_name":"Marmalade Game Studio","app_score":"4.5500536","app_category":"Board","group_label":"Board","app_package":"com.marmalade.gol2","introduction":["The Game of Life 2, official sequel to the classic board game The Game of Life, allows you to live a thousand different lives in a thousand different ways. Whether you want to become a Video Blogger or a Robotics Engineer, the choice is yours. The game, which won the 'Best Digital Board Game' at the 2021 Pocket Gamer Awards, has been played by over 50 million people around the globe. It is an incredible adventure in which you customize your peg, jump into your eco-car, and race against your friends and family. Despite its roots in the old family favorite, it offers so many new ways to win with wealth, happiness, and knowledge on the line."],"app_summary":"Play the sequel to Hasbro's classic family board game THE GAME OF LIFE on mobile"},{"id":365,"app_name":"Stupid Zombies","status":1,"app_developer_name":"GameResort","app_score":"4.637867","app_category":"Arcade","group_label":"Arcade","app_package":"com.gameresort.stupidzombies","introduction":["Stupid Zombies is not just a game, it is the ultimate survival challenge with a barrage of the brain-hungry undead. Imagine this - you’re the last human alive and the world is swarming with zombies who are after your brain. Fear not, there's one weapon in your possession - a shotgun. With limited ammunition, the pressure is on, as you must leverage your strategic thinking to bring down as many zombies as possible within the constraints of the ammo supply, over a whopping 960 levels. In the world of Stupid Zombies, it's either eat brain or be brain-eaten."],"app_summary":"Stupid zombies are back and you are humanity's last hope to keep them brainless."},{"id":368,"app_name":"Traffic Escape!","status":1,"app_developer_name":"FOMO GAMES","app_score":"4.586949","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.bonnie.trafficescape","introduction":["Traffic Escape is an exhilarating and addictive 3D puzzle game that tests your mental agility and strategic thinking. It's no ordinary puzzle game, it's a high-stakes race against time as you navigate through gridlocked traffic. The objective? Don't crash! This game transforms ordinary traffic into an exciting brain-teasing puzzle challenge. With its intricate designs and open road concept, it's sure to offer hours of stimulating gameplay. If you're tired of the usual puzzle games and longing for a unique challenge, then Traffic Escape is just what you're looking for.","The game comes from the renowned developers at Bonnie, known for creating engaging games with immersive graphics and compelling gameplay. In Traffic Escape, they have once again shown their prowess. The game uniquely combines elements of strategy, puzzles, and vehicle navigation for a truly engaging experience. It's not just a game; it's a mental workout that flexes your brain muscles. It's perfect for those looking for a blend of fun and strategic challenge."],"app_summary":"Tap to escape from traffic!"},{"id":369,"app_name":"Last Fortress: Underground","status":1,"app_developer_name":"LIFE IS A GAME LIMITED","app_score":"3.8562768","app_category":"Strategy","group_label":"Strategy","app_package":"com.more.lastfortress.gp","introduction":["Dive into the skeleton of a once-thriving human civilization and fight back the apocalypse in Last Fortress: Underground. After the fall of your stronghold, as the Commander, you'll guide the last survivors into a strange, stronghold jutting out from the barren wilderness, which is your last stand to survive the horrifying world dominated by the undead. Juggle the responsibilities of building your bunker, rallying heroes, managing resources, and leading excursions into the infected wilds for supplies. Every decision could mean life or death. The line between the living and the dead has never been so thin!"],"app_summary":"Build and expand your underground fortress to survive the zombie apocalypse!"},{"id":241,"app_name":"The Sims™ FreePlay","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.25916","app_category":"Simulation","group_label":"Simulation","app_package":"com.ea.games.simsfreeplay_na","introduction":["Welcome to 'The Sims FreePlay,' a mobile gaming application brought to you by the creators of The Sims series. This time, you get to enjoy a full Sims experience right on your mobile device! The delineation of your gameplay is pretty simple—create and expand your own SimTown, full of uniquely-styled homes and shops, peopled by Sims with diverse personalities and dreams. You have a lot on your agenda as you work towards bolstering your Sim community, completing missions to earn Simoleons and picking up valuable rewards along the journey. As mayor of your SimTown, the satisfaction of your Sim citizens is your priority, and you can observe their happiness grow as you provide them with fun and fulfilling life experiences."],"app_summary":"What’s your Sims story? Create and customize every aspect of your Sims’ lives!"},{"id":370,"app_name":"Happy Color®: Coloring Book","status":1,"app_developer_name":"X-FLOW","app_score":"4.624795","app_category":"Board","group_label":"Board","app_package":"com.pixel.art.coloring.color.number","introduction":["Discover the joy of colors with the Happy Color®: Coloring Book app. This digital art game blends coloring book puzzles and your favorite Marvel or Disney themes into one. Whether you’re seeking a therapeutic way to de-stress, looking to escape boredom, or need a creative break, Happy Color is your go-to app. With content catering to all ages and lifestyles, it serves as an everyday source of fun, relaxation, and artistic entertainment."],"app_summary":"Coloring art game for adults: paint by number on varied digital art templates"},{"id":372,"app_name":"Creatures of the Deep: Fishing","status":1,"app_developer_name":"Infinite Dreams","app_score":"4.624628","app_category":"Adventure","group_label":"Adventure","app_package":"pl.idreams.cotd","introduction":["Welcome to Creatures of the Deep, an engaging fishing game that perfectly blends exploration, relaxation, and competition for a unique gaming experience. You are set into a mysterious underwater world where you'll interact with local inhabitants, investigate existing threats to the ocean, and strive to catch the world's largest fish! But the adventure doesn't stop there. Be prepared to unveil hidden treasures, engage with crazy anglers around the globe, solve perplexing mysteries, and help save the ocean.","This amazing game is specially crafted for those who believed that fishing could only be a relaxing pastime. In Reality, it's a captivating journey filled with curiosities, challenging puzzles, and fascinating inhabitants of the deep. Come join the global community of anglers and get ready to be hooked with the mesmerizing appeal of 'Creatures of the Deep'."],"app_summary":"Multiplayer fishing adventure game"},{"id":474,"app_name":"Hero Squad!","status":1,"app_developer_name":"8SEC Games","app_score":"4.0320725","app_category":"Arcade","group_label":"Arcade","app_package":"com.eightsec.Shootero","introduction":["Dive into the incredible world of Hero Squad! A riveting survival game available on Google Play. In this game, players find themselves on a fierce battlefield where the sole mission is to survive against an overwhelming horde of monstrous creatures. To stand a chance, players need to craft the finest army, recruit new units, each equipped with destructive weapons.","They will have a diverse arsenal such as Shockbows that send electric arrows to stun enemies, akimbo shooting quickly with a gun in each hand, and shotgunners who blast in a cone to neutralize zombie groups. Not only this, but players also have the option to use explosive grenades to kill shielded troops or control snipers for long-distance shots. Run, fight, and strategize to withstand the onslaught, waiting for your helicopter to save the day."],"app_summary":"Shoot them all!"},{"id":251,"app_name":"Death Park 2: Horror Clown","status":1,"app_developer_name":"Euphoria Horror Games","app_score":"4.6451063","app_category":"Adventure","group_label":"Adventure","app_package":"com.eg.deathpark2","introduction":["Immerse yourself in a world of nightmares and horror with Death Park 2: Horror Clown, an absolute thriller among horror games! Find yourself in an eerie city inundated with secrets, monsters and adventures. Your mission? Save your sister from the ghastly clown and unravel the mystery surrounding Death Park. From dungeons to arenas, your path would be filled with monstrous figures all the way. Will you be able to brave through and reach the end or succumb to the terror that awaits?"],"app_summary":"Be the one who survive this horror and find out the secret of scary clown!"},{"id":252,"app_name":"Space Survivor","status":1,"app_developer_name":"iStar Technology Investment Co Ltd","app_score":"4.0334573","app_category":"Action","group_label":"Action","app_package":"com.scream.imposter.monster.survival","introduction":["Embark on a thrilling survival adventure in space with the gripping mobile game, Space Survivor. Find yourself trapped on a spaceship full of eerie darkness, chilling silence and hostile monsters. Your expedition to discover new planets went wrong when your spaceship was ambushed, infested with dreadful creatures looking to destroy your team. Your prime objective is to survive, secure your refuge, erect a robust defense system, and annihilate these monstrous creatures lurking in the dark corners of your space abode. With each passing moment, this deadly game of survival gets more intense and fearsome. Remember, escape isn't an option here, your ingenuity and courage are your sole weapons against the lurking horror."],"app_summary":"Challenge time! Survive and fight the nightmare monsters in silent rooms"},{"id":373,"app_name":"We Are Warriors!","status":1,"app_developer_name":"Lessmore UG","app_score":"4.063796","app_category":"Strategy","group_label":"Strategy","app_package":"com.vjsjlqvlmp.wearewarriors","introduction":["Step into the world of We Are Warriors! - a thrilling and dynamic strategy game where you muster your army and strive for victory. Assemble your buffet of warriors and spearhead battles across different epochs ranging from the Stone Age to the Modern Age. The game, available on Google Play with the id com.vjsjlqvlmp.wearewarriors, serves up a highly engaging and action-packed gameplay experience that guarantees to keep your adrenaline pumping."],"app_summary":"Evolve through the ages and dominate the battlefield!"},{"id":374,"app_name":"2248 - Numbers Game 2048","status":1,"app_developer_name":"Inspired Square FZE","app_score":"4.829364","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.inspiredsquare.jupiter","introduction":["2248 - Numbers Game 2048 is an exciting and challenging puzzle game that adds a unique twist to the classic 2048 number matching game. The premise is simple; players strive to merge similar numbers -- annually up to the elusive number tile of 4096. This elegantly designed game is a fantastic mental workout, stimulating your mind with the challenge of merging numbers like 1010 and 1024 to progress towards higher figures. Not only does it boost your reflexes, concentration, and memory skills, but the experience itself is addictive, engrossing, and an absolute delight to the senses."],"app_summary":"2048 merge & match puzzle game. Solve & match numbers to 4096, 2024, 1010, 1024!"},{"id":375,"app_name":"Family Guy The Quest for Stuff","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.0188355","app_category":"Adventure","group_label":"Adventure","app_package":"com.tinyco.familyguy","introduction":["Ladies and gentlemen, get ready to embark on a hilariously epic adventure with your favorite Family Guy characters in the one and only, 'Family Guy The Quest for Stuff'. This is not your run-of-the-mill sandbox game, no sir. After Peter Griffin's inevitably problematic encounter with the giant chicken leaves Quahog in ruins, it's up to you and the wacky citizens of our beloved city to rebuild it. Roll up your sleeves and rally your favorite Family Guy characters, dress them up in outrageously funny costumes, send them on ridiculous quests, and brace yourself for bouts of uncontrolled laughter. This game is free, freakin' free, and freakin' fantastic!"],"app_summary":"Build a City & Collect FG Heroes in a Hilarious Sandbox Building Sim. Play FREE!"}]
