[{"id":212,"app_name":"Wordscapes","status":1,"app_developer_name":"PeopleFun","app_score":"4.431039","app_category":"Word","group_label":"Word","app_package":"com.peoplefun.wordcross","introduction":["Prepare for a mind sharpening experience! Wordscapes, created by the makers of Word Stacks, Word Chums, and more, is an up-tempo word puzzle game that keeps over 10 million players hooked. By offering a unique blend of crossword puzzles, word searching tasks, and anagrams, this game promises a world of intellectual challenge and relaxation. Gorgeous landscapes serve as backdrops for the puzzles, offering a visual escape as you engage your brain. Believe us when we say you won't experience a dull moment!"],"app_summary":"Relax your brain with this fun word puzzle game and beautiful landscapes!"},{"id":213,"app_name":"Stylist Girl: Make Me Fabulous","status":1,"app_developer_name":"Coco Play By TabTale","app_score":"4.2175927","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.cocoplay.stylist.girl","introduction":["Stylist Girl: Make Me Fabulous is a makeover game that is sweeping the trendsetters off their feet. Whether you're a makeover enthusiast or not, this game will definitely catch your fancy. You step into the shoes of a high-profile Hollywood stylist whose fashion design talents are making headlines. The fame is real as you dress up renowned fashion models and VIP celebrities, enhancing their star style with fabulous makeovers. You'll be swimming in a sea of diverse fashion design looks for your high-profile clients designed for their big events, while they'll be raving about their new hot tops, dresses, shoes and accessories. Welcome to Hollywood!"],"app_summary":"Fabulous stylist girl games for stylish girls - dress up, makeover and impress!"},{"id":214,"app_name":"Where is He: Hide and Seek","status":1,"app_developer_name":"UltraPub","app_score":"4.420168","app_category":"Action","group_label":"Action","app_package":"com.htt.baby.hunt.hn","introduction":["Are you ready for an entirely different take on the classic game of Hide and Seek? Get geared up for 'Where is He: Hide and Seek'. This game flips the script as it allows you to play as a persistent seeker - a police officer or a granny up against a crafty and mischievous animal. Your mission? Seek them out no matter where they hide. Though it seems simple, it's not quite that. Your targets are sneaky and can hide anywhere, making the chase thrilling and unpredictable. So, brace yourself for an exciting hide-and-seek adventure that will keep you on the edge of your seat!","As a seeker, your role is not just limited to finding hidden targets. You will also have the chance to play hide-and-seek. Use your wit to sneak and hide, or else you will get caught. Unknown corners, suspicious locations, and challenging terrains – as a seeker, you would have to explore them all. In 'Where is He: Hide and Seek', it's not just a game, but a thrilling journey that keeps you hooked until the end."],"app_summary":"Ready for being seeker and find your naughty target"},{"id":215,"app_name":"Flip Master","status":1,"app_developer_name":"MotionVolt Games Ltd","app_score":"4.42627","app_category":"Sports","group_label":"Sports","app_package":"com.motionvolt.flipbounce","introduction":["Harness your inner gymnast with Flip Master, the ultimate trampoline game on mobile! This dynamic and exhilarating experience offers a challenge like no other, defying the laws of physics as you learn and master a dizzying array of moves. From frontflips and backflips to gainers and layouts, every jump and bounce will bring you one step closer to becoming the Master of Trampoline. Whether you're leaping on a backyard trampoline, at the gym, or even in a vibrant circus, Flip Master provides an adrenaline-fuelled journey guaranteed to entertain."],"app_summary":"Trampoline backflips, frontflips & trick stunts! Ultimate adrenaline rush!"},{"id":218,"app_name":"Just Dance Now","status":1,"app_developer_name":"Ubisoft Entertainment","app_score":"3.8605998","app_category":"Music","group_label":"Music","app_package":"com.ubisoft.dance.JustDance","introduction":["Get ready to bust a move with Just Dance Now, an exciting music and dance game brought to you by Ubisoft Entertainment. Relish in the greatest hits of Just Dance that can now be enjoyed anywhere, anytime. Dance your heart out to over 700 top global hits from around the world, featuring tracks from chart-topping artists like BLACKPINK, Skrillex, Camila Cabello, Dua Lipa, and countless more. You will not only get a free song every day but also obtain the golden opportunity to experience music from all around the globe with fantastic choreography and gameplay. Energize your day with the rhythm of Just Dance Now and revamp your daily routine into an electrifying dance party."],"app_summary":"Unleash your inner dancer with Just Dance Now!"},{"id":219,"app_name":"Monster Truck Vlad & Niki","status":1,"app_developer_name":"Studio WW Games","app_score":"4.6615386","app_category":"Educational","group_label":"Educational","app_package":"com.psv.vlad_and_nikita.racing","introduction":["Are you a speed and fun enthusiast? The Monster Truck Vlad & Niki app is calling your name! Have an exciting kids racing experience in an off-road environment with your favorite characters Vlad and Niki. This kid-friendly app lets you choose cool suits, helmets, and monster trucks for an exhilarating race. Zip, zoom, and vroom your way to victory on these easy-to-control cars for kids. Whether you're a little one or a child at heart, join in on the crazy fun and competitive spirit!","Grow a love for racing with your favorite characters and monster trucks—all absolutely free! Get ready to embark on a daring competition through tricky, destroyable obstacles, hills, and valleys in this delightful kids racing game. More monster trucks, more power, and more speed means more thrill and excitement. Buckle up and get ready to destroy, crash, and win!"],"app_summary":"Racing game for kids with Vlad & Niki. Monster trucks and cars for boys"},{"id":220,"app_name":"Pokémon Shuffle Mobile","status":1,"app_developer_name":"The Pokémon Company","app_score":"4.257573","app_category":"Puzzle","group_label":"Puzzle","app_package":"jp.pokemon.poketoru","introduction":["Get ready for an awesome Pokémon adventure with Pokémon Shuffle Mobile, a new and innovative puzzle game. In this game, you'll go head to head against wild Pokémon in exciting puzzle battles. Simply line up three or more Pokémon either vertically or horizontally. Although easy to grasp, the possibilities are vast, promising hours of addictive fun as you battle, collect and level up all your favorite Pokémon. With an array of challenges designed to keep both novice and expert gamers engaged, Pokémon Shuffle Mobile is poised to take your gaming experiences to another level."],"app_summary":"A Pokémon game is coming to smartphones!"},{"id":222,"app_name":"Earn to Die 2","status":1,"app_developer_name":"Not Doppler","app_score":"4.479856","app_category":"Racing","group_label":"Racing","app_package":"com.notdoppler.earntodie2","introduction":["Earn to Die 2 is a captivating game with a thrilling plot, where you find yourself in a zombie infested world, with the compelling need to survive and to get to an evacuation ship waiting on the other side of the country. Your only means of survival is a ramshackle car and a little cash. The game presents a unique mix of adrenaline and fear, and it's up to you to maneuver through the wave of zombies to safety. This game is set to get your heart racing, and it has proven to be five times longer than its predecessor."],"app_summary":"Drive your car through a zombie apocalypse in this epic sequel to Earn to Die!"},{"id":223,"app_name":"Glow Hockey","status":1,"app_developer_name":"Natenai Ariyatrakool","app_score":"4.130147","app_category":"Arcade","group_label":"Arcade","app_package":"com.natenai.glowhockey","introduction":["Glow Hockey takes the tried-and-true sport and delivers it in an entirely new, vibrant and captivating style. This game blends elements of the familiar with cutting-edge graphics that engulf you with rich and colorful glow effects. It offers players unparalleled fluidity and dynamism. With its easy-to-understand but hard-to-master gameplay, players can easily immerse themselves in the world of Glow Hockey. Whether you're challenging yourself against computer opponents or playing with friends on the same device, this hockey game provides engaging gameplay that caters to all levels of players."],"app_summary":"Glow Hockey delivers a new style of hockey game. Easy to play, hard to master."},{"id":224,"app_name":"AFK Summoner：3d IDLE Adventure","status":1,"app_developer_name":"TOJOY GAME","app_score":"0","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.dgame.fallenAngelWar","introduction":["Dive into the world of AFK Summoner: 3D IDLE Adventure, a top-tier gaming experience that blends the ultimate Idle gameplay with a heavy focus on strategy. It offers fun, shocking enjoyment in a game where 3D heroes evolve in a universe teeming with the thrill of the fantastical and the allure of the unknown. Regardless of when and where, your summoned heroes will always be there, fighting for justice and bringing you success from each battle. The game maps out an epic adventure where in-game alliances, rankings, and challenges add a sociable and competitive edge. Rife with more than 100 unique heroes, diverse factions, and a multitude of weapons and equipment, you are invited into a world where every decision and strategy counts."],"app_summary":"We need you to rule the world! And look forward to you to join AFK Summoner!"},{"id":225,"app_name":"Dislyte","status":1,"app_developer_name":"FARLIGHT","app_score":"4.225194","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.lilithgames.xgame.gp","introduction":["Welcome to the world of Dislyte! This game thrusts players into an engrossing comic book universe where urban myths come to life. Venture through a captivating series of comics within an infinitely possible universe. Here, you can build a squad of superhuman Espers, empowered by the gods of myth, who are on a mission to fight the creatures hell-bent on destruction. The unsuspecting land of Grandis lies in ruins due to the chaos brought by 'Miracles', floating structures that emit godly sonic waves. The question lies, will you succumb to the allure of ultimate power or rise as a champion for the people? The answer is at your fingertips."],"app_summary":"Urban Myth Comics Game"},{"id":230,"app_name":"GrandChase","status":1,"app_developer_name":"Kog Co., Ltd.","app_score":"4.2567215","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.kog.grandchaseglobal","introduction":["Join the chase in GrandChase, the epic mobile RPG that’s won over the hearts of over 2 million players globally. Whether you're a new or veteran player, tales of thrilling adventures, gripping narratives and intense battles await you. Posting high ratings and breaking into the top 10 RPG games in 25 countries, GrandChase is definitely a must-try for any RPG fan.","With a vast variety of heroes to choose from, you can build your dream team and test their mettle in various challenges and game modes. Whether you're playing solo or with friends in a guild, there's always something to do in the world of GrandChase."],"app_summary":"GrandChase Returns! Immerse Yourself in an EPIC Adventure\nFor ALL RPG Fans!"},{"id":231,"app_name":"Crowd Battle 3D","status":1,"app_developer_name":"TapNation","app_score":"4.24","app_category":"Action","group_label":"Action","app_package":"com.pinpinteam.crowdbattle3d","introduction":["Crowd Battle 3D is an enticing hyper-casual game that turns you into a leader of an army in the medieval battlegrounds. The mission is as exciting as it sounds - gather a formidable crowd, raid castles, and overpower your enemies in epic duels. This game combines elements of combat and strategy, providing an adrenaline-fueled gaming experience. Armed with legendary stickman warriors, you navigate through deadly arenas, seize castles and claim top dominance in battles. The remarkable feature of this game is the intertwining of intense action and intricate strategy, which guarantees energizing gameplay.","Prepare yourself for the adventure that awaits in this medieval world filled with enemies lurking in every corner. The game pits you against numerous enemy clans, setting the stage for exhilarating clashes and strategic maneuvers. Not every battle is about sheer strength, sometimes strategy can tip the balance in your favor. The trick is striking a balance between gathering a sufficient crowd and launching an attack at the right time. Show off your leadership prowess, earn rewards, and climb the ranks to emerge as the ultimate warrior in the Crowd Battle 3D."],"app_summary":"Gather your army! Build a crowd, Overcome deadly obstacles & Raid Castles!"},{"id":232,"app_name":"Mr Love: Queen's Choice","status":1,"app_developer_name":"Elex","app_score":"3.762636","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.elex.paper.lovegp","introduction":["Step into the exciting world of Mr Love: Queen's Choice, a romance simulation game like no other. This isn't just about sending texts and making phone calls. It's an immersive experience where you'll have the chance to build your career as a media producer while chasing love. The game is set in a universe filled with fantasy, superpowers, and surprises. You'll interact with 4 male characters with different personalities, and latent powers, going through their stories of romance, mystery, and conflict over numerous episodes."],"app_summary":"My superpower is my super love for you."},{"id":233,"app_name":"BLACKPINK THE GAME","status":1,"app_developer_name":"TakeOne Company","app_score":"4.435294","app_category":"Casual","group_label":"Casual","app_package":"com.takeonecompany.bptg1","introduction":["Embark on an all-new journey with BLACKPINK THE GAME. This fantastic app lets you step into the shoes of BLACKPINK's producer and offers you the thrilling opportunity to run your own agency. Not only can you solve puzzles to clear schedules for the iconic K-pop group, but you can also customize them with stunning outfits and explore the BLACKPINK WORLD. Whether you're a fan seeking a fun way to interact with your favorite idols or an avid gamer looking for a fresh challenge, this game promises an unmatched experience."],"app_summary":"The official BLACKPINK game, BLACKPINK THE GAME is in your area!"},{"id":235,"app_name":"Banana Survival Master 3D","status":1,"app_developer_name":"ABI Game Studio","app_score":"4.7578945","app_category":"Simulation","group_label":"Simulation","app_package":"com.abi.banana.survival.master","introduction":["Step into the thrilling world of Banana Survival Master, a 3D survival game infused with action and adventure. As a fan of survival challenges, you'll find this twist on the format both familiar and refreshingly unpredictable. Centred around the popular squid game challenge, this app takes you on a wild ride through a series of increasingly difficult tests of your survival skills. Other players, embodied as Banana Cats, will be your chief rivals as you battle to win big prizes. But be warned, every step you take is watched closely by these competitors, making your journey towards victory a breathtakingly tense experience."],"app_summary":"Play with others 456 Banana Cat players in survival game to win big prizes"},{"id":237,"app_name":"Sand Balls - Puzzle Game","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.262262","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.water.balls","introduction":["Welcome to the world of Sand Balls - Puzzle Game! This isn't just any typical game— it's a game with sand balls! Ever heard of it? We bet not. This fun and intriguing game is more than just a past time, it's a combination of strategy, logic, and excitement! Step into a world where sand isn't just yellow— it's orange, green, pink, purple, blue, and a whole spectrum of vibrant colors! It's not all about catching a ball, but thinking about the best approach to do so."],"app_summary":"Save balls from sand captivity and upgrade your sandy city!"},{"id":238,"app_name":"Animal Crossing: Pocket Camp","status":1,"app_developer_name":"Nintendo Co., Ltd.","app_score":"4.3640265","app_category":"Simulation","group_label":"Simulation","app_package":"com.nintendo.zaca","introduction":["Welcome to Animal Crossing: Pocket Camp, a delightful and immersive mobile game brought to you by Nintendo. In this mini utopia, your creativity and design flair are given full reign as you create a personalized campsite packed with charm and whimsy. From a cozy campground dotted with tents and hammocks by a roaring fireplace to an open-air café bustling with activity or a music festival under a star-like firework-filled sky - your creativity is only limited by your imagination."],"app_summary":"Craft furniture and create your ideal campsite in Animal Crossing: Pocket Camp!"},{"id":239,"app_name":"Dead Cells","status":1,"app_developer_name":"Playdigious","app_score":"4.687137","app_category":"Action","group_label":"Action","app_package":"com.playdigious.deadcells.mobile","introduction":["Dead Cells is a thrilling roguevania action platformer that unfolds within an ever-changing castle filled with uncertainty and danger at every corner. Assume the role of a failed alchemic experiment and explore this expansive castle to unravel the dark mysteries of this eerie island. With its heart-racing action and vibrant 2D universe, Dead Cells will test your combat prowess as lethal weapons and skills come into play against formidable foes and challenging bosses. Available first on PC and consoles, Dead Cells is now making waves on mobile, sinking its claws deeper into the virtual gaming world."],"app_summary":"Kill. Die. Learn. Repeat."},{"id":240,"app_name":"Rider Worlds","status":1,"app_developer_name":"Ketchapp","app_score":"4.321429","app_category":"Arcade","group_label":"Arcade","app_package":"com.ketchapp.rider.evolution.world.race.car.bike.flip","introduction":["Get ready for an adrenaline rush like no other with Rider Worlds, the long-awaited sequel to the legendary Rider game with a whopping 150 million downloads worldwide! This ultimate riding experience comes with brand new 3D graphics that will leave you absolutely enthralled. Step into the unique, vibrant worlds of Rider Worlds, each offering a distinctive riding experience and a ton of content waiting to be unlocked.","Hop on any one of the 18 unique vehicles and plunge into a whopping 150 thrilling challenges that Rider Worlds throws at you. And the excitement doesn't stop there! With 144 custom looks and finishes, pimp your ride until it’s perfect and truly one-of-a-kind."],"app_summary":"The long-awaited sequel to the legendary Rider game!"},{"id":242,"app_name":"Zombie Tsunami","status":1,"app_developer_name":"Mobigame SAS","app_score":"4.512625","app_category":"Arcade","group_label":"Arcade","app_package":"net.mobigame.zombietsunami","introduction":["Take command of a horde of brain-hungry zombies and wreak havoc across the city in Zombie Tsunami, a unique and thrilling game developed by Mobigame. As the undead, you are tasked with attacking the city, converting pedestrians into fellow corpses and forming the largest swarm of zombies in this epic onslaught. With more than 200 million players worldwide, Zombie Tsunami has solidified itself as a fan favourite and an addictive mobile game that offers countless hours of fun and thrills. It is a game you can't afford to miss."],"app_summary":"Attack the city with zombies! Form the biggest horde by making people zombies."},{"id":243,"app_name":"Vector: Parkour Run","status":1,"app_developer_name":"NEKKI","app_score":"4.3526797","app_category":"Arcade","group_label":"Arcade","app_package":"com.nekki.vector","introduction":["Set in a dystopian world, Vector: Parkour Run, a parkour-inspired action game, promises an adrenaline-pumping gaming experience. In a totalitarian regime where freedom seems like a distant dream, you're the exceptional free runner who refuses to be restrained. With your free spirit and the heart of a freerunner, you're determined to break free, challenging the system and fleeing from the clutches of 'Big Brother'. With intuitive controls and sophisticated level design, Vector: Parkour Run is an exhilarating exploration of Parkour, an urban sport that combines agility, strength and swift movements."],"app_summary":"Join the breathtaking chase!"},{"id":244,"app_name":"Paper Fold","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.5640497","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.game.foldpuzzle","introduction":["Welcome to the world of Paper Fold – a unique, brain-stimulating puzzle game that takes the art of paper folding to an enchanting new frontier! In this captivating journey, you'll unravel the stunning magic of origami with each fold you make. The goal of the game is to reveal the hidden shapes concealed within each piece of paper. With every crease you form, you step closer to solving the intriguing mystery that awaits! So, brace yourself for a satisfying expedition of origami mastery – Paper Fold isn't simply a game, it's a serene voyage of discovery.","It's not your typical puzzle game but an exceptional experience that engages your cognition gently and delightfully. In each level, you're not just busy folding - you're taking pleasure in unveiling hidden treasures. This game ensures a euphoric sensation with every accomplished task, making it not just about winning, but continually learning, growing, and improving. Surprises never cease with endless objects waiting to be unfolded!"],"app_summary":"Fold the paper to unveil hidden objects! Play this fun picture game to relax."},{"id":245,"app_name":"Muse Dash","status":1,"app_developer_name":"hasuhasu","app_score":"4.314335","app_category":"Music","group_label":"Music","app_package":"com.prpr.musedash","introduction":["Welcome to the world of Muse Dash, a rhythmic paradise where lovely girls and parkour gaming come together! This breakout game expertly fuses the thrills of running, jumping, and dodging with the pleasures of jamming to catchy music. It's not just a rhythm game; it's a rhythm run! With enough courage and passion, plus a generous dollop of love for our charming girls, anyone can enjoy the seamless integration of music and gaming in Muse Dash. Flex your fingers, tune your ears, and get ready for a rocking adventure."],"app_summary":"Paradise of parkour & rhythm game — Muse Dash!"},{"id":246,"app_name":"Save the Doge","status":1,"app_developer_name":"WONDER GROUP","app_score":"4.3974013","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.miracle.savethedoge.an","introduction":["Step into the delightful and whimsical world of 'Save the Doge', where emotions run high and reflexes run quick. These aren't your ordinary buzzing buddies! The bees are deadly and our adorable Shiba Inu, lovingly named 'Doge', is in dire peril. The game sets you in the role of Doge's guardian, whose primary mission is to shield Doge from the spiteful bees. With quick swipes and clever strategies, you could be the one to protect our furry friend from keeping a safe distance from these dangerous insects. But beware, it's not as easy as it sounds. Are you ready for this adrenaline-packed adventure? Your experience is bound to be as unique and charming as Doge itself."],"app_summary":"Can you save the poor doge?"},{"id":247,"app_name":"DomiNations","status":1,"app_developer_name":"Big Huge Games, Inc.","app_score":"4.1010184","app_category":"Strategy","group_label":"Strategy","app_package":"com.nexonm.dominations.adk","introduction":["Step into the realm of history, where you take on the role of a fearless ruler in DomiNations. This game is more than just a strategy warfare; it's a journey through the pages of human civilization. From the Stone Age to the Modern Era, you are charged with leading your little village into a sprawling metropolis. Clash with civilizations of the past, expand your empire, and secure victory with the might of Romans, the cunning of the Japanese Empire and wisdom of the Greeks."],"app_summary":"Wage war and lead your army to victory. Base building meets online PVP battles"},{"id":248,"app_name":"MARVEL Strike Force: Squad RPG","status":1,"app_developer_name":"Scopely","app_score":"4.0831704","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.foxnextgames.m3","introduction":["Welcome to the epic universe of MARVEL Strike Force, a free-to-play turn-based RPG super hero game. Dive into a riveting battleground where your favourite Super Heroes and Super Villains come together to defend the Earth. Form your ultimate squad of MARVEL characters like Spider-Man, Venom, Iron Man, Hulk, and Black Panther among others, to fight an alien assault. This is unlike anything you've seen before- an action-packed, visually stunning experience that redefines mobile gaming.","Your mission, should you choose to accept it, is to assemble the most powerful squad, strategize your attacks, and take down the most formidable villains of the MARVEL universe. Experience groundbreaking RPG gameplay cinematics and unleash dynamic chain combos with a single tap. Welcome to one of the top RPG games where the fate of the universe is in your hands!"],"app_summary":"Create your own super team with heroes and villains from the Marvel Universe!"},{"id":249,"app_name":"Bounce and collect","status":1,"app_developer_name":"VOODOO","app_score":"3.6765268","app_category":"Arcade","group_label":"Arcade","app_package":"com.dorotheebrondes.bounceandcollect","introduction":["Bounce and Collect, presented by developer Dorothee Brondes, offers an exciting test of skills and wit. In a fun yet challenging environment, your mission in this easy-to-pick-up puzzle game is to gain as many points as possible by dropping balls strategically. The game hooks you with its charming aesthetics, combined with smooth gameplay. With each level up, uncover a new puzzle, setting up a continual cycle of addictive gaming enjoyment. Despite its simplicity, the game offers a strategical depth that keeps you coming back for more, making Bounce and Collect an excellent choice for your next gaming adventure."],"app_summary":"More balls!!!"},{"id":250,"app_name":"Monster Demolition - Giants 3D","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.4663253","app_category":"Racing","group_label":"Racing","app_package":"com.monster.demolition","introduction":["Monster Demolition - Giants 3D is a demolition game where players must save the world by crushing gigantic monsters with their monster trucks. In this action-packed game, players find themselves amidst a pixelated apocalypse, where monstrous forces are wreaking havoc and all that stands between them and humanity's survival is the players' truck. The only way to win is to smash straight into these terrifying beasts and deliver blow after blow until they're completely destroyed."],"app_summary":"Race straight for the action in this wildly demolition game with giants!"},{"id":253,"app_name":"Street Fighter Duel - Idle RPG","status":1,"app_developer_name":"Crunchyroll Games, LLC","app_score":"4.495718","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.crunchyroll.sfduel","introduction":["Unleash your inner warrior with the groundbreaking Street Fighter Duel: Idle RPG. This unique game is a harmonious blend of the timeless Street Fighter arcade series and the increasingly popular idle RPG genre. The game offers fans an opportunity to immerse themselves in the Street Fighter universe, assemble their favorite characters and take part in epic battles, all while enjoying an idle, progression-based gameplay. Designed to cater to both casual fans and avid gamers, Street Fighter Duel feeds your nostalgia while keeping you on your toes with new elements and fresh excitement."],"app_summary":"Unlock summons and upgrade your team of legendary fighters for idle RPG combat!"},{"id":254,"app_name":"MARVEL SNAP","status":1,"app_developer_name":"Nuverse","app_score":"4.405058","app_category":"Strategy","group_label":"Strategy","app_package":"com.nvsgames.snap","introduction":["Step into the dynamic universe of MARVEL SNAP, an awe-inspiring, fast-paced mobile game that has won the prestigious Mobile Game of the Year Award. The game is a digital collectible card game where players create their own deck of cards, each representing unique Marvel heroes or villains with individual powers. The aim is to outsmart your adversary in this strategic game that is designed for both mobile and desktop.","The action-filled gameplay combined with ingenious mechanics makes this game a crowd favorite. With games lasting just about three minutes, MARVEL SNAP is suitable for anyone seeking quick gaming sessions. Dive into the world of MARVEL SNAP and discover why it's adored by millions of players globally!"],"app_summary":"Unleash the entire Marvel Multiverse in this fast-paced card battler."}]
