[{"id":323,"app_name":"Marvel Contest of Champions","status":1,"app_developer_name":"Kabam Games, Inc.","app_score":"4.262055","app_category":"Action","group_label":"Action","app_package":"com.kabam.marvelbattle","introduction":["Marvel Contest of Champions is an epic versus-fighting action game that brings your favorite Marvel Super Heroes and Super Villains to your fingertips. Engage in the ultimate cosmic showdown with characters like Spider-Man, Iron Man, Wolverine and more, awaiting your summons to battle. Assemble a mighty team, embark on your quest and strive to become the Ultimate Marvel Champion. The fate of Marvel Universe lies within your hands! Battle it out against a lineup of vile villains including Thanos, Kang the Conqueror, and many more. This ultimate free-to-play fighting game beckons you to engage in what could possibly be the greatest battles in Marvel history.","If you've been seeking an action-packed adventure, this Marvel Contest of Champions has got you covered."],"app_summary":"Collect and assemble a team of Avengers heroes and villains to win epic battles!"},{"id":177,"app_name":"Gardenscapes","status":1,"app_developer_name":"Playrix","app_score":"4.6750627","app_category":"Casual","group_label":"Casual","app_package":"com.playrix.gardenscapes","introduction":["Welcome to the colorful world of Gardenscapes, a hit from Playrix's Scapes™ series. This is more than just a match-3 puzzle game - it is a full-fledged adventure that takes you on a journey through a glorious garden waiting to be restored to its former beauty. With Austin, your charming in-game butler at your side, you will uncover the secrets the garden holds, restore and decorate different areas, and build your dream garden. From broken fountains to mysterious mazes, Gardenscapes is a unique blend of gameplay, storyline, and fun characters, that offers an exhilarating gaming experience."],"app_summary":"Get ready to be introduced to a wonderful garden!"},{"id":178,"app_name":"Five Nights at Freddy's 3","status":1,"app_developer_name":"Clickteam USA LLC","app_score":"4.5356216","app_category":"Action","group_label":"Action","app_package":"com.scottgames.fnaf3","introduction":["Welcome to a world that's a peculiar mix of childhood memories and pure nightmares - Five Nights at Freddy's 3. This game takes you thirty years past the horrific events at Freddy Fazbear's Pizza. The establishment might be closed and abandoned, but the creepy animatronics that once entertained guests have found a new home in 'Fazbear's Fright: The Horror Attraction'. Brave gamers are dared to survive the terrors revived for an authentic horror experience. A thrilling discovery awaits with the only existing animatronic in this attraction, ready to revive the fear you'd thought was forgotten."],"app_summary":"Childhood nightmares should remain in the past."},{"id":174,"app_name":"Sniper 3D：Gun Shooting Games","status":1,"app_developer_name":"Fun Games For Free","app_score":"4.5016203","app_category":"Action","group_label":"Action","app_package":"com.fungames.sniper3d","introduction":["Embark on an action-packed adventure with Sniper 3D: Gun Shooting Games! This free-to-play game provides a stunning 3D sniping experience. Step into the shoes of a deadly sniper and plunge into high-intensity missions, testing your shooting skills to the limit. With an endless array of firearms and various locations to explore, Sniper 3D offers hours of adrenaline-pumping entertainment. Whether you're offline or on, you can always get in on the action. It's time to prove if you really are the ultimate shooter."],"app_summary":"Online & offline multiplayer FPS shooting game. Play PvP live with your friends!"},{"id":325,"app_name":"Coffee Stack","status":1,"app_developer_name":"Rollic Games","app_score":"4.5273795","app_category":"Racing","group_label":"Racing","app_package":"markergame.coffeestack","introduction":["Imagine starting the day at your own virtual coffee shop! Coffee Stack is a magnificently brewed game that mixes the fun elements of a runner Coffee Shop with a dynamic cup stacking game. This immersive game gives you the opportunity to collect coffee stacks, fill them with various flavors, arrange them in order, serve customers, and earn cash rewards. It all begins with a lone coffee cup. Carefully stack them in a long line and watch your coffee empire rise!"],"app_summary":"Collect & stack coffee cups and upgrade them to earn extra few bucks!"},{"id":327,"app_name":"Toon Blast","status":1,"app_developer_name":"Peak","app_score":"4.6242747","app_category":"Puzzle","group_label":"Puzzle","app_package":"net.peakgames.toonblast","introduction":["Dive into the delightful world of Toon Blast, the ultimate puzzle game brought to you by the creators of Toy Blast. With unique gameplay elements, endless fun, and cheeky cartoon characters, this game offers an immersive gaming experience. Embark on a wild adventure with Cooper Cat, Wally Wolf, and Bruno Bear through a myriad of whacky levels full of challenges and wonder."],"app_summary":"Welcome to the funniest cartoon puzzle adventure!"},{"id":182,"app_name":"Fishdom","status":1,"app_developer_name":"Playrix","app_score":"4.620559","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.playrix.fishdomdd.gplay","introduction":["Immerse yourself in an enchanting underwater realm with Fishdom, a match-3 game that delivers equal parts fun and excitement. This is not just any game; it is an intricate journey to an oceanic world, bursting with vibrant colors and cheeky talking fish. Add layers of fun to your gaming experience as you outfit aquariums and foster a comfortable environment for your finned companions. This free-to-play offering sets the bar high with its unique combination of puzzle-solving, design, and simulation."],"app_summary":"Swap and match to create lovely homes for adorable fish!"},{"id":180,"app_name":"Galaxy Invader: Alien Shooting","status":1,"app_developer_name":"FARM STUDIO","app_score":"4.645491","app_category":"Arcade","group_label":"Arcade","app_package":"com.alienshooter.galaxy.attack2","introduction":["Galaxy Invaders: Alien Shooter - Space Shooter is a thrilling and engaging space combat game. Inspired by classic arcade shooter games, this app takes you on an exhilarating journey beyond the stars. One day, a menacing fleet of aliens from a foreign dimension wage war on our border planets, threatening humanity’s very existence. You, a battle-hardened spaceship pilot, must rise to the occasion, defend our galaxy, and reclaim our position in the universe. With a blend of traditional shoot ‘em up mechanics and modernized gameplay, Galaxy Invaders is a testament to the continued appeal of the arcade shooting genre."],"app_summary":"Arcade space shooting game. Take spaceships. Shoot'em up. Save the Galaxy."},{"id":99,"app_name":"Brawl Stars","status":1,"app_developer_name":"Supercell","app_score":"4.2814054","app_category":"Action","group_label":"Action","app_package":"com.supercell.brawlstars","introduction":["Welcome the arena of Brawl Stars, a fast-paced 3v3 multiplayer and battle royale game designed exclusively for mobile! Whether you prefer playing solo or teaming up with friends, Brawl Stars caters to every style. Take your avatar on a journey across a myriad of game modes, each offering a unique experience. With a wide array of Brawlers to unlock and level up, this game will provide a thrilling ride of just under three minutes each round.","Dive into the Brawliverse, where you can unlock and upgrade your Brawlers, each with their own unique abilities, Star Powers, and Gadgets. Show off your distinct style with custom skins, and battle it out in different locations filled with mystery and adventure. Ready to brawl? Step into the exciting world of Brawl Stars, and may the best Brawler win!"],"app_summary":"3v3 and Battle Royale"},{"id":100,"app_name":"Hearthstone","status":1,"app_developer_name":"Blizzard Entertainment, Inc.","app_score":"4.102796","app_category":"Card","group_label":"Card","app_package":"com.blizzard.wtcg.hearthstone","introduction":["Dive into the world of Hearthstone, the blockbuster strategy card game brought to you by Blizzard Entertainment, the creators of iconic games like World of Warcraft®, Overwatch® and Diablo Immortal®. This award-winning card game offers a perfect blend of tactical depth and accessible gameplay that's easy to grasp yet hard to master. Packed with powerful battle cards, diverse heroes and strategic gameplay, Hearthstone brings the thrill of a classic collectible card game to your mobile and PC screens. And the best part? It's absolutely free to play!"],"app_summary":"Join a community of 100 million players in epic card battle action!"},{"id":209,"app_name":"Piano Fire: Edm Music & Piano","status":1,"app_developer_name":"Adaric Music","app_score":"4.3569107","app_category":"Music","group_label":"Music","app_package":"beatmaker.edm.musicgames.PianoGames","introduction":["Step into a world where the elements of music and gameplay collide in Piano Fire: Edm Music & Piano. With over 100 million players worldwide, this musical challenge has taken the mobile gaming community by storm. Piano Fire combines the thrill of traditional piano games with an electrifying EDM twist. Feel the exciting collision of ice and fire as you get addicted to hot chart-topping tracks from around the globe. This unique game will captivate your senses, ignite your passion for music, and challenge your rhythmic skills."],"app_summary":"Addictive Music Game 2023. Ping the tiles, chase the rhythm & dance with piano!"},{"id":172,"app_name":"Matchington Mansion","status":1,"app_developer_name":"Magic Tavern, Inc.","app_score":"4.4240575","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.matchington.mansion","introduction":["Matchington Mansion is an addictive match-3 puzzle game that's much more than just swiping and crunching candies. This game invites players to delve into a riveting storyline filled with quirky characters and interesting home decor missions. You're tasked with protecting your new mansion from a mischievous cousin, and along the journey, you're able to explore hidden areas, decorate rooms and uncover hidden stories. The game offers the perfect blend of home decor creativity with challenging match-3 puzzles.","The game allows you to put your interior design skills to the test as you renovate and decorate your grand mansion with thousands of DIY decorations. Not only do you get to explore and decorate dozens of rooms, but you also get to spice up your garden, enhancing its charm and elegance. With Matchington Mansion, you’re not just enjoying a puzzle game, you're also improving your home decor skills."],"app_summary":"Home Renovation Puzzle Game"},{"id":328,"app_name":"Tile Family: Match Puzzle Game","status":1,"app_developer_name":"Playflux","app_score":"4.864469","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.tile.match.blockpuzzle","introduction":["Dive into the world of Tile Family: Match Puzzle Game, the ultimate brain teaser that will keep you engrossed for hours on end. It's a unique, Mahjong-inspired tile matching game that is not just incredibly enjoyable but also helps to calm the mind and enhance cognitive abilities. Players are treated to a host of levels that become increasingly challenging, testing the mettle of both novices and seasoned puzzle enthusiasts alike. This game is a fantastic diversion that combines the thrill of matching puzzles with the calm of Mahjong, making it an irresistible offering for anyone seeking fun and a mental workout in equal measure."],"app_summary":"Challenge your brain with tile match puzzle games! Try to match 3 tiles!"},{"id":329,"app_name":"Modern Strike Online: War Game","status":1,"app_developer_name":"Azur Interactive Games Limited","app_score":"4.532893","app_category":"Action","group_label":"Action","app_package":"com.gamedevltd.modernstrike","introduction":["Modern Strike Online: War Game is a thrilling PvP FPS action game that will quench your thirst for adrenaline-pumping battles. This game just brings what you always wanted from free online shooting games and then some! Let the immersive modern warfare tactical shooter game take you on a joyride with PC like quality graphics. Engage in jaw-dropping tense first person online shooters with your comrades. March on to win and conquer the exciting PvP battles, just like Call of Duty, CSGO and PUBG!"],"app_summary":"Online PvP action multiplayer shooting gun game with exciting battles. Join now!"},{"id":330,"app_name":"Gangster City: Mafia Crime","status":1,"app_developer_name":"3D Sim Games","app_score":"3.55","app_category":"Action","group_label":"Action","app_package":"com.gangster.real.crimecity.vegas.simulator3d","introduction":["Dive headfirst into the world of crime with Gangster City: Mafia Crime game, the ultimate gangster simulator. The game takes you into the darkest corners of the underworld, where blurring the lines between right and wrong becomes a necessary survival skill. Set in a beautifully rendered, sprawling open-world city, this free game turns your ordinary days into exciting adventures filled with gunfights, high-speed chases, and much more. It offers a thrilling journey that challenges you to ascend the ranks in the criminal world while dealing with rival gangs, corrupt cops, and dangerous missions."],"app_summary":"Let's play the ultimate gangster with criminals’ plans in Gangster Open World!"},{"id":190,"app_name":"Top Drives – Car Cards Racing","status":1,"app_developer_name":"Hutch Games","app_score":"4.3172274","app_category":"Racing","group_label":"Racing","app_package":"com.hutchgames.cccg","introduction":["Top Drives – Car Cards Racing, from the innovative minds at Hutch Games, is a high-octane driving challenge game that tests both your racing skills and your car knowledge to the limit. This new card collecting game features over 4,000 real-life cars to collect, compare, and compete in racing battles with other players. Build your dream garage of custom cars and create your perfect racing deck for supercharged action against other players. Whether you are fan of American muscle, Japanese sport cars, or swift European rides, you'll find a car that accelerates your excitement in Top Drives."],"app_summary":"Race, upgrade & complete driving challenges in the ultimate strategy motor game."},{"id":191,"app_name":"Honkai Impact 3rd","status":1,"app_developer_name":"miHoYo Limited","app_score":"4.1119237","app_category":"Action","group_label":"Action","app_package":"com.miHoYo.bh3global","introduction":["Honkai Impact 3rd, a flagship product from the creators of the hit game Genshin Impact, is an immersive action role-play game that has captivated players with its fast-paced combat and intricate storylines. Set in a universe where humans battle against creatures born from the mystical energy known as the Honkai, the game delivers an intense action experience with gorgeous details and high-definition cel-shaded graphics."],"app_summary":"HoYoverse 3D Anime Action RPG"},{"id":332,"app_name":"Seashine","status":1,"app_developer_name":"Pated","app_score":"4.5409837","app_category":"Adventure","group_label":"Adventure","app_package":"fr.pated.seashine","introduction":["Experience the thrill of diving into the unfathomable depths of the ocean with Seashine, available on Google Play. Born as a fragile jellyfish in this survival game, your one and only aim is to battle the darkness in the haunting ocean's deep caves. Your life is as transient as the fading light you carry, only protected by your struggle. As you venture into the mysterious abyss, be sure to soak up all the light you can find – it's your only hope to endure a few more seconds in this underwater world. Beware though, the ocean's depth, no matter how poetic it might seem, is teeming with peculiar beings and plants, tucked in the shadows, all waiting hungrily to take a bite at you."],"app_summary":"Explore and survive the mysterious depths of our oceans as a fragile jellyfish."},{"id":333,"app_name":"Family Farm Adventure","status":1,"app_developer_name":"Century Games PTE. LTD.","app_score":"4.5493298","app_category":"Simulation","group_label":"Simulation","app_package":"com.farmadventure.global","introduction":["Dive into the charming world of Family Farm Adventure, an enchanting farm simulator game where productivity meets fantasy. Developed by Century Games Pte. Ltd, this app allows you to cultivate various crops, investigate uncharted islands and establish a thriving farm town. Join Felicia and Toby, our heroic adventurers, as they befriend new characters and solve intriguing puzzles to unfold the game's fascinating narrative. So, get ready to roll up your sleeves and embark on your journey in Family Farm Adventure, transforming your aspirations into a productive reality."],"app_summary":"Rebuild your tropical flower farm and go on wild explorations!"},{"id":334,"app_name":"Avakin Life - 3D Virtual World","status":1,"app_developer_name":"Lockwood Publishing Ltd","app_score":"4.0424633","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.lockwoodpublishing.avakinlife","introduction":["Dive into the boundless universe of Avakin Life - 3D Virtual World, where you get to lead the life of your dreams with limitless possibilities right at your fingertips. Join a world of endless opportunities, where there's no shortage of fashion, adventures, and parties. From curating your aesthetic to designing your dream home, Avakin Life is a world that lets you be unapologetically you. Be it mimicking reality or letting loose of your wildest imaginations, the choice is all yours."],"app_summary":"Meet people and chat with friends in the virtual world of Avakin Life"},{"id":194,"app_name":"Grand Theft Auto: Vice City","status":1,"app_developer_name":"Rockstar Games","app_score":"4.0488334","app_category":"Arcade","group_label":"Arcade","app_package":"com.rockstargames.gtavc","introduction":["Welcome to the vibrant and nefarious world of Grand Theft Auto: Vice City. Transporting players back to the decadence of the 1980s, this game intricately weaves a gritty narrative of one man's insatiable climb to the apex of the criminal hierarchy. Set in Vice City, a sprawling digital metropolis teeming with both the stunning glamor and stark destitution, this game offers an immersive open-world gaming experience packed with endless action and bone-chilling excitement. The game represent the era of big hair, ostentation and pastel suits in the most authentic and impressive way, making it unique and entertaining.","Launched to celebrate its 10th anniversary, Rockstar has remastered Grand Theft Auto: Vice City for delivery on mobile devices. Be it on the beach, in the swamps or amidst the glitzy ghetto, you craft your own destiny, seizing the opportunity to overtake Vice City. With high-resolution graphics, custom controls, new features and countless hours of gameplay, Grand Theft Auto: Vice City is a must-have on your mobile device."],"app_summary":"Welcome back to Vice City. Welcome back to the 1980s."},{"id":206,"app_name":"Multi Surgery Hospital Games","status":1,"app_developer_name":"GamelyVilla","app_score":"3.59","app_category":"Simulation","group_label":"Simulation","app_package":"com.gamelyvilla.multisurgeryhospitaldoctorgame","introduction":["Step into the world of Multi Surgery Hospital Games and become a real-time virtual doctor. This game challenges you to become a professional surgeon and operate all kinds of surgeries simulated almost to the level of reality. You will get to manage your own hospital and treat patients with various ailments. Your mission? Saving lives. With breathtaking surgery simulations incorporated into an intriguing hospital story, this game is perfect for those who enjoy medical games or aspire to become a medical practitioner. Engage in various hospital operations, serve medicines, and deal with challenging surgeries while managing the overall hospital – all in this immersive game."],"app_summary":"Enjoy Virtual Hospital Game And Save Lives Of Patients In Realistic Surgeries."},{"id":335,"app_name":"Pikmin Bloom","status":1,"app_developer_name":"Niantic, Inc.","app_score":"4.6514287","app_category":"Adventure","group_label":"Adventure","app_package":"com.nianticlabs.pikmin","introduction":["Presenting Pikmin Bloom, the game that urges you to step outside and discover an enchanting world! Join Pikmin, the unique creature that bridges the gap between the virtual gaming landscape and outdoors. Stand-out as you unlock walking challenges and collect a colorful troop of Decor Pikmin. This game combines the thrill of discovery, the joy of exercise and the irresistible urge to collect interesting Pikmin. Add fun to fitness while you beautify your surrounding by sprinkling digital blooms."],"app_summary":"Walk on. Game on."},{"id":394,"app_name":"Rhythm Hive","status":1,"app_developer_name":"HYBE IM Co., Ltd.","app_score":"3.3346872","app_category":"Music","group_label":"Music","app_package":"com.superb.rhv","introduction":["Rhythm Hive is a phenomenal rhythm game, introduced by HYBE, a notable name in the realm of entertainment and technology. This app offers you an opportunity to revel in the captivating melodies of renowned artists like BTS, TOMORROW X TOGETHER, ENHYPEN, SEVENTEEN, LE SSERAFIM, and NewJeans. Whether it's a full-blown song or an engaging short version, Rhythm Hive accommodates it all. To amplify your experience further, you can access songs in diverse versions and various forms from debut to the latest tracks."],"app_summary":"Authentic K-POP rhythm game featuring HYBE artists!"},{"id":203,"app_name":"Mario Kart Tour","status":1,"app_developer_name":"Nintendo Co., Ltd.","app_score":"4.3028107","app_category":"Action","group_label":"Action","app_package":"com.nintendo.zaka","introduction":["Mario Kart Tour is a captivating new spin on the beloved Mario Kart series, now available for download on your Android device. This action-packed racing game brings everyone's favorite characters from the Mushroom Kingdom to life, allowing players to participate in adrenaline-filled races on courses inspired by landmarks from around the world. From the energetic streets of Tokyo to the iconic vistas of New York City, every turn presents an opportunity for a thrilling race and a fun challenge."],"app_summary":"Race around the world!"},{"id":201,"app_name":"Asphalt 9: Legends","status":1,"app_developer_name":"Gameloft SE","app_score":"4.4511104","app_category":"Racing","group_label":"Racing","app_package":"com.gameloft.android.ANMP.GloftA9HM","introduction":["Asphalt 9: Legends is a thrilling mobile racing game that lets you take the wheel of real top-tier legendary cars. With high-tier cars from globally recognized manufacturers such as Ferrari, Porsche, and more at your disposal, it’s a gamer’s dream. Journey across real-life locations in single or multiplayer racing modes and get the adrenaline rushing. Developed by the makers of Asphalt 8: Airborne, it promises edge-of-the-seat speed and action with a realistic feel."],"app_summary":"Sports racing game to drift on the streets. Play online solo & multiplayer mode"},{"id":338,"app_name":"Drawing Carnival","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.4407897","app_category":"Simulation","group_label":"Simulation","app_package":"com.dynlwpp.atur129","introduction":["If you're an enthusiast of ASMR coloring games, or fancy yourself a bit of an artist at drawing carnivals, prepare to be entranced by Drawing Carnival! This engaging ASMR coloring game is designed to ignite joy and pique your creativity through a blend of color puzzles and joy doodles. Drawing Carnival offers you a platform where you can freely express your creativity, de-stress, and experience a unique sensory experience all in one. Combining the pleasure of art games with the relaxation of ASMR features, this application brings the fun of the carnival and the zen of coloring right to your fingertips."],"app_summary":"Joy doodle happy color pixel art games. Draw asmr puzzle in this coloring game."},{"id":339,"app_name":"Mighty Party","status":1,"app_developer_name":"PANORAMIK GAMES LTD","app_score":"3.7193072","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.panoramik.mightyparty","introduction":["Welcome to the enchanting world of Mighty Party, a game that will challenge your strategic abilities to the hilt. This role-playing adventure game skillfully blends turn-based strategy and battle RPG elements that will keep you hooked. Collect and upgrade hundreds of unique heroes and monsters, devise your ultimate offensive and defensive strategies with infinite combinations, and rise above in the battle arenas against players from around the globe."],"app_summary":"Exciting mini-games and turn-based battles"},{"id":340,"app_name":"Avatar World: City Life","status":1,"app_developer_name":"Pazu Games","app_score":"4.63363","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.pazugames.avatarworld","introduction":["Step into the realm of Avatar World: City Life, the most avant-garde role-playing game of 2023, brought to you by Pazu Games Ltd. Submerge into an endlessly innovative, cute, and bustling world that thrives with characters, towns, and unimaginable locations. Loaded with boundless avatars and items to interact with, this ingenious masterpiece stretches the limits of gaming creativity."],"app_summary":"Be Whoever You Want!"},{"id":121,"app_name":"Onmyoji","status":1,"app_developer_name":"NetEase Games","app_score":"4.293296","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.netease.onmyoji.gb","introduction":["Enter the world of Onmyoji, where humans and spirits once cohabited in harmony. This mystical realm now faces turmoil as malevolent spirits from the underworld threaten to destabilize the balance. Fortunately, the Onmyoji, gifted humans with the ability to read the stars and draw amulets, are determined to maintain peace and order. Their ability allows them to tame spirits at their will and navigate between the two ever intertwined worlds. Now, you too have the chance to join these brave warrior-cum-sorcerers on their heroic quest."],"app_summary":"SSR Izanami (VA: Yumi Hara) arrives！"},{"id":122,"app_name":"Kim Kardashian: Hollywood","status":1,"app_developer_name":"Glu","app_score":"4.4155655","app_category":"Adventure","group_label":"Adventure","app_package":"com.glu.stardomkim","introduction":["Immerse yourself into the glamorous world of fame and fashion with Kim Kardashian: Hollywood! This app allows you to embark on an exciting journey throughout the most dazzling corners of showbiz, all while interacting with celebrities, choosing your fashion story, and much more. This is not just a game, it's an ultimate Hollywood simulator where every choice you make can lead you to become a world renowned superstar."],"app_summary":"Join KIM KARDASHIAN to find your squad and rise to fame in Hollywood"}]
