[{"id":136,"app_name":"Pirate Treasures: Jewel & Gems","status":1,"app_developer_name":"TAPCLAP","app_score":"4.3588142","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.orangeapps.piratetreasure","introduction":["Ahoy, matey! Get ready for an exciting voyage aboard the world of Pirate Treasures: Jewel & Gems. This game, available on Google Play, is an enchanting blend of strategy, adventure, and match-3 puzzles. As Captain, your task is to lead a daring band of sea dogs, who are all set sail on an exhilarating journey for unimaginable wealth. Along the way, ancient maps will guide you to fascinating match 3 levels where invaluable treasures await. Be prepared for spills and thrills as you embark on this unforgettable voyage for riches galore!"],"app_summary":"Get ready for amazing puzzles and charming gems in exciting match 3 game!"},{"id":137,"app_name":"My Talking Tom 2","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.2442756","app_category":"Casual","group_label":"Casual","app_package":"com.outfit7.mytalkingtom2","introduction":["The highly entertaining gaming sensation, My Talking Tom 2, makes a celebrated return promising more laughter and merriment than ever before. Developed by Outfit7, this eccentric virtual pet game offers an exciting blend of fun-filled activities to engage you. At the heart of it all is the funny and charming cat, Tom, who can't wait to flaunt his new wardrobe, improved skills, and some spectacular special features. He's ready to play, to explore, and to make your game-time a riot.","Embrace the joy of a well-rounded gaming experience with a dash of humor and a hefty dose of excitement. With My Talking Tom 2, you're not just playing a game - you're embarking on a journey filled with incredible adventures and countless memories. Come, meet Tom and allow his quirks and quirpiness to brighten up your day!"],"app_summary":"Every day is an adventure with the cool virtual pet, Talking Tom."},{"id":139,"app_name":"War Robots Multiplayer Battles","status":1,"app_developer_name":"MY.GAMES B.V.","app_score":"4.294462","app_category":"Action","group_label":"Action","app_package":"com.pixonic.wwr","introduction":["Join the world of War Robots Multiplayer Battles, a fierce shooter game where the battlefield fits right into your pocket! This action-packed adventure invites players from all across the globe to engage in epic PvP battles. Rub shoulders with the toughest, smartest, and quickest pilots in a world dominated by giant robots. Be prepared for sudden attacks, unique tactical maneuvers, and sneaky enemy tactics. Your strategic acumen will be tested as you destroy, capture, upgrade, and constantly become stronger. With your skills, prove the world who's the best mech commander in the War Robots universe."],"app_summary":"Win the Great Iron War! 3D mech robot shooter in PvP mode!"},{"id":140,"app_name":"Poppy Playtime Chapter 1","status":1,"app_developer_name":"Mob Entertainment","app_score":"4.1374764","app_category":"Adventure","group_label":"Adventure","app_package":"com.MOBGames.PoppyMobileChap1","introduction":["Poppy Playtime Chapter 1 is a heart-pounding game that combines horror, adventure, and puzzle-solving in one package. Set in an abandoned toy manufacturing facility, players are challenged to stay alive while surrounded by revengeful toys that come alive. The former toy industry giant, Playtime Co., has turned into a mysterious playground here you reveal the eerie mystery of the disappearance of its workers.","Playtime Co. was once the king of the toy industry, but the unsettling events have left it desolate and cryptic. It's now up to you to venture into the unknown, braving the terror, solving ingenious puzzles, and uncovering the truth about what happened years ago. Are you brave enough to face the animated toys in the spooky, silent factory?"],"app_summary":"The Official Poppy Playtime Mobile Game!"},{"id":144,"app_name":"Hollywood Story®: Fashion Star","status":1,"app_developer_name":"NANOBIT","app_score":"4.5158916","app_category":"Adventure","group_label":"Adventure","app_package":"org.nanobit.hollywood","introduction":["Are you a big fan of glitz, glamour and Hollywood Stardom? Hollywood Story®: Fashion Star is the perfect application for you! It’s a game where you can experience the thrill of becoming a star in the Hollywood industry. Your journey begins on the star-studded streets of Hollywood, with an aim to become a true Hollywood icon. Not only will you aim to climb the career ladder, but you'll also design your fashion lines, bask in the media frenzy, and socialize with fans and celebrities. This spectacular journey is filled with opportunities to dominate the red carpets, hang out with fans, friends and followers, shoot blockbusters and immerse yourself in the Hollywood lifestyle.","More than a simple game, Hollywood Story: Fashion Star allows you to step into the shoes of a true Hollywood Star. Engage with an interactive world filled with exquisite details, from the hustle-bustle of the streets to the uptown opulence in Beverly Hills and beyond. The game offers a genuine taste of Hollywood star life with an interactive storyline, rich narratives, exciting locations and exceptional features."],"app_summary":"Shoot movies, rise to fame and become a fashion icon in this dress-up game!"},{"id":146,"app_name":"The Sun Origin Post Apocalypse","status":1,"app_developer_name":"AGaming+","app_score":"4.115942","app_category":"Action","group_label":"Action","app_package":"com.agaming.thesun.origin","introduction":["Unleash your inner survivor with The Sun: Origin - an action-packed RPG set in a frighteningly realistic post-apocalyptic wasteland. This gripping game pushes your limits, forcing you to carve out a path of survival in a bleak and dangerous world. Roam the treacherous wastelands, fortify your character and battle against mutants, marauders, and other survivors. Sound tough? It is. But it's also immensely rewarding. Challenge yourself and unlock the survivor within you as you push past the hardships and win the battle that is survival."],"app_summary":"Post-apocalyptic action-shooter RPG."},{"id":147,"app_name":"Sonic the Hedgehog™ Classic","status":1,"app_developer_name":"SEGA","app_score":"4.141365","app_category":"Action","group_label":"Action","app_package":"com.sega.sonic1px","introduction":["Get ready to blast into the past with Sonic the Hedgehog™ Classic, the game that kick-started a global gaming phenomenon! Now optimized for mobile devices, you can enjoy this SEGA classic game in a new modern perspective. Sonic the Hedgehog™ Classic is a part of the SEGA Forever classic arcade collection, bringing back the golden era of 90's gaming right to your mobile device. Whether you're an old-time fan who loves nostalgia, or a gaming newbie looking for a rapid adventure, Sonic the Hedgehog™ Classic always serves up a good time!"],"app_summary":"SEGA's platform hit returns with Sonic The Hedgehog on mobile!"},{"id":151,"app_name":"Jungle Animal Hair Salon 2","status":1,"app_developer_name":"TutoTOONS","app_score":"4","app_category":"Educational","group_label":"Educational","app_package":"com.tutotoons.app.jungleanimalhairsalon2.free","introduction":["Step into the exciting world of Jungle Animal Hair Salon 2, the top-notch kids game where fashion and nature poetically converge. This TutoTOONS' magnum opus is an invitation into a thrilling tropical adventure complete with pet care activities, beauty salon challenges but more importantly, a test for the limits of your creativity. Seize the chance to pamper and style a diverse range of jungle animals like leopard Amy, elephant Sarah, zebra Gizelle, monkey Maya and toucan Rosa who all seek your unique fashion touch for their summer makeover. Your journey to becoming the best pet beauty stylist begins on the sandy beaches of the tropics.","Push your creative boundaries as you design stylish and fancy clothes, play around with different hairstyles, or even mix and match carnival accessories. Each animal has its own style preferences, presenting you with unique and intricate fashion challenges to solve. But fun doesn’t end there- you’ll also master the art of making fruit slushies, cleaning messy animals, and throwing memorable Brazilian carnivals. No matter what you like, Jungle Animal Hair Salon 2 has something in store for everyone."],"app_summary":"Cool hairstyles, exotic outfits, beach beauty & crazy pet care games for kids!"},{"id":152,"app_name":"The Escapists: Prison Escape","status":1,"app_developer_name":"Team 17 Digital Limited","app_score":"4.125498","app_category":"Strategy","group_label":"Strategy","app_package":"com.team17.escapists","introduction":["Dive into the world of The Escapists: Prison Escape, a thrilling sandbox game that turns you into a crafty prisoner. Being behind bars doesn't mean you can't have some fun. You will experience a life full of clever strategies, cunning plans, and daring escapes. The game pairs immersive gameplay with an elaborate prison life simulation. Can you survive the routine, outsmart the guards, and escape the prison?"],"app_summary":"Craft & Breakout To Freedom"},{"id":154,"app_name":"Hero Wars: Alliance","status":1,"app_developer_name":"NEXTERS GLOBAL LTD","app_score":"4.295217","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.nexters.herowars","introduction":["Embark on an epic adventure with Hero Wars: Alliance, an online idle RPG fantasy game where stakes are high and battles omnipresent. Seemingly dominated by Archdemon and his nefarious league, your objective is to shape victorious battles, collect muscular heroes and restore tranquility in the Dominion. Power up your heroes, form an invincible guild, train your army and brace yourself for exhilarating multiplayer battles. It's not just a game, it's an electrifying journey, a legacy you'd create leaving an indelible mark in the enchanting fantasy world!"],"app_summary":"Fantasy RPG: Collect epic heroes, win arena battles, be a legend in idle wars!"},{"id":155,"app_name":"Happy Glass","status":1,"app_developer_name":"Lion Studios","app_score":"3.591714","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.game5mobile.lineandwater","introduction":["Beat the blues with 'Happy Glass', a unique puzzle game available on Google Play. This game is more than just passing time; it's an opportunity to partake in a mission of joy. The protagonist here is a sad, empty glass whose happiness is directly proportional to how much it is filled. As the player, your task is to ensure that it cheers up by filling it with liquid. But it’s not as easy as it sounds; there’s a catch, you need to fill it by drawing a line and paving a path for the liquid. Go ahead and immerse yourself in this brilliant amalgamation of challenge and fun.","Extend your creative reach while getting those creative juices flowing with Happy Glass. It's not just a game, it's a test of your problem-solving skills and lateral thinking. The game can be as complicated or as simple as you make it, and the fun lies in finding different solutions to the obstacles. It's bound to keep you hooked, making you ruminate over different potential paths and celebrate each success with a smiling glass!"],"app_summary":"Draw and fill it up!"},{"id":156,"app_name":"Bricks Ball Crusher","status":1,"app_developer_name":"PoseidonGames","app_score":"4.532742","app_category":"Arcade","group_label":"Arcade","app_package":"com.iposedon.bricksbreakerballs","introduction":["Welcome to the world of Bricks Ball Crusher! This is a classic brick-breaking game adored by gamers globally. Venture into a fun-filled brick-breaking venture with thousands of exquisitely designed levels, over 200 skill balls and blocks, and diverse challenge modes such as the riveting 'rescue mode'. Uncover mysterious skill balls as you level up, discover hidden gameplay tactics, and even design your very own unique level to compete with players all over the globe. If you're in search of a casual stress-reliever that also stimulates your strategic thinking, then Bricks Ball Crusher is the perfect game for you!"],"app_summary":"Most Exciting Brick Game"},{"id":157,"app_name":"Clockmaker: Jewel Match 3 Game","status":1,"app_developer_name":"BELKA GAMES","app_score":"4.236665","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.belkatechnologies.clockmaker","introduction":["Clockmaker: Jewel Match 3 Game is a unique spin on the classic match 3 genre with a touch of science fiction and mystery. This fascinating game invites you to renovate an entire city through a plethora of bejeweled match three games and jewel puzzles. With over a thousand levels to conquer, the game offers an addicting and immersive experience. Along with this, it also presents an intriguing plot where you team up with Uncle to stop the treacherous Clockmaker and lift the curse from the town of Clocksville."],"app_summary":"Solve match 3 games and puzzle games for adults! Reveal the mystery of jewels!"},{"id":158,"app_name":"SpongeBob SquarePants BfBB","status":1,"app_developer_name":"HandyGames","app_score":"4.26","app_category":"Action","group_label":"Action","app_package":"com.hg.bfbb","introduction":["Join the fun and adventure in SpongeBob SquarePants: Battle for Bikini Bottom, an action-packed game that features your favorite characters from the popular SpongeBob SquarePants franchise. In this game, players take on the roles of SpongeBob, Patrick, and Sandy, who are tasked to save Bikini Bottom from the devious plunders of the evil Plankton and his army of wacky robots. Featuring high-end visuals, modern resolutions, and carefully polished gameplay, this game offers a faithful remake of the classic original from 2003. From resisting Plankton's rule to underpants bungee jumping, SpongeBob SquarePants: Battle for Bikini Bottom guarantees a rollercoaster of emotions and fun!"],"app_summary":"Play as SpongeBob, Patrick and Sandy and battle an army of wacky robots!"},{"id":159,"app_name":"Gacha Club","status":1,"app_developer_name":"Lunime","app_score":"4.5107584","app_category":"Casual","group_label":"Casual","app_package":"air.com.lunime.gachaclub","introduction":["Step into the exciting world of Gacha Club, where you can let your creativity fly free! This action-packed game opens the doors to endless possibilities for anime fans and game lovers alike. You join an enthusiastic party where you can mold your own anime-inspired characters, dress them up in your most-loved fashion outfits, and craft immersive scenes — all unfolding as you wish. Customization is available galore, with thousands of fashion items and accessories to choose from, the sky's the limit. It's not just about appearances; join the action in Gacha battles with more than 180 units! The adventure you'll embark on is completely fee-free with no in-app purchases."],"app_summary":"Dress up cute chibi characters and gacha for units to battle in story mode!"},{"id":160,"app_name":"Papa's Freezeria To Go!","status":1,"app_developer_name":"Flipline Studios","app_score":"4.493768","app_category":"Strategy","group_label":"Strategy","app_package":"air.com.flipline.papasfreezeriatogo","introduction":["Papa's Freezeria To Go! is an engaging and interactive game that transforms you into an ice cream shop worker on a bustling beachfront. In this new and updated version of Papa's Freezeria, you'll experience gameplay tailored for Android phones, redesigned controls, and all-new action! The premise is simple: you've just landed a summer job at Papa Louie's ice cream shop, but when the throngs of customers start arriving, you'll have your hands full crafting the perfect sundaes."],"app_summary":"Build and serve sundaes on the go!"},{"id":161,"app_name":"Angry Birds Friends","status":1,"app_developer_name":"Rovio Entertainment Corporation","app_score":"4.373659","app_category":"Arcade","group_label":"Arcade","app_package":"com.rovio.angrybirdsfriends","introduction":["Are you ready to take on your friends and the world in brand-new Angry Birds tournaments? With Angry Birds Friends, an incredible version of the classic Angry Birds, you get the chance to engage in a friendly rivalry and prove your mighty avian prowess in dynamic and competitive new levels every week! Conquer the leaderboards and climb up to flaunt your title as the ultimate Angry Birds Champion in the world! The game will test your skills, drive your determination, and challenge your wits in the best possible way!"],"app_summary":"Compete against the World in special tournaments every week!"},{"id":162,"app_name":"Incredibox","status":1,"app_developer_name":"So Far So Good","app_score":"4.820907","app_category":"Music","group_label":"Music","app_package":"com.sofarsogood.incredibox","introduction":["Immerse yourself in the world of music with Incredibox, a unique application that turns you into a musical maestro! Developed by the Lyon, France-based studio 'So Far So Good', Incredibox was introduced to music and game lovers in 2009. This exciting app offers a merry crew of beatboxers to help you create your own music. Choose your preferred style from 9 distinct musical atmospheres to start laying down, recording, and sharing your original mix. Incredibox is more than just a game or tool. It is an enthralling audio-visual journey that has captivated people of all age groups worldwide."],"app_summary":"Create your own music with the help of a merry crew of beatboxers!"},{"id":165,"app_name":"Bully: Anniversary Edition","status":1,"app_developer_name":"Rockstar Games","app_score":"1.9792148","app_category":"Action","group_label":"Action","app_package":"com.rockstargames.bully","introduction":["Bully: Anniversary Edition, developed by Rockstar Games, takes you on an unforgettable journey into the unpredictable world of Bullworth Academy, a corrupt and crumbling prep school. You step into the shoes of Jimmy Hopkins, a mischievous 15-year-old, who must navigate the social hierarchies, stand up to bullies, and survive a year in a chaotic school environment. Laced with original gameplay and a humorous story, this game offers an innovative blend of exploration, action, and school politics. It further enhances the gaming experience with high-resolution displays, enhanced graphics, and multiplayer features, setting a new benchmark in humorous storytelling games."],"app_summary":"Rockstar Games invades the schoolyard in Bully: Anniversary Edition."},{"id":166,"app_name":"PJ Masks™: Hero Academy","status":1,"app_developer_name":"Scary Beasties Limited","app_score":"3.64","app_category":"Educational","group_label":"Educational","app_package":"com.pjmasks.heroacademy","introduction":["Step into an epic adventure in the PJ Masks™: Hero Academy App! This fantastic game for children aged 4-7 years combines learning through coding with super exciting gameplay, stories, and animations. With a unique way of introducing logic, problem-solving, and algorithms, PJ Masks™: Hero Academy makes learning fun! The game encourages unraveling complex concepts piece by piece, transforming your creative little ones into mini problem-solving superheroes."],"app_summary":"It’s time for you to take control of the PJ Masks’ epic adventures!"},{"id":204,"app_name":"Hill Climb Racing 2","status":1,"app_developer_name":"Fingersoft","app_score":"4.49536","app_category":"Racing","group_label":"Racing","app_package":"com.fingersoft.hcr2","introduction":["Get ready for the ride of a lifetime with Hill Climb Racing 2. This engaging arcade racing game takes you on an epic driving journey that promises exhilarating thrills, challenging landscapes, and heart-stopping stunts. The game breathes new life into the original Hill Climb Racing with enhanced gameplay mechanics, striking visuals, and a plethora of customizable vehicles. Prepare yourself for a memorable adventure as you conquer treacherous terrains and compete against players worldwide in this one-of-a-kind driving experience."],"app_summary":"Experience intense multiplayer racing action with epic stunts and challenges!"},{"id":396,"app_name":"Aether Gazer","status":1,"app_developer_name":"Yostar Games","app_score":"4.205263","app_category":"Action","group_label":"Action","app_package":"com.YoStar.AetherGazer","introduction":["Aether Gazer is an exciting and adrenaline-filled game set in a bleak future, where humanity escapes an uninhabitable Earth by uploading their consciousnesses into Gaea, an AI orbiting the planet. Divided into ten unique zones or sephirah, each with its distinctive culture and beliefs, they collaborate to form an utopia, Idealbild. Unfortunately, lurking beneath the tranquility is a threat unparalleled - Visbanes, computer viruses hell-bent on annihilating the paradise.","The game immerses you in a world of strategic combat, fast-paced decision making, dynamic character customization and exploration, all complemented by a stunningly immersive sound track and exceptional voiceovers. As you journey through the Aether in search of Idealbild, you'll encounter thrilling lore, abundant loot and unending challenges, ensuring an unforgettable gaming experience."],"app_summary":"Join forces and reach the promised future of Idealbild with your team!"},{"id":168,"app_name":"DRAGON BALL Z DOKKAN BATTLE","status":1,"app_developer_name":"Bandai Namco Entertainment Inc.","app_score":"4.6025596","app_category":"Action","group_label":"Action","app_package":"com.bandainamcogames.dbzdokkanww","introduction":["DRAGON BALL Z DOKKAN BATTLE serves as one of the best DRAGON BALL mobile game experiences brought to your pockets. Featuring stunning 2D illustrated visuals and animations, this game allows you to revel in a DRAGON BALL world where the timeline's thrown into chaos. It presents an opportunity to lock horns with DB characters from different eras in exhilarating battles, allowing you to forge a unique narrative and save the world of DRAGON BALL."],"app_summary":"Dragon Ball game"},{"id":170,"app_name":"Goddess: Primal Chaos - MMORPG","status":1,"app_developer_name":"koramgame","app_score":"4.113315","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.heroesofchaos.ggplay.koramgame.na","introduction":["Immerse yourself in the exciting world of 'Goddess: Primal Chaos', a revolutionary 3D action MMORPG mobile game. Travel back through time and space to a point before the arrival of the merciless 'Tyrant'. Become a hero and embark on a profound journey to rescue the world, save humanity, the monsters, and the essence of the spirit realm. Assemble from three distinct classes: Summoner, Warrior or Bloodline and plunge into a fantasy realm battling against adversaries online.","In this epic gaming encounter, seek captivating items to boost your hero's strength, battle your way through several unique gameplay modes, and forge your own path in this new and thrilling adventure. The 'Goddess: Primal Chaos' is regarded as one of 2017's most entertaining and strategically challenging mobile games. Prepare yourself to explore an extraordinary universe filled with fun, challenging assignments and hair-raising encounters."],"app_summary":"Collect and strengthen exclusive Goddesses! Facing powerful enemies! to Battle!"},{"id":171,"app_name":"True Skate","status":1,"app_developer_name":"True Axis","app_score":"4.281669","app_category":"Sports","group_label":"Sports","app_package":"com.trueaxis.trueskate","introduction":["Capture the essence of street skateboarding right in the palm of your hand with True Skate, the #1 mobile game in 80 countries. Loved by millions across the globe, True Skate has been a decade in the making, evolving into the ultimate skateboarding sim game it is today. With a fine blend of realistic physics controls and extensive customization options, this is your ticket to experiencing the world of skateboarding realities on your mobile screen. The official street league skateboarding mobile game guarantees to keep skateboarders and enthusiasts gripped at every turn."],"app_summary":"The ultimate skateboarding sim"},{"id":138,"app_name":"Don't Starve: Pocket Edition","status":1,"app_developer_name":"Klei Entertainment Inc.","app_score":"4.182058","app_category":"Adventure","group_label":"Adventure","app_package":"com.kleientertainment.doNotStarvePocket","introduction":["Dive into the world of Don't Starve: Pocket Edition, a successful adaptation of the hit PC game, now in the palm of your hands with over 6 million players globally. This game plunges you into an unyielding wilderness survival adventure teeming with science and magic. Navigate through a strange unexplored territory as Wilson, a brave Gentleman Scientist, whisked away and trapped in this wild, eerie world, scrambling to find his way back home."],"app_summary":"Play the hit game enjoyed by over 6 million players!"},{"id":343,"app_name":"The Lord of the Rings: War","status":1,"app_developer_name":"Exptional Global","app_score":"3.354394","app_category":"Strategy","group_label":"Strategy","app_package":"com.netease.lotr","introduction":["The Lord of the Rings: War is an epic strategy game that lets you navigate the tumultuous world of Middle-earth. The game catapults you into the heart of J.R.R. Tolkien's legendary universe where you control the fate of Middle-earth. Will you seize control over the One Ring and take dominion over the land, or will Middle-earth fall into irreversible darkness? That's up to you!"],"app_summary":"One Ring to Rule Them All"},{"id":344,"app_name":"Om Nom: Run","status":1,"app_developer_name":"ZeptoLab","app_score":"3.8337028","app_category":"Action","group_label":"Action","app_package":"com.zeptolab.omnomrun.google","introduction":["Ready to run the dangerous streets of Nomville? Join Om Nom and Om Nelle in an adrenaline-pumping race in this action-packed game, Om Nom: Run. This endlessly entertaining app is packed with fast-paced action, mind-boggling obstacles, powerful boosts, and the adorable characters from the Cut The Rope universe that you've grown to love. Whether you're nimbly dodging hazards or defying gravity with stunning stunts, Om Nom: Run ensures that every moment is filled with fun and excitement."],"app_summary":"Run for glory in this endless runner with Om Nom, Om Nelle, and their friends!"},{"id":362,"app_name":"HATSUNE MIKU: COLORFUL STAGE!","status":1,"app_developer_name":"SEGA CORPORATION","app_score":"4.1879144","app_category":"Music","group_label":"Music","app_package":"com.sega.ColorfulStage.en","introduction":["Immerse yourself in the rhythm of music with HATSUNE MIKU: COLORFUL STAGE! In this vibrant mobile game, join the world-renowned virtual star, Hatsune Miku, and an original cast of 20 characters who find solace and strength through music. Get involved in a captivating story set in the bustling streets of Shibuya, Tokyo, where a mysterious song named 'Untitled' becomes a means of unlocking hidden emotions and discovering one's unique melody. By participating in virtual concerts and connecting with music lovers worldwide, you're not just playing a game - you're embarking on a melodious journey of emotional discovery."],"app_summary":"Non-stop rhythm action at your fingertips with the latest Hatsune Miku game!"},{"id":296,"app_name":"Pickle Pete: Survivor","status":1,"app_developer_name":"Frojo Apps","app_score":"4.586813","app_category":"Action","group_label":"Action","app_package":"com.frojo.pickle","introduction":["Pickle Pete: Survivor is a top-down arena shooter game showcasing a blend of thrilling gameplay mechanics and a unique narrative. Embark on an adventure in a world immersed in darkness where your chief weapon is your quick-thinking ability and an arsenal full of firepower. With auto-firing and an impressive range of guns at your disposal, you must survive wave after wave of relentless enemies. Test your courage, equip yourself with the mightiest weapons, and tailor your character's abilities for the ultimate survival experience."],"app_summary":"Roguelike auto-shooter with a pickle hero. Survive to become the bullet hell!"},{"id":345,"app_name":"Doodle Jump 2","status":1,"app_developer_name":"Lima Sky LLC","app_score":"4.0969386","app_category":"Action","group_label":"Action","app_package":"com.limasky.doodlejump2","introduction":["Immerse yourself in the vibrant world of Doodle Jump 2, the newest installment in the Doodle series and one of the most addicting games on the Google Play Store. Journey through an array of delightful environments, interact with cute characters, and face goofy monsters while vaulting to new heights. This game is not just about reaching the finish line, it's also about how you outsmart the myriad challenges along the way. Whether it's a prehistoric Jurassic world, an eerie desert, or deep space exploration, Doodle Jump 2 provides an unending torrent of fun and enchanting adventures."],"app_summary":"BE WARNED: Insanely Addictive!"}]
