[{"id":512,"app_name":"Emoji Merge: Fun Moji","status":1,"app_developer_name":"HIGAME Jsc","app_score":"4.7722473","app_category":"Casual","group_label":"Casual","app_package":"com.higame.par.alchemy.emoji","introduction":["Imagine a game where you can merge different emoticons to create unique, brand new emoji-icons on your own. Sounds fun? Emoji Merge: Fun Moji is here for you. This stimulating game allows you to explore the world of emojis like never before. Converge, match, and create a fusion of different emoji characters to produce new emojis. It offers a charming, vibrant and colorful realm bundled up with laughter and excitement."],"app_summary":"Mix the different emoji characters to create your own emoji icon."},{"id":336,"app_name":"Toilet Rush Race: Draw Puzzle","status":1,"app_developer_name":"ROCKET SUCCEED TOGETHER","app_score":"4.150769","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.draw.to.pee.bo","introduction":["Toilet Rush Race: Draw Puzzle is more than what its quirky name suggests. This is an intriguing, fun-filled arcade game that presents a unique challenge. Imagine this - you are in a rush to go to the toilet, but a complex maze and silly obstacles like Rainbow Friends stand in your way. Seems absurd but absolutely relatable, isn't it? Here, your mission is clear - navigate through the maze and reach the toilet as soon as possible. You are not just battling against time, you're also battling the pressure! The game stimulates your brain and tickles your funny bone at the same time, giving a refreshing gaming experience that is hard to find else where."],"app_summary":"A toilet rush race you wanna win, draw smart to find the fastest way!"},{"id":337,"app_name":"World of Tanks Blitz - PVP MMO","status":1,"app_developer_name":"Wargaming Group","app_score":"4.0435977","app_category":"Action","group_label":"Action","app_package":"net.wargaming.wot.blitz","introduction":["Dive into the intense universe of World of Tanks Blitz - PVP MMO, a truly MMO shooter designed specifically for your mobile device. With a colossal player base from across the globe, this game introduces you to a high-octane world where you take control of an armored vehicle and fight in 7x7 epic tank battles. This online tank shooter game offers an unmatched variety of vehicles, maps, modes, and strategy options. The massive array of tanks are inspired from historically accurate World War II vehicles and experimental ones based on real-life blueprints. Selected tanks are even spruced up from well-known animes and alternate universes, giving you over 400 distinct vehicles to pilot."],"app_summary":"Check out Update 10.4!"},{"id":352,"app_name":"Rec Room - Play with friends!","status":1,"app_developer_name":"Rec Room","app_score":"4.534964","app_category":"Adventure","group_label":"Adventure","app_package":"com.AgainstGravity.RecRoom","introduction":["Rec Room - Play with friends! is more than just a game, it’s a social playground! This vibrant virtual space allows you to socialize, play, and even create games with friends from all over the globe. Tailored towards inclusivity and camaraderie, there is truly something for everyone with its MILLIONS of player-created rooms. Step inside this playground and you would find yourself in the midst of intense PVP battles, immersive roleplay rooms, cosy hangout spots, and thrilling co-op quests. It's definitely the social environment to explore, and the best part? It's absolutely free for everyone!"],"app_summary":"Build, chat, & play games with friends online. Experience fun RPG multiplayer VR"},{"id":513,"app_name":"Mortal Kombat","status":1,"app_developer_name":"Warner Bros. International Enterprises","app_score":"4.216154","app_category":"Action","group_label":"Action","app_package":"com.wb.goog.mkx","introduction":["Experience the ultimate fight game with Mortal Kombat! This mobile game brings the power of next-gen console gaming right to your device with a brilliant blend of card collection and fierce fighting action. You have the chance to assemble an elite team of Mortal Kombat warriors and fight in the greatest interdimensional tournament in the universe. Boasting visually stunning graphics and intense battle sequences, this cluster of adrenalin, skill, and strategy avails the true essence of Mortal Kombat at your fingertips."],"app_summary":"Action-packed 3v3 fighting game with a huge roster of iconic fighters!"},{"id":514,"app_name":"Goods Master 3D:Sorting Games","status":1,"app_developer_name":"Cobby Labs","app_score":"4.087948","app_category":"Casual","group_label":"Casual","app_package":"com.goods.master3d.triple.puzzle","introduction":["Welcome to the colourful world of Goods Master 3D, the one-of-a-kind triple matching game that takes your supermarket shopping experience to an incredible new level. Here's a game that lets you dive into the fun of sorting, categorizing, and organizing a virtual fridge, all while you challenge your matching skills. Whether you're a fan of match-three games or a neat freak who loves to see things organized, this game is packed with super realistic 3D products from fries to snacks and drinks to play with and numerous levels to keep you hooked for hours."],"app_summary":"3D goods triple matching games.Match 3d tile, enjoy fun of sorting puzzle games"},{"id":515,"app_name":"Angry Gran Run - Running Game","status":1,"app_developer_name":"Ace Viral","app_score":"4.5841675","app_category":"Action","group_label":"Action","app_package":"com.aceviral.angrygranrun","introduction":["Engage in a mad dash through streets and cities with Angry Gran Run - a Running Game. In this whirlwind of fun, you get to help a plucky Granny who is planning a daring escape from the Angry Asylum. What's exciting is Fred, the white agent, has her locked up and it's up to you to guide her past various obstacles during her audacious escape. This exhilarating running game will sweep you into a chaotic run filled with wacky hurdles, wild chases, and mind-blowing power-ups. Be prepared for hilarious surprises and bizarre encounters as Granny tears through the landscapes of New York and Rome."],"app_summary":"Run through cities and smash annoying Bots in this endless running classic!"},{"id":341,"app_name":"Brain Test: Tricky Puzzles","status":1,"app_developer_name":"Unico Studio","app_score":"4.6862173","app_category":"Trivia","group_label":"Trivia","app_package":"com.unicostudio.braintest","introduction":["Enter the captivating world of Brain Test: Tricky Puzzles, a game that will undoubtedly take you on a brain-boosting roller-coaster ride! This addictive free puzzle game presents a series of unique and tricky brain teasers designed to bend your brain and challenge your mind. It defies common sense and takes you through an engaging journey that promises heaps of fun and a revitalizing brain-pushing experience that you'll thoroughly enjoy!","This gaming masterwork is not just an ordinary IQ game. It is an enthralling extravaganza that you can enjoy with your friends, turning dull moments into an exciting intellectual adventure. The game undeniably stands among the very best the world has to offer, and if you're craving for some brain gymnastics, just have a go at it. This game comes as a part of the excellent Brain Test Series of games with more brain-popping puzzles like Brain Test 2: Tricky Stories, Brain Test 3: Tricky Quests, and many more."],"app_summary":"Do you want to test your IQ? Here is the funny and tricky brain puzzle!"},{"id":342,"app_name":"Wordscapes In Bloom","status":1,"app_developer_name":"PeopleFun","app_score":"4.7421722","app_category":"Word","group_label":"Word","app_package":"com.peoplefun.wordflowers","introduction":["Unleash your inner wordsmith with Wordscapes In Bloom, a challenging and engaging word puzzle game set amidst the tranquil beauty of a botanical garden. This delightful word game invites you to explore a serene arboretum of puzzles, providing an ideal escape for those looking to test their vocabulary skills in an enchanting setting. The game kicks off easy, but brace yourself for increasingly brain-taxing puzzles as you ascend the word ladder.","This intriguing game is brought to you by PeopleFun, creators of other popular titles like Wordscapes, Wordscapes Uncrossed, Word Chums, and Spell Blitz. Taking a unique spin on anagram crossword puzzles, it's been embraced and loved by millions of word enthusiasts all over the globe. A workout for the mind wrapped in a calming sensory experience - enter the world of Wordscapes In Bloom."],"app_summary":"The brand new brain-challenging word game you’ll play for hours!"},{"id":517,"app_name":"Weapon Master: Gun Shooter Run","status":1,"app_developer_name":"Homa","app_score":"4.2061067","app_category":"Action","group_label":"Action","app_package":"com.atknsyl.weaponmaster","introduction":["Immerse yourself into the adrenaline-charged world of Weapon Master: Gun Shooter Run, an action-packed game that expertly combines running and gunning thrills with the strategic depth of weapon crafting and evolution. In this intense game, you will step into the shoes of an ultimate weapon master, craft firearms from gun parts, clash with the enemy in exhilarating, rapid-fire combat and navigate through heart-stopping gun and run challenges. It's much more than just a racing game – it's a thrilling journey that will test your shooting skills at every corner, all while unraveling the fascinating weapon evolution process."],"app_summary":"Shoot & run through obstacles, merge and upgrade weapon, battle with enemy crowd"},{"id":518,"app_name":"Car Simulator 2","status":1,"app_developer_name":"OppanaGames FZC LLC","app_score":"4.6812415","app_category":"Simulation","group_label":"Simulation","app_package":"com.oppanagames.car.simulator","introduction":["Get ready to immerse yourself in the most realistic driving experience of 2023 with Car Simulator 2. This game, developed by OPPANA GAMES, takes the thrill and excitement of driving to a whole new level as it offers a wide-open world, packed with more than 95 brand new cars, incredible gameplay, and a chance to play online with real players worldwide. Whether you're racing insane tracks or cruising around the city with friends, this game is guaranteed to provide an unmatched racing experience."],"app_summary":"Сar driving - play online with players from all over the world! (ver 1.49.5)"},{"id":346,"app_name":"Idle Lumber Empire","status":1,"app_developer_name":"Game Veterans","app_score":"4.0473256","app_category":"Simulation","group_label":"Simulation","app_package":"com.lumber.inc","introduction":["Welcome to the world of Idle Lumber Empire - a fun and addictive idle clicker game that takes you on an entrepreneurial journey to build and expand a lumber and house manufacturing empire. Starting small with a tiny sawmill, your goal is to work effectively, invest wisely, manage and expand your factory, and ultimately, fulfill your big dream of ruling the lumber industry."],"app_summary":"Manage the Logging Factory and Build an Idle Lumber Empire in the clicker game"},{"id":347,"app_name":"100 Monsters Game: Escape Room","status":1,"app_developer_name":"NEGAXY","app_score":"4.2178216","app_category":"Action","group_label":"Action","app_package":"ngx100.escape.rooms.mystery.door","introduction":["Step into the mysterious and spine-chilling world of 100 Monsters Game: Escape Room, a thrilling adventure game set in a secret horror maze. Your surroundings are pitch-black, and the only visible path leads to a multitude of wooden doors. Behind each door, a terrifying creature awaits, ready to make you scream at every corner. From the grinning Bo Boxy to the ghastly Hugy Wagy, over 100 monsters are lurking in the shadows. This game offers an exciting blend of fear, intrigue, and strategic thinking, as you navigate through unique maps, from playgrounds to train stations.","The objective of the game is simple yet chillingly engaging; to escape. Challenges increase with advancing levels, and only the bravest players can survive! Alongside the terror that awaits you, you will also find comrades lost in this horrific maze. You are called upon to work together to complete your tasks, all while staying on high alert for lurking danger."],"app_summary":"Pick monster game and escape room!"},{"id":519,"app_name":"Garten of Banban","status":1,"app_developer_name":"Euphoric Brothers Games","app_score":"4.105651","app_category":"Adventure","group_label":"Adventure","app_package":"com.euphoricbrothersgames.gartenofbanban","introduction":["Garten of Banban is a thrilling exploration game that delves into the mysteries and horrors of a seemingly ordinary kindergarten – Banban’s Kindergarten. As you navigate through its creepy corridors and eerie classrooms, you'll uncover the chilling truth that lies behind its innocent facades. This isn't just any kindergarten, as you'll see; the characters at the heart of this attraction are the Banban And Friends Gang, the quirky mascots that no kid can resist. Prepare to unravel the secrets and confront some of your deepest fears with Unternehmen."],"app_summary":"The official mobile game of Garten of Banban!"},{"id":520,"app_name":"Brain Go 2","status":1,"app_developer_name":"Wonder Game Inc.","app_score":"4.4393063","app_category":"Casual","group_label":"Casual","app_package":"com.wonder.secondoverseas.an","introduction":["Brain Go 2 is a thrilling and popular Free Tricky Puzzle Game. Following the massive success of the Brain Go series with over 500,000 downloads, Brain Go 2 was officially released in 2021. If you're a fan of absorbing trivia crack, challenging word puzzles, engaging digit games, or you're simply seeking to improve your problem-solving, word analysis and critical thinking skills, Brain Go 2 is your go-to option. Counted amongst the best intellectual games, it combines both the elements of word puzzle and digit test in the most engaging and fun way possible."],"app_summary":"Only 5% of players can pass."},{"id":522,"app_name":"Melon Maker : Fruit Game","status":1,"app_developer_name":"SUPERBOX Inc","app_score":"4.6056337","app_category":"Casual","group_label":"Casual","app_package":"com.superbox.aos.suikagame","introduction":["Melon Maker : Fruit Game takes you on a light-hearted, fun-filled adventure into the world of big, sweet, and healthy fruits. This mobile game will offer you a fascinating journey in making the biggest melon. Developed by Superbox Inc, the creators of many blockbuster puzzle and arcade games, Melon Maker is a simple, yet captivating merge fruit game, where excitement and challenge lie in every tap. It's an intriguing puzzle game that blends the simplicity of gameplay with the engaging mechanics of fruit merging. With an invigorating ethos and playful aesthetics, it's designed to satiate the game enthusiasts' perpetual craving for engaging and fun-filled digital experiences."],"app_summary":"Merge it as big as you can! Enjoy the big melon!"},{"id":361,"app_name":"Scary Stranger 3D","status":1,"app_developer_name":"Z & K Games","app_score":"3.8615537","app_category":"Simulation","group_label":"Simulation","app_package":"com.zatg.scaryneighbor.hellgame","introduction":["Immerse yourself in a fear-inspired, adrenaline-pumping journey with Scary Stranger 3D, an action adventure game chock-full of thrills, mysteries, and laughs. You'll find yourself caught up in a twisted narrative that features elements of puzzle-solving, daring pranks, and unearthing secrets, all within a uniquely stylized game art style. Prepare to meet Scary Uncle, an eerie character who brings a new level of suspense and fun to horrific games, in the most dramatic way possible."],"app_summary":"Unleash your wits in Scary Stranger and conquer prank games with thrilling twist"},{"id":523,"app_name":"Tie Dye","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.510911","app_category":"Simulation","group_label":"Simulation","app_package":"com.crazylabs.tie.dye.art","introduction":["Dive into the vibrant world of summer trends with Tie Dye, a color-filled creative mobile app by CrazyLabs. With this artistic platform, you can express your creativity by designing stunning tie-dye clothes and beach accessories. From t-shirts to bikinis and beach bags, throw in the color pop and happy color dyes to create items that reflect your individual style and personality. It's all about the joy of DIY art and fashion. Get ready for an exhilarating outfit makeover!"],"app_summary":"Tie Dye hard! Mix and paint hair dye to design clothes with DIY happy color pop!"},{"id":524,"app_name":"Swamp Attack","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.509999","app_category":"Action","group_label":"Action","app_package":"com.outfit7.movingeye.swampattack","introduction":["Swamp Attack is a thrilling and strategy-filled defend-your-home game that you surely won't want to miss. Set in the mysterious and dangerous swamp, your home is under attack by a horde of unspeakable creatures; zombies, aliens, crocodiles, and more! With your trusty weapon in hand, your mission is to repel these relentless attacks, protect your home, and reclaim peace for your swamp. With its captivating story, unique setting, and addictive gameplay, Swamp Attack offers endless hours of fun and excitement."],"app_summary":"Defend your home, buy cool guns, destroy monsters, and level up!"},{"id":420,"app_name":"Dessert DIY","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.340251","app_category":"Simulation","group_label":"Simulation","app_package":"com.weloadin.dessertdiy","introduction":["Step into a sugary world of culinary delights with Dessert DIY, an exciting and creatively inclined app that tests your confectionery prowess! Make sweet ice cream rolls, perfect cream with icing on the cake, and even embellishment cake decoration. This dynamic cooking game immerses you with its captivating aesthetics and allows for countless possibilities. Whether you're learning the ropes or honing your craft, Dessert DIY offers a unique avenue to unleash your cooking master and discover your confectionery potential. Be it the ice cream roll dessert of your choice or a popsicle stack, your dessert shop awaits your expertise."],"app_summary":"Cake decorating! Put some icing on the cake and make the perfect ice cream roll!"},{"id":366,"app_name":"Stack Ball - Crash Platforms","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.170504","app_category":"Arcade","group_label":"Arcade","app_package":"com.azurgames.stackball","introduction":["Embark on a thrilling and addictive journey with Stack Ball – Crash Platforms. This 3D arcade game is not just about smashing, bumping, and bouncing, it's about mastering the descent through rotating helix platforms to land safely at the end. With its vibrant graphics and whimsical physics, the game creates a perfect blend of fun and challenge, keeping players engaged for endless hours. At every turn, there is a new obstacle for your ball, as it smashes through colorful platforms or shatters into pieces when it hits black. Remember, thought it may sound easy, Stack Ball is anything but!"],"app_summary":"Guide your ball to victory no matter what tries to stop it."},{"id":367,"app_name":"Free Fire MAX","status":1,"app_developer_name":"Garena International I","app_score":"4.2027826","app_category":"Action","group_label":"Action","app_package":"com.dts.freefiremax","introduction":["Take a plunge into the adrenaline-pumping world of Free Fire MAX. This immersive Battle Royale game, designed exclusively for thrill-seekers, is here to deliver a premium gameplay experience you won't forget. From exhilarating game modes to ultra HD resolutions and breathtaking effects, Free Fire MAX is all about survival and strategy. Stand, fight, and survive as the landscape changes dynamically around you, and prove yourself to be the last one standing. Remember, in the volatile world of Free Fire MAX, your only goal is to survive and battle in style!","Brought to you by the house of Garena, Free Fire MAX propels you straight into a fast-paced, deeply immersive gameplay on a deserted island where danger lurk at every corner. Parachute onto a deserted island with 49 other players, and engage in a life-or-death match that only ends when there's just one survivor left standing. With the game's simple motto - Hide, scavenge, fight and survive; your every decision counts."],"app_summary":"MAX Battle Royale Experience"},{"id":525,"app_name":"Army Men Strike: Toy Wars","status":1,"app_developer_name":"Volcano Force","app_score":"4.1320386","app_category":"Strategy","group_label":"Strategy","app_package":"com.hts.ams","introduction":["Take a trip down memory lane with Army Men Strike: Toy Wars and revisit the excitement of your childhood battles. This strategy game takes your favorite childhood toy soldiers and transforms them into a miniature battlefield. You don't just fight for bragging rights, you fight to protect your base, lead your green troops to victory over the evil enemy toys, and save your home. The game opens up a world to experience tower defense, countering enemy invasions, and tactfully winning wars devoid of any restrictions."],"app_summary":"Build your toy army and rule the battlefield using your strategy skills."},{"id":528,"app_name":"Real Racing 3","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.407725","app_category":"Racing","group_label":"Racing","app_package":"com.ea.games.r3_na","introduction":["Say goodbye to the mundane racing games. Enter the world of Real Racing 3, the ultimate motorsports experience you can have on your mobile device anytime, anywhere. This game is all about realness - real cars, real people, and real motorsports. With officially licensed tracks and over 300 meticulously detailed vehicles from all the top manufacturers, you get to test your mettle on real-world circuits in locations worldwide. Plus, there's a hub dedicated to Formula 1 Grand Prix and Championship events, so rev up your engines and get ready to burn some rubber!"],"app_summary":"Prove your driving skills with the ultimate mobile racing experience!"},{"id":371,"app_name":"Soul Knight","status":1,"app_developer_name":"ChillyRoom","app_score":"4.447349","app_category":"Action","group_label":"Action","app_package":"com.ChillyRoom.DungeonShooter","introduction":["If you're a fan of thrilling action and classic roguelike games, Soul Knight is a must-try. Set in an era of gun and sword, the game revolves around a magical stone that maintains the equilibrium of the world stolen by high-tech aliens. With the world hanging by a thread, it's up to you, the player, to restore balance by retrieving the stolen stone. However, don't be fooled by the serious setup; the game is packed with fun and light-hearted humor that will have you shooting alien minions and exploring an endless array of dungeons.","Soul Knight is brimming with unique and diverse characters, from a rogue to a magician, combined with an arsenal of over 400 weapons, including guns, swords, and shovels, ready to demolish any threat. The game boasts automatically generated dungeons with different challenges and treasures, guaranteed to offer you a unique adventure on each playthrough."],"app_summary":"Pixel roguelike RPG. Intriguing dungeon, crazy weapons, and endless adventure."},{"id":382,"app_name":"Zombie Catchers : Hunt & sell","status":1,"app_developer_name":"Deca Games","app_score":"4.395246","app_category":"Action","group_label":"Action","app_package":"fi.twomenandadog.zombiecatchers","introduction":["Welcome to Zombie Catchers: Hunt & Sell, a casual action-adventure game where the undead reign supreme and you're the entrepreneur with a plan. Set in a zombie-infested futuristic Earth, this game offers a unique business opportunity. You play as A.J. and Bud, intergalactic businessmen who see potential amidst apocalypse. Their goal? Creating a thriving business empire by hunting zombies to make Earth safe again and profiting from selling Zombie Juice. As you venture through this apocalyptic wasteland, take a break between hunts to sip on your own delicious Zombie shakes. If you're up for an exciting, zombie-filled business adventure, Zombie Catchers: Hunt & Sell is the game for you."],"app_summary":"Time to hunt, shoot down zombies & sell dishes to expand your alien business."},{"id":529,"app_name":"DOP 4: Draw One Part","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.5805764","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.playstrom.dop4","introduction":["So you say you love puzzles and have an artistic bent? Then DOP 4: Draw One Part app is perfect for you! This immersive game draws on your creative abilities and lateral thinking skills to solve an array of absorbing drawing dilemmas. While testing your intellect, it also provides an artistic outlet by enabling you to complete a vast range of adorable drawings, flawed in intriguing ways. Every successful solution not only confirms your artistic brilliance but also reveals the logical foundations beneath even the most hilarious of the drawings. This addictive combo of art and logic just might surprise you and keep you coming back for more!"],"app_summary":"Draw the shapes of the parts that the drawings need and solve the puzzle!"},{"id":530,"app_name":"Dark Riddle","status":1,"app_developer_name":"PAGA GAMES","app_score":"4.014493","app_category":"Adventure","group_label":"Adventure","app_package":"com.neighbors.darkriddle","introduction":["Step into a world of mystery and intrigue in Dark Riddle, a thrilling first-person adventure game set in an unusual city. As you navigate the city and interact with various unique items, you'll unravel the secrets of your suspicious neighbor who lives across the street. Your journey in the game will introduce you to interesting characters, including a police officer and a seller of alien devices, each of whom adds a unique twist to this fascinating narrative."],"app_summary":"Find out the scary secrets of the neighbor."},{"id":534,"app_name":"Tetris®","status":1,"app_developer_name":"PLAYSTUDIOS INC","app_score":"4.099888","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.n3twork.tetris","introduction":["Welcome to the world of TETRIS®, the most loved puzzle game on the planet, now available as an official mobile app. This isn't just the old game you remember - TETRIS® invites you into a brand new experience, boasting a multitude of unique levels to keep you entertained for hours on end. Whether you're looking to beat your own high score in a quick, intense round or to fine-tune your skills in infinite single-player modes, TETRIS® has got you covered. Tetris forever indeed."],"app_summary":"Play the timeless block puzzle game together with everyone, anywhere!"},{"id":535,"app_name":"Talking Tom Hero Dash","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.235395","app_category":"Action","group_label":"Action","app_package":"com.outfit7.herodash","introduction":["Embark on an exciting adventure with Talking Tom Hero Dash - a game filled to the brim with holiday excitement and mischief. Our beloved characters from Talking Tom are now in their superhero forms and ready to save the day! But oh no, the mischievous Rakoonz are back and they've captured Angela, Ben, Hank, and Ginger. Now it's all up to Tom to rescue them. Dash through a variety of landscapes, from lost temples and ancient cities to desert dunes and snowy peaks. With its jolly soundtrack and festive decorations, this game is sure to get you in the holiday spirit!"],"app_summary":"Save Christmas with Talking Tom Hero Dash! Run fast and stop the Rakoonz!"},{"id":536,"app_name":"Watermelon Game","status":1,"app_developer_name":"THE MESSAGE Co., Ltd.","app_score":"4.019231","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.bognstudio.mergegame","introduction":["Are you ready to plunge into a sea of freshness? Prepared to immerse yourself in the juicy world of fruits? Allow us to introduce Watermelon Game—an addictive, mini-game guaranteed to satiate your appetites for fun and fruit alike. In this game, the goal is simple: combine smaller fruits to produce bigger, better ones. Along the way, you'll encounter quirky animations, irresistible gameplay, and a blend of brain-teasing enjoyment that is as unique as the fruits you'll be creating. With Watermelon Game in your arsenal, you can say goodbye to boredom for good!"],"app_summary":"Simple puzzle game with one finger"}]
