[{"id":431,"app_name":"Shadow Fight 2","status":1,"app_developer_name":"NEKKI","app_score":"4.6268344","app_category":"Action","group_label":"Action","app_package":"com.nekki.shadowfight","introduction":["Let's talk about the famed sequel to Facebook's smash hit game with over 40 million users – Shadow Fight 2. This unique mix of RPG and classical Fighting genres warrants a nail-biting gaming experience. It's not just about equipping your character with numerous lethal weapons and rare armor sets. You get to hone your life-like martial arts skill while crushing enemies, humiliating demon bosses and striving to close the Gates of Shadows. So, are you ready for the adrenaline-fueled, action-packed adventure? Want to know if you have what it takes to kick, punch, jump, and slash your way to victory? Let's dive deep into the gaming world of Shadow Fight 2."],"app_summary":"Prepare to fight with shadows!"},{"id":564,"app_name":"LINE Pokopoko","status":1,"app_developer_name":"LINE (LY Corporation)","app_score":"3.8237178","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.linecorp.LGPKPK","introduction":["Say hello to LINE Pokopoko, the second in the smash hit Poko puzzle line-up! Travel through fantastical worlds, popping adorable POKOTA, COCO, and JEFF shaped blocks along the way. This is not just your average puzzle game - it's an Adventure filled with cute creatures, a wide variety of events and even a Pokopals collection feature. Use your cleverness to manoeuvre the blocks, magics and Cherries in a quest to regain Poko Forest's blue skies."],"app_summary":"■ LINE POKO series 70M DLS\n■ POKOTA puzzler #2\n■ Clear animals for fruits!"},{"id":565,"app_name":"Idle Master- 3D AFK Arena","status":1,"app_developer_name":"成都心翼科技有限公司","app_score":"4.4658823","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.hywx.idle3d","introduction":["Introducing Idle Master- 3D AFK Arena, presented by the makers of com.hywx.idle3d. Say hello to a unique idle game that offers a constant adventure experience even when you're not engaged. The concept is simple, yet addictive - you are in control of shaping your team, participating in exciting battles, and exploring a limitless fantasy world. While you're away, your team will continue battling earning rewards, so you will always have new surprises to come back to. Whether you have plenty of time to spare or only a few minutes in between, Idle Master- 3D AFK Arena ensures a rewarding gaming experience."],"app_summary":"The unique 3D IDLE RPG on Play. Form your heroes and battle for victory!"},{"id":442,"app_name":"Stick War: Legacy","status":1,"app_developer_name":"Max Games Studios","app_score":"4.680636","app_category":"Strategy","group_label":"Strategy","app_package":"com.maxgames.stickwarlegacy","introduction":["Grab your swords and gear up for Stick War: Legacy, a mobile version of one of the highest rated web games of all time! Embark on an incredible journey in the world of Inamorta, where nations battle for dominance and supremacy. As the leader of the 'Order' nation, you're thrown in the midst of this intense conflict, playing your part in an exciting, challenging and addicting stick figure game! It's about strategy, skill, and of course, sticking to your guns (or swords, spears, bows, or magic, if you prefer)."],"app_summary":"Learn the way of the Sword, Spear, Archer, and Mage. Only you can save Inamorta!"},{"id":469,"app_name":"Reload Rush","status":1,"app_developer_name":"MondayOFF","app_score":"4.3520784","app_category":"Action","group_label":"Action","app_package":"com.mondayoff.reloadrush","introduction":["Immerse yourself in the fast-paced and adrenaline-fueled world of 'Reload Rush', a thrilling mobile game developed by South Korea's leading Hyper Casual Game Developer. This dynamic and engaging game promises to inject your mundane moments with high doses of fun. Whether you're seeking to kill time during your coffee break or preoccupied with a lengthy commute, 'Reload Rush' is the perfect fit for you. With its sleek and intuitive design, the game is remarkably user-friendly and easy to navigate. From novices to experienced gamers, 'Reload Rush' is sure to enthrall all.","With a seemingly simple concept and gameplay, 'Reload Rush' manages to challenge your skills and reflexes, setting the stage for an unparalleled gaming session. The pulsating energy of 'Reload Rush' coupled with its addictive gameplay ensures that as soon as you start, you will be hooked onto it in no time."],"app_summary":"Reload and Shoot!"},{"id":567,"app_name":"The Baby In Yellow","status":1,"app_developer_name":"Team Terrible","app_score":"4.341032","app_category":"Simulation","group_label":"Simulation","app_package":"com.TeamTerrible.BabyInYellow","introduction":["Welcome to The Baby In Yellow, a one-of-a-kind babysitting game that will surely test, thrill, and entertain you! As a babysitter, your tasks are seemingly mundane - feeding, changing, and putting the baby to sleep. But beware, as this is no ordinary baby. You might think you've dealt with the most naughty children before, but this game takes the babysitting experience to a whole new level. The Baby In Yellow delivers a unique and eerie atmosphere that will keep players on edge, making it the perfect pick for those who love a little thrill in their gaming experience."],"app_summary":"A babysitting horror game"},{"id":447,"app_name":"Weapon Craft Run","status":1,"app_developer_name":"Rollic Games","app_score":"3.3043845","app_category":"Racing","group_label":"Racing","app_package":"com.adengames.weaponcraftrun","introduction":["Get ready to plunge into our action-packed game, Weapon Craft Run by Aden Games, where you will be taken down a thrilling adventure leaving you on the edge of your seat. In a visually stunning and immersive game environment, you'll navigate through an array of obstacles and doors that stand between you and victory. The ultimate goal? Survive against all odds while collecting chargers that you load and upgrading your gun along the way. A powerful amalgamation of excitement, strategy, and fun, Weapon Craft Run is crafted to provide a compelling gaming experience with its unique graphics, riveting gameplay, and fascinating storyline."],"app_summary":"Shoot, Upgrade, Collect and Evolve!"},{"id":448,"app_name":"Mini Golf King","status":1,"app_developer_name":"RisingWings","app_score":"4.308179","app_category":"Sports","group_label":"Sports","app_package":"com.pnixgames.minigolfking","introduction":["Step onto the virtual green with Mini Golf King, the most action-packed mini golf game yet! This isn't your average leisurely golf game. Mini Golf King is bursting with adventure and excitement at every turn. This multiplayer golf game offers an exhilarating challenge for players worldwide, where every putt guides you through a thrilling expedition of dynamic tricks and fun."],"app_summary":"Epic multiplayer golf game! Challenge players and be the Mini Golf King"},{"id":568,"app_name":"Colors Runners!","status":1,"app_developer_name":"Rollic Games","app_score":"3.9777777","app_category":"Action","group_label":"Action","app_package":"com.atreus.colorrunner","introduction":["Colors Runners! is an adrenalin-filled, vibrant and challenging game. This high-paced adventure requires agility, alertness, and strategic thinking to rescue all characters from a threatening killer drone. The visuals are a feast for the eyes, with a rich tapestry of hues that constantly keep evolving. The game dynamically changes, making each stage an unpredictable challenge that keeps you hooked to your screen. With its innovative gameplay, Colors Runners! perfectly blends strategy and quick thinking, making it a riveting escape game.","The game's premise centers around color-coded zones which act as safe havens for your characters. You don the role of the protector, guiding them to these zones and protecting them from the drone. Each color zone matches the character it saves. The challenge lies not just in evading the drone, but in correctly placing characters in their respective color zones. A wrong move might seal fate!"],"app_summary":"Hide and Rush"},{"id":451,"app_name":"Microsoft Solitaire Collection","status":1,"app_developer_name":"Microsoft Corporation","app_score":"4.2137494","app_category":"Card","group_label":"Card","app_package":"com.microsoft.microsoftsolitairecollection","introduction":["Celebrating over three decades of addictive fun, Microsoft Solitaire Collection is one of the most played video games in the world, and it's now available on Google Play. With five favorite Solitaire card games all in one app, this collection includes Klondike Solitaire, Spider Solitaire, FreeCell Solitaire, TriPeaks Solitaire, and Pyramid Solitaire. Simple rules and straightforward gameplay make it entertaining for all ages, from 8 to 108. Whether you are looking to relax with the classics, sharpen your mind, or challenge yourself, there's a game mode just for you."],"app_summary":"Stay Sharp Playing Solitaire card games! 5 Game Modes +Daily Challenges & Events"},{"id":486,"app_name":"PAC-MAN","status":1,"app_developer_name":"BANDAI NAMCO Entertainment America Inc.","app_score":"4.3717175","app_category":"Arcade","group_label":"Arcade","app_package":"com.namcobandaigames.pacmantournaments","introduction":["Embark on a nostalgic trip with PAC-MAN, the legendary retro arcade game that has been captivating gamers for decades. Updated for modern devices, this epic game brings back the classic PAC-MAN Fever with all-new modes, exciting mazes, and power-packed power-ups. Enjoy the ultimate leisure as you chomp through GHOSTS and gobble PAC-DOTS. With a revamped look and intuitive gameplay, PAC-MAN promises an immersive arcade experience right at your fingertips."],"app_summary":"Eat power pellets, chase the ghosts, and beat the mazes with the iconic PAC-MAN!"},{"id":569,"app_name":"Troll Face Quest Sports Puzzle","status":1,"app_developer_name":"Azerion Casual","app_score":"4.532556","app_category":"Puzzle","group_label":"Puzzle","app_package":"air.com.ppllaayy.tfqsports","introduction":["Looking for a fun-filled way to dive into the realm of internet memes? Seek no more, Trollface Quest Sports Puzzle is here! This game comes from the same creators of the immensely popular and gut-busting hilarious Trollface Quest Games. Get ready to burst into laughter as you immerse yourself in the comical world of Trollface. It is a game inspired by one of the most amusing internet memes of all time - you will play the part of the trollface meme in an exciting point-and-click adventure. Packed with layers of jokes, inventive quests, and engaging challenges, Trollface Quest Sports Puzzle sets you up for a memorable trolling expedition. So, brace yourselves for hours of undiluted fun!"],"app_summary":"Discover the most LOL-worthy click and point adventure!"},{"id":570,"app_name":"Rob Master 3D: The Best Thief!","status":1,"app_developer_name":"Alictus","app_score":"4.03512","app_category":"Casual","group_label":"Casual","app_package":"com.ei.robmaster3d","introduction":["Step into the criminal underworld with Rob Master 3D: The Best Thief! This thrilling game is all about finesse, strategy, and cunning. Are you the mastermind capable of pulling off the perfect heist? Channel your inner thief as you break into highly secured facilities, dodge security forces and carry out masterful heists, all while maintaining your cool and avoiding capture."],"app_summary":"Steal without getting caught!"},{"id":509,"app_name":"Word Search Explorer","status":1,"app_developer_name":"PlaySimple Games","app_score":"4.920479","app_category":"Word","group_label":"Word","app_package":"in.playsimple.wordsearch","introduction":["Embark on an extraordinary quest of wit and adventure with the Word Search Explorer game! It's a free-to-play word game that transforms learning into an exciting journey. Prepare to tickle your brain, connect the letters, and swipe through a plethora of word puzzles. Along the way, boost your vocabulary and self-assurance to face future challenges. Get ready to plunge into an odyssey that visits breathtaking vistas while prepping your brain to become a true champion of cognition. Join the throng of word game lovers who believe the hype, and download Word Search Explorer today for an exhilarating expedition of the mind."],"app_summary":"Play classic word search puzzles with beautiful scenery and relax your mind!"},{"id":487,"app_name":"MONOPOLY GO!","status":1,"app_developer_name":"Scopely","app_score":"4.671046","app_category":"Board","group_label":"Board","app_package":"com.scopely.monopolygo","introduction":["Welcome to MONOPOLY GO, the ultimate monopoly experience on your phone. Virtually roll the dice, buy, sell, build, and scheme your way to riches against players from around the world. With MONOPOLY GO!, you can compete with friends, family, and monopoly enthusiasts anytime, anywhere. Join the likes of Mr. MONOPOLY and other iconic characters as you wander around famous cities, magical lands, and imaginative locales. So buckle up for fun, excitement, and strategy rolled into one, without the common mess of physical board games!"],"app_summary":"ROLL for riches, BUILD your empire, DREAM big & SCHEME your way to success!"},{"id":573,"app_name":"Block Puzzle","status":1,"app_developer_name":"Candy Mobile","app_score":"4.584974","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.dxm.nopuzzle","introduction":["Block Puzzle, available on Google Play with the id com.dxm.nopuzzle, is a dynamic yet minimalist puzzle game that tests your strategic thinking and reaction time. Players are tasked to strategically drop blocks to create complete lines without any gaps on both the vertical and horizontal axis. Each completed line will be cleared from the board, making way for more challenging sequences. Tensions rise as the game progresses, making it an addictive and stimulating mental exercise, all wrapped up in an aesthetically pleasing package.","This game twists the traditional concept of puzzle games with a unique drop-block mechanic. Not only is it a perfect way to test your puzzle-solving skills, but it also serves as a great medium for relaxing, stimulating your mind, and filling little pockets of spare time. Implicit in its gameplay, Block Puzzle offers the perfect blend of simplicity and complexity; a perfect paradox a click away."],"app_summary":"The sweetest and simplest puzzle game!"},{"id":466,"app_name":"Mr Ninja - Slicey Puzzles","status":1,"app_developer_name":"Lion Studios","app_score":"4.4629326","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.lionstudios.mrninja","introduction":["Meet Mr. Ninja- Slicey Puzzles, the sequel to the blockbuster Mr Bullet of 2019. Prepare to get hooked as you swap your gun for a blade in this captivating 'slash and dash' puzzle experience. With foes like enemy spies, deadly pirates, and bone-chilling zombies, stay on your toes as you swipe and slice your way to triumph. It's not just a game, but a mind bender that challenges your creativity in overcoming obstacles and hoodwinking smarter-than-before enemies. Ask yourself - Got the chops to solve this conundrum?"],"app_summary":"Sword Solving Situations"},{"id":467,"app_name":"War Planet Online: MMO Game","status":1,"app_developer_name":"Gameloft SE","app_score":"4.2988505","app_category":"Strategy","group_label":"Strategy","app_package":"com.gameloft.android.ANMP.GloftW2HM","introduction":["Experience the adrenaline rush of commanding your own army in War Planet Online: MMO Game! This globally immersive military strategy game offers you the chance to turn the world map into your personal battlefield. Assemble your soldiers, arm them with the most advanced weaponry, and prepare to dominate against your foes. Whether you're strategizing an attack or building your own war base, the actions are intense and the rewards are high. As you master your tactics, you'll have the opportunity to form powerful alliances and bring your commanders to the status of heroes. Face enemies from all around the globe in this epic showdown of power and strategy."],"app_summary":"Be a war lord. Conquer the world. Build an army to dominate"},{"id":468,"app_name":"Pokémon UNITE","status":1,"app_developer_name":"The Pokémon Company","app_score":"4.3944883","app_category":"Action","group_label":"Action","app_package":"jp.pokemon.pokemonunite","introduction":["Dive into a thrilling strategic battle experience with Pokémon UNITE, the first-ever, 5-on-5 team battle game from the iconic Pokémon franchise. Set on the idyllic Aeos Island, this engaging mobile application brings enthusiastic trainers from around the globe to compete in exhilarating Unite Battles. The cutting-edge adventure unfolds as teams strategize to earn points within a specified timeframe, defeat wild Pokémon, empower their own, and thwart the opposition's scoring attempts."],"app_summary":"5-on-5 Strategic Team Pokémon Battles!"},{"id":508,"app_name":"7 Little Words: Word Puzzles","status":1,"app_developer_name":"Blue Ox Family Games, Inc.","app_score":"4.6211615","app_category":"Word","group_label":"Word","app_package":"com.blueoxtech.sevenlittlewords","introduction":["If you're a word enthusiast who loves crossword puzzles, word finds, anagrams or trivia quizzes, look no further than the 7 Little Words app. Combining elements of all these games, 7 Little Words offers unique, fun, and mind-stretching puzzles for you to enjoy anytime, anyplace! This app is not simply a word game; it’s a pleasing blend of a crossword, an anagram puzzle, and a trivia quiz, with a twist of its originality. Crafted by the makers of other hit games like Moxie, Monkey Wrench and Red Herring, you can guarantee an enthralling gaming experience with 7 Little Words."],"app_summary":"Like word games? This fun twist on crossword puzzles is your daily brain warmup."},{"id":574,"app_name":"Real Car Driving: Race City 3D","status":1,"app_developer_name":"Botanica Global","app_score":"4.4245563","app_category":"Racing","group_label":"Racing","app_package":"com.v06.car.driving.mega.city","introduction":["Unleash your need for thrills in Real Car Driving: Race City 3D, a dynamic and absorbing racing game that transports you to an open world city, offering the freedom to explore and conquer. Set your tires scorching on the city’s asphalt, indulge your speed cravings, and break all the driving laws without the fear of being pursued. Perform audacious stunts, race against rival vehicles or simply savor a relaxing drive in city traffic. Buckle up for the ultimate car driving experience that promises to get your adrenaline pumping."],"app_summary":"Racing fast and doing burnouts had never been so fun!"},{"id":575,"app_name":"Pierce Them All 3D","status":1,"app_developer_name":"playducky.com","app_score":"4.5967956","app_category":"Arcade","group_label":"Arcade","app_package":"dats.games.piercethemall","introduction":["Dive into the exciting world of the Pierce Them All 3D app, where you're tasked with the exhilarating challenge of defeating elite SCP units and surviving the deadly Siren Head or Cartoon Cat. This predominantly action-driven game is set in a stunning 3D atmosphere, where your primary goal is to pierce all the adversaries that block your path. Skyscrapers form your playground as you leap from building to building in pursuit of your foes. But beware, as the name suggests, in this game, only one direction is encouraged - onwards. Falling behind or letting the enemies get too close might just spell the end of your gaming journey!"],"app_summary":"Pierce your enemies! Defeat SCP Siren Head!"},{"id":471,"app_name":"Triple Tile: Match Puzzle Game","status":1,"app_developer_name":"Tripledot Studios Limited","app_score":"4.8297787","app_category":"Casual","group_label":"Casual","app_package":"com.tripledot.triple.tile.match.pair.game.three.master.object","introduction":["Meet Triple Tile, the perfect blend of match puzzle gaming with a refreshing twist, garnished with stunning visuals. The game takes the traditional Mahjong puzzle to new heights, transcending the realms of classic matching games and bringing you hours of immersive gameplay. Not only do you get to match tiles, but also traverse through brand new sceneries and landscapes as you climb levels and pure fun. This addictive tile-matching game guarantees an unforgettable experience, satiating your quest for challenges whilst relaxing your senses. So wait no more, jump into the magnificent world of Triple Tile and become the ultimate tile master.","As you delve deeper into the game, you are tasked with an engaging mission - to match three or more tiles, transforming complexity into simplicity. Each progressive level piques your interest with its uniqueness and sets you up for greater amusement. Triple Tile doesn’t stop at just being a game; it's a journey of enjoyment and mental agility that takes you from seasides to rainforests. Get ready to test your skills and wits against our most daring triple tile challenges and see where your tale of tiles takes you."],"app_summary":"Fun 3 Tile Brain Puzzles - Train your Brain with Tile Matching Mahjong Puzzles"},{"id":579,"app_name":"Drag Racing","status":1,"app_developer_name":"Creative Mobile Games","app_score":"4.437551","app_category":"Racing","group_label":"Racing","app_package":"com.creativemobile.DragRacing","introduction":["Drag Racing, a car racing game par excellence, takes the thrill of racing to a whole new level. This nitro-fuelled spectacle has won over an astounding 100 million fans worldwide with its stimulating gameplay. A plethora of car styles from JDM, Europe, and the US are available for race, tune, upgrade, and customization options. Offering unlimited car customization, Drag Racing promises an unsurpassed exquisite garage experience, guaranteed to stand out amidst the crowd."],"app_summary":"Offline and 1v1 drag racing, car tuning & styling."},{"id":265,"app_name":"Tofu Girl","status":1,"app_developer_name":"JoyPac","app_score":"4.4297123","app_category":"Casual","group_label":"Casual","app_package":"com.joypac.doufu","introduction":["Tofu Girl is an addictive mobile game that takes tofu to greater heights. You play as a delightfully chirpy girl with a penchant for acrobatic jumps on a tower of bouncy tofu trampolines. With obstacles appearing from all directions and a continuous loop of tofu-leaping action, the goal is to build your own towering stack of tofu. Perfect your timing and land in the center of each tofu to score more points and earn more gold for unlocks. Tofu Girl delivers non-stop excitement with a splash of cuteness."],"app_summary":"Jump to stack blocks and build the biggest tower imaginable!"},{"id":324,"app_name":"Makeup Artist: Makeup Games","status":1,"app_developer_name":"FunLanding Game Studio","app_score":"4.529746","app_category":"Simulation","group_label":"Simulation","app_package":"com.beautysalon.makeupartist","introduction":["Step up and put your best foot forward in the world of fashion and style with Makeup Artist: Makeup Games app! This resourceful app turns your smartphone into a virtual vanity where the world of unfamiliar makeup palettes becomes your playground. Why confine your creativity when the artistic world of makeup awaits to be discovered? Unleash your inner artist and choose your style with a variety of design options. From cloud to butterfly, from rainbow to Christmas and Halloween, find inspiration in every trend to create your unique style."],"app_summary":"Become a Stylist and challenge your fashion skill now!"},{"id":476,"app_name":"Street Life: Merge to Survive","status":1,"app_developer_name":"Udo Games","app_score":"4.3402853","app_category":"Casual","group_label":"Casual","app_package":"com.mustafacaglar.begginglife","introduction":["Street Life: Merge to Survive is an electrifying music and dance mobile game that brings you into the thrilling world of street culture. Starting as a humble street performer, you embark on an extraordinary journey rising to the heights of musical stardom. Backed by a cheeky and talented musical monkey, you strum, drum, and dance, charming audiences and racking up fans as you climb towards success. With a flair for the dramatic and a penchant for soulful tunes, this immersive adventure promises engaging gameplay, charismatic characters, and an infectious rhythm that will keep you tapping your toes.","Never worry about anything as common as a day job. In this game, the world is your stage and the rhythm is your guiding force. Keeping beat with the pulse of the 'Street Life, you'll give electrifying performances, earn money and fame, and ultimately fulfill your destiny of becoming a music superstar. Laughter, applause, and the occasional tossed coin could be yours. So why wait? Embrace Street Life: Merge to Survive and start your rise to stardom!"],"app_summary":"Perform, merge, level up & become rich! Zero to hero, a poor guy’s adventure!"},{"id":355,"app_name":"Dan the Man: Action Platformer","status":1,"app_developer_name":"Halfbrick Studios","app_score":"4.736471","app_category":"Arcade","group_label":"Arcade","app_package":"com.halfbrick.dantheman","introduction":["Step into the rubber-soled shoes of the incredible Dan, the Man! An unforgettable mix of classic arcade action, beat-'em-up gameplay, and platforming adventure makes Dan the Man: Action Platformer a must-play experience. Part indie fighting festival, part retro gaming throwback, and all parts fun - experience the hair-raising thrills, heart-stopping action, and laugh-out-loud humor of this addictive game that's all about pounding your enemies to a pulp, blowing through levels, and saving the day in explosive style!"],"app_summary":"Do you like action and platform games? this is your game"},{"id":481,"app_name":"Bowling Crew — 3D bowling game","status":1,"app_developer_name":"Wargaming Group","app_score":"4.6294074","app_category":"Sports","group_label":"Sports","app_package":"com.tetrox.bowl","introduction":["Meet the Bowling Crew - your next exciting online 3D bowling game adventure! Whether you're a bowling enthusiast or just looking for some friendly competition, this game is your one-stop venue for a top-rated bowling experience. Delight in one-on-one battles with friends or opponents from across the globe, while enjoying the best graphics on mobile platforms. What's more, it's brought to you by Wargaming, creators of legendary online multiplayer games."],"app_summary":"Play with friends and join millions of players in the king of bowling games!"},{"id":226,"app_name":"Puzzles & Survival","status":1,"app_developer_name":"37GAMES","app_score":"4.3436227","app_category":"Strategy","group_label":"Strategy","app_package":"com.global.ztmslg","introduction":["Puzzles & Survival is a unique gaming application that seamlessly incorporates a casual match-3 puzzle with intense strategic gameplay to provide an immersive post-apocalyptic experience to players. As the commander and survivors navigate through the world overrun by zombies, they are tasked with resolving challenging puzzles, defending their sanctuary, and ultimately delivering humanity from the brink of extinguishment. Coupled with distinct holiday-themed events and collaborations, as seen with Kumamon, this game adeptly merges joy, excitement, and a little holiday spirit into its intense survival setting."],"app_summary":"Puzzles & Survival x Kumamon"},{"id":493,"app_name":"Pull the Pin","status":1,"app_developer_name":"Popcore Games","app_score":"3.6022058","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.maroieqrwlk.unpin","introduction":["Welcome to Pull the Pin, a game that brings together satisfying graphics as well as innovative levels. This sensational and thrilling game provides a challenging field where you can test yourself, your intellect, and even your friends! Put yourself in direct head-on with physics and mind-boggling levels. Who will be the ultimate victor at the end?","The main concept is simple and magnetic: all balls must find their destiny in the pipe. The question is, can you strategize to pull out the pins in the right order to achieve that objective? The gravity is your best ally pulling the balls towards the pipe, but these pins are the obstacles, and they won’t make your win easy at all! However, with the right strategy and a clear head, nothing is impossible!"],"app_summary":"A relaxing game that will challenge your brain"}]
