[{"id":491,"app_name":"WWE SuperCard - Battle Cards","status":1,"app_developer_name":"2K, Inc. - a Take-Two Interactive affiliate","app_score":"4.3607783","app_category":"Sports","group_label":"Sports","app_package":"com.catdaddy.cat22","introduction":["Prepare for the ultimate showdown in the world of WWE with the SuperCard - Battle Cards game. Step into an electrifying card-collecting and battle arena enriched with WWE Superstars and Legends, real-time PvP matches, new battle cards, features, and updates. Season 10 offers a new level of collection and competition paired with new modes of play, ways to acquire cards, and a redesigned aesthetic. Enter the ring, create an unbeatable deck with your favorite WWE Superstars, and dominate your friends in PvP mode."],"app_summary":"Season 10 is out now! Build and battle a deck of WWE legends."},{"id":492,"app_name":"Block Crazy Robo World","status":1,"app_developer_name":"Craft Trending Studio","app_score":"3.5177865","app_category":"Simulation","group_label":"Simulation","app_package":"com.crazy.block.robo.monster.cliffs.craft","introduction":["Venture into a vibrant, retro-style block universe with 'Block Crazy Robo World'. Crafted with meticulous attention to detail and sprinkled with elements of adventure, survival and creation, this game aptly captures the essence of sandbox gaming. This game offers a plethora of opportunities to construct extravagant cities from scratch or pristine landscapes. Whether you like hunting, fishing or the thrill of an adventure, this game will have something to satiate all your gaming passions. Immerse yourself in the cubic craft world and tailor your gameplay with your creative prowess."],"app_summary":"Let try and build your creative world!"},{"id":227,"app_name":"Antistress - relaxation toys","status":1,"app_developer_name":"JindoBlu","app_score":"4.6446548","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.JindoBlu.Antistress","introduction":["Introducing Antistress - relaxation toys, your personal sanctuary for tranquility in the midst of your bustling day. This app serves as a digital collection of stress-relieving toys designed to divert your attention and invite you into a serene environment. Whether you need relaxation, diversion, or simply a moment of distraction, this app affords you a mental escape with its array of charming and calming toys. Feel the stress melt away as you listen to the sound of a bamboo chime, play with wooden boxes, or gently swipe your finger in virtual water."],"app_summary":"Relax your mind and have something to do in boring moments! Have a break!"},{"id":228,"app_name":"TSM","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.181164","app_category":"Simulation","group_label":"Simulation","app_package":"com.ea.gp.simsmobile","introduction":["Welcome to the exciting world of TSM, a unique game that lets you craft and control your world with extraordinary detail right from your mobile device! Create your Sims, give them personalities as distinct as your own, and guide them through their life choices. Whether they are rising through their chosen careers, celebrating with friends or falling head over heels in love, it's all in your hands. TSM offers an incredibly immersive and personalized experience where you can shape the world as you see fit."],"app_summary":"Play with life."},{"id":556,"app_name":"Hole and Fill: Collect Master!","status":1,"app_developer_name":"Homa","app_score":"4.2447395","app_category":"Arcade","group_label":"Arcade","app_package":"play.roshka.holefill","introduction":["Embark on a tastefully thrilling game journey with Hole and Fill: Collect Master! This exciting black hole game challenges you to become a powerful hoarder who devours the world by collecting and consuming a myriad of objects in sight - from delicious bakery treats and fast food items to makeup cosmetics and stationary. The gameplay is smooth and engaging, enriched with unique challenges and stunning environments in each level. Moreover, the satisfaction of organizing everything you've collected, from filling your fridge with grocery items to stocking your shelf with cosmetics and stationary, is truly hard to beat. Get ready to level up your game skills and dominate the world with Hole and Fill: Collect Master!"],"app_summary":"Eat & swallow yummy foods down the hole, collect & fill the fridge with snacks!"},{"id":496,"app_name":"Pawn Shop Master","status":1,"app_developer_name":"Lion Studios","app_score":"4.1941104","app_category":"Simulation","group_label":"Simulation","app_package":"com.alphapotato.pawnshopmaster","introduction":["Dive into the exciting realm of trade and negotiation with the Pawn Shop Master app. This delightful game empowers you with your very own pawn shop where you can spot hidden gems from customers and strive to scale the summit of success by becoming a skilled Pawn Star King! From gold, guns, and jewelry to art pieces, you'll have the opportunity to line your store with eye-catching items and make a profit. Remember, a successful deal isn't just about a hawk-eye but about smooth talk and persuasive power. Will you be the top-notch pawn store nobody can refuse? Only time will tell. In the world of Pawn Shop Master, victory is defined by your commercial skills and bargaining power."],"app_summary":"Buy and sell valuable antiques"},{"id":498,"app_name":"Captain Tsubasa: Dream Team","status":1,"app_developer_name":"KLab","app_score":"4.025682","app_category":"Sports","group_label":"Sports","app_package":"com.klab.captain283.global","introduction":["Captain Tsubasa: Dream Team is a prodigious mobile game that boasts of 45 million downloads worldwide. Riding on the wave of the globally celebrated Shonen Jump manga series, 'Captain Tsubasa,' this game embodies the spirit of this beloved franchise into a free-to-play football game. As the quintessential football simulator, it allows players around the globe to build their very own dream team with their favorite characters. Indulge in challenging and fervent football matches that promise to keep you on the edge of your seat."],"app_summary":"Fight your footballing rivals!"},{"id":506,"app_name":"My Singing Monsters","status":1,"app_developer_name":"Big Blue Bubble Inc","app_score":"4.744858","app_category":"Music","group_label":"Music","app_package":"com.bigbluebubble.singingmonsters.full","introduction":["Welcome to the delightful world of My Singing Monsters! This is a unique and entertaining musical game where you get to breed, feed, and listen to your own monsters sing. You'll be responsible for raising a pet monster and helping it grow by feeding it well. Your collection of fun monster characters form a lively island filled with music. This is a world that can be fully customized to your liking, from the design of the island to the melodious tunes of the monsters. So dive in and let's start monstering!"],"app_summary":"Breed them. Feed them. Listen to them sing! Build a musical world."},{"id":507,"app_name":"ONE PIECE Bounty Rush","status":1,"app_developer_name":"Bandai Namco Entertainment Inc.","app_score":"4.3270845","app_category":"Action","group_label":"Action","app_package":"com.bandainamcoent.opbrww","introduction":["Dive into the thrilling pirate world of One Piece Bounty Rush, a dynamic 3D anime battle arena game. Developed by the renowned Bandai Namco Entertainment Inc., this game is a feast for One Piece fans and multiplayer pirates alike. Immerse yourself in the nautical thrills of one of the most popular manga ever, as you join Straw Hat Luffy and other beloved characters in action-packed battles for treasure and victory."],"app_summary":"The latest ONE PIECE mobile game.\nReal-time team battles with REAL PLAYERS."},{"id":504,"app_name":"Doodle God Planet Blitz","status":1,"app_developer_name":"JoyBits Ltd.","app_score":"4.2824426","app_category":"Puzzle","group_label":"Puzzle","app_package":"joybits.doodlegodblitz","introduction":["Step into the divine shoes of a creator with Doodle God Planet Blitz, played by more than 190 million players worldwide. In this fascinating game, available in 13 languages, you are endowed with the power of the elements: fire, earth, wind, and air. Your mission? To blend and coordinate these components, progressively shaping a lively universe right before you. However, this is not an overnight blitz, you will work your way up, from brewing a simple microorganism to creating a complex orchestra of life, storms, tools, and civilization. As your planet burgeons with life and activity, bear in mind that your inventive prowess might come with unexpected results."],"app_summary":"UNLEASH YOUR INNER GOD AND CREATE A UNIVERSE"},{"id":511,"app_name":"Move Animals","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.0588236","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.paurau.MoveAnimals","introduction":["Step into the lively and vibrant world of Move Animals, a virtual zoo where the animals rove free! Your goal: to strategically move and position various animals as per the unique requirements of every level. Participate in a world that features a wide variety of animals from all walks of life, domestic and wild, including dogs, cats, bears, elephants, horses, deers, tigers, raccoons, peacocks, pandas, kangaroos, a splendid array of birds, and even prehistoric creatures like DINOSAURS! Watch as their adorable animations come to life amidst vibrant landscapes teeming with color and life. With every level handcrafted to perfection, your puzzle solving skills and strategic thinking will be put to the ultimate test."],"app_summary":"Play with animals!"},{"id":521,"app_name":"Stick Hero: Tower Defense","status":1,"app_developer_name":"ROCKET SUCCEED TOGETHER","app_score":"4.682975","app_category":"Strategy","group_label":"Strategy","app_package":"com.ht2.stick.hero","introduction":["Enter the world of Stick Hero: Tower Defense, an action-packed stickman game that combines cunning strategy and exhilarating battles in an exciting arcade setting, primed for a thrilling play experience on Google Play. Your role? The last stick-hero standing, emanating resilience, resourcefulness and readiness to take down powerful enemies and their Gigantic Bosses. It's your journey, your transmutation from a regular warrior to a true hero, ready to overcome any hurdle that dares to cross your path forward to victory."],"app_summary":"Gather legendary stickman warriors, expand your inventory, road to victory"},{"id":516,"app_name":"Bridge Race","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.2191944","app_category":"Casual","group_label":"Casual","app_package":"com.Garawell.BridgeRace","introduction":["Join the rollercoaster ride in Bridge Race, a captivating racing game that already won the hearts of 250 million users worldwide. This game not only tests your speed but also your strategic mind. The goal? Build your own bridge by collecting the right kind of blocks while racing against others. But beware, you won’t be the only one constructing a port - your rivals will be doing the same while trying to snatch away your blocks. Encounter mechanisms like sliders, trampolines, zip-lines, ladders, and elevators all scattered across more than 1000 levels to keep you both entertained and challenged."],"app_summary":"Build bridges till the winning stage!"},{"id":526,"app_name":"Magnetico: Bomb Master 3D","status":1,"app_developer_name":"CASUAL AZUR GAMES","app_score":"4.408046","app_category":"Action","group_label":"Action","app_package":"ball.magnet.ico","introduction":["Step into a thrilling world where humanity's survival hangs in the balance in the action-packed game, Magnetico: Bomb Master 3D. In this riveting game plot, cyborgs have invaded, threatening to obliterate humanity. It's your calling to become the world's last line of defense against this lethal robot attack! The world needs a hero, it needs a Bomb Master, who can use their courage, precision, and strategy to singlehandedly foil the cyborg invasion."],"app_summary":"Cyborgs are coming! Aim & fire! Destroy them all with the strength of magnets!"},{"id":527,"app_name":"Run Sausage Run!","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.159062","app_category":"Arcade","group_label":"Arcade","app_package":"com.crazylabs.sausage.run","introduction":["Embark on a thrilling running adventure with 'Run Sausage Run!'. This fast-paced game turns the humble hot dog into the main character of an action-packed escape. As a daring sausage, your mission is to dash along an endless pathway, evading a slew of perilous traps that would see you sliced, diced, burned or smashed. Whether you are a gallant weisswurst, an intrepid blutwurst, a jaunty bacon or an adventurous chocolate sausage, is up to you. So get ready to show your death-defying running skills and navigate through dangerous obstacles in a game bound to have you squealing with both fear and delight."],"app_summary":"Run for your life! Get ready for the sausage adventure run of a lifetime."},{"id":532,"app_name":"Race Master 3D - Car Racing","status":1,"app_developer_name":"SayGames Ltd","app_score":"4.413803","app_category":"Racing","group_label":"Racing","app_package":"com.easygames.race","introduction":["Get ready to indulge in the adrenaline-fueled experience of Race Master 3D - Car Racing. Fasten your seatbelt and tear up the tracks as you maneuver your car through 33 unique levels filled with varying obstacles ready to challenge your driving skills. This game is far from your typical racing game. It's a world where unexpected twists and turns await you at every corner. It's a rollercoaster ride where your ability to adapt will be put to test as your rivals aren't just fast, they're crazy."],"app_summary":"Become a track master in the wackiest, wildest, winningest racing game!"},{"id":531,"app_name":"Highway Racer 3D","status":1,"app_developer_name":"Coden Games","app_score":"4","app_category":"Action","group_label":"Action","app_package":"com.codengamesinc.highwayracer3d","introduction":["Strap in for a wild ride with Highway Racer 3D, an endlessly thrilling racing game that brings the sensation of speed right to your fingertips. Push your driving skills to the limit on a wide range of tracks that challenge you to weave through traffic, outrun police, and of course, race to the finish line. The ultimate goal of the game is not just about finishing first, but to become the fastest car out there that even the best of the best can't beat."],"app_summary":"Highway Racer 3D will change your perception of the racing genre."},{"id":546,"app_name":"Blob Runner 3D","status":1,"app_developer_name":"Zynga","app_score":"3.977911","app_category":"Action","group_label":"Action","app_package":"com.quok.blobRunner","introduction":["Dive into the lively world of blobs with Blob Runner 3D. This enthralling game offers a one-of-a-kind experience with its exciting gameplay and eye-catching graphics. Stand out among the crowd of run-of-the-mill running games, Blob Runner 3D is the game for you if you enjoy action-packed adventures with a touch of hilarity. Watch as the blob of slime navigate through tricky obstacles, grow from picking up jellies, to ultimately evolve into a giant Blob in a spectacular rush. Whether you're looking for a fresh gaming experience or you're a devoted fan of slime games, Blob Runner 3D is sure to captivate your interest."],"app_summary":"Become a giant Blob"},{"id":547,"app_name":"Ludo King™","status":1,"app_developer_name":"Gametion Global","app_score":"4.0182586","app_category":"Board","group_label":"Board","app_package":"com.ludo.king","introduction":["Embrace the nostalgia and relive your childhood with Ludo King™, an official and the most popular board game available since 2016. A game of strategy, wit, and luck, Ludo King™ has reached a stellar record of over 1 billion downloads and has since been a family favorite. This game gives a modern twist to the classic royal game of Pachisi, which was famously played among Indian Kings and Queens in ancient times. Played between friends and family, it's revered as the dice game of kings. Depending on where you are, this iconic game is also known as Parchisi, Pachisi, parcheesi or Parchisi game.","Ludo King™ is a cross-platform multiplayer game, enabling you to game not only on Android and iOS but also on Desktop and Windows mobile platform at the same time. Apart from the online multiplayer mode, it offers an offline mode for those wanting to pass and play or compete with advanced computer AI. A game suitable for all ages, Ludo King™ is teeming with rich themes, real-time chat, and voice chat to make the gameplay experience immersive and engaging."],"app_summary":"Ludo King is a board game played between friends and family. A fun dice game."},{"id":551,"app_name":"Star Trek™ Fleet Command","status":1,"app_developer_name":"Scopely","app_score":"4.0542717","app_category":"Strategy","group_label":"Strategy","app_package":"com.scopely.startrek","introduction":["The cosmos awaits in the thrilling MMO strategy game, Star Trek Fleet Command. Muster your strategic expertise, combat wit, diplomatic finesse, and leadership prowess, and embark on a journey to master the volatile Star Trek universe. The stakes are high in a galaxy teetering on the brink of war, with Federation, Klingon, and Romulan forces vying for control. A game-changing, ancient secret casts a formidable shadow over the Alpha and Beta quadrants. Positioned on the frontier of civilized space, you, as the commander of a starbase, will write the course of interstellar history in the vibrant Kelvin Timeline."],"app_summary":"Experience epic conflict in Star Trek™ Strategy MMO Game with Vibrant graphics"},{"id":552,"app_name":"Design Home™: House Makeover","status":1,"app_developer_name":"Crowdstar Inc","app_score":"4.345523","app_category":"Simulation","group_label":"Simulation","app_package":"com.crowdstar.covetHome","introduction":["Unleash your inner decorator with Design Home™: House Makeover. This immersive application allows you to live out your interior design dreams with a few simple taps. Providing a full interior and exterior home design experience, Design Home offers you an opportunity to decorate and remodel homes that echo your style and taste. Immerse in a world of chic and contemporary home decor brands, and allow your creativity to take flight with the true-to-life room planner. At Design Home, you are the architect, the stylist, and the dreamer. It’s more than a game, it’s about celebrating your passion for design and making it part of your everyday lifestyle."],"app_summary":"Become an interior designer in this home design simulation! Decorate today."},{"id":558,"app_name":"Gacha Life","status":1,"app_developer_name":"Lunime","app_score":"4.4299207","app_category":"Casual","group_label":"Casual","app_package":"air.com.lunime.gachalife","introduction":["Gacha Life is a fantastic voyage into the world of anime, jam-packed with adventure and endless possibilities. Be the architect of your own universe, manifesting your favorite anime-style characters and decking them out with the latest fashion wears. Seize control of a plethora of apparel and weapons, and craft picturesque scenes that flourish within a thematic backdrop of your choice. With over a hundred enchanting realms to choose from, you create engaging narratives that are as boundless as your imagination. In Gacha Life, entertainment and excitement pervade every pixel.","Venture into the new Life mode, where you can traverse diverge areas and encounter new friends who breathe life into your journey. Engage with the NPCs, delve into their worlds, and you might stumble upon some delightful surprises. There's also a bevy of mini-games to challenge yourself with, and countless gems to collect that you can use to Gacha for exclusive gifts. Whether you are an explorer, a fashion aficionado, or a storyteller, Gacha Life is a must-have app for you. "],"app_summary":"Dress up your own characters, play games, and explore the world of Gacha Life!"},{"id":559,"app_name":"Punch Boxing 3D","status":1,"app_developer_name":"CanaryDroid","app_score":"4.4673953","app_category":"Sports","group_label":"Sports","app_package":"com.yx.boxinghero","introduction":["Engage in the raw adrenaline and intense drama of fisticuffs with Punch Boxing 3D! This combat sports game, favorite worldwide and at the top of its genre, brings the unparalleled boxing experience to Android. Dive into a world where every jab, hook, and uppercut is not only at your fingertips but feels natural and exciting. In this polished animation game with stunning 3D graphics, you can square off against 30+ formidable fighters from the world's boxing capitals like Bangkok, Las Vegas, London, Montreal, and Washington. It's a survival of the fittest where only your quick reflexes, special moves, and fierce punches can help you emerge as the king of the boxing ring."],"app_summary":"Punch Boxing is the world's #1 combat sports game available on Android."},{"id":557,"app_name":"Gravity Noodle","status":1,"app_developer_name":"VOODOO","app_score":"4.23301","app_category":"Arcade","group_label":"Arcade","app_package":"com.MPixels.GravityNoodle","introduction":["Whether you're looking for a fun way to spend a few minutes or a challenging test of your digital agility, Gravity Noodle is the game for you! In this delightful app, you'll guide a whimsical snake on a heart-pounding adventure, dodging obstacles and climbing unimaginable heights. From the first level to the last, Gravity Noodle offers no shortage of intrigue. Each stage is meticulously designed to test your strategy, planning, and control under pressure. With its charming graphics, other-worldly physics, and mind-bending challenges, Gravity Noodle assures you an unforgettable gaming experience!"],"app_summary":"Just curl around!"},{"id":566,"app_name":"Melon Sandbox","status":1,"app_developer_name":"playducky.com","app_score":"4.5860686","app_category":"Simulation","group_label":"Simulation","app_package":"com.studio27.MelonPlayground","introduction":["Welcome to the wondrous world of Melon Sandbox - a world where imagination reigns supreme! Available on Google Play, this app is all about setting your creative impulses free in a vibrant, unpredictable environment. Crafted by Studio 27, Melon Sandbox is an interactive platform that provides you with tons of items at your disposal. Whether you fancy melee weapons, guns, or just want to play around with barrels, this app has got you covered. Let your creative juices flow like never before and create your own narratives, while exploring the endless possibilities of this fantastic world."],"app_summary":"A simple sandbox game, where you create your own scenarios."},{"id":571,"app_name":"Words of Wonders: Crossword","status":1,"app_developer_name":"Fugo Games","app_score":"4.860411","app_category":"Word","group_label":"Word","app_package":"com.fugo.wow","introduction":["Say hello to Words of Wonders! This isn't just another crossword game, it's a voyage of discovery, a test of your vocabulary, and a tour around the globe, all wrapped in one. As you grapple with the challenges of forming words from mere letters, you'll also uncover the world's hidden wonders - the famous seven, as well as some lesser-known gems. It's an exciting, educative exercise wrapped in fun-filled gameplay. Whether you're a word nerd aiming to expand your vocabulary, a travel enthusiast, or simply seeking an engaging and educational game, Words of Wonders has something for you!"],"app_summary":"Visit the wonders of the world while you connect letters to create great words!"},{"id":572,"app_name":"Tangled Snakes","status":1,"app_developer_name":"Popcore Games","app_score":"4.277849","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.nt.games.tangledsnakes","introduction":["Unleash the inner snake in you with Tangled Snakes! This innovative and entertaining game is an ingenious take on the classic snake-mobile game but with a twist! Your mission? To free the entangled snakes from the twisted mess that they've landed in. This isn't your average snake game; this is Tangled Snakes- a puzzling game with an enjoyable challenge designed for everyone. Prepare to strategize as you carefully select which snake to free first. It's a simple yet nerve-wracking game that will keep you on the edge of your seat. Get ready to slither your stress away with Tangled Snakes!"],"app_summary":"Untangle the snakes in the correct order in this fun and challenging snake game"},{"id":576,"app_name":"Find the Alien 2","status":1,"app_developer_name":"MOONEE PUBLISHING LTD","app_score":"4.512397","app_category":"Casual","group_label":"Casual","app_package":"net.wyvernware.findthealien2","introduction":["Get ready for an exciting adventure through time and space with Find the Alien 2. This pulse-pounding game involves an alien invasion that cuts across the very fabric of human history. The extraterrestrial forces are out to replace every human being across the ages with their own kind. Your mission? Find the alien impostors and exterminate them to prevent a disastrous alien takeover. Swap your history books for a game that is more than just galactic smackdown - it's a thrilling tour of history from the Stone Age to Medieval Times, flanked by famous historical figures and menacing alien adversaries. Let's dive into the action with Find the Alien 2!"],"app_summary":"Travel in time & stop the alien invasion! The future of humanity depends on you."},{"id":577,"app_name":"ZigZag","status":1,"app_developer_name":"Ketchapp","app_score":"4.089906","app_category":"Arcade","group_label":"Arcade","app_package":"com.ketchapp.zigzaggame","introduction":["Welcome to the addictive world of ZigZag! This challenging, fast-paced game keeps you on your toes as you zigzag your way along the wall, each turn a test of your reflexes and precision. Developed by Ketchapp, ZigZag is a thrilling tactile experience that makes every second count. With its simple yet captivating concept, this game hooks you from the first tap and keeps you playing as you strive to beat your personal best. Its minimalist design and straightforward gameplay, combined with unexpected challenges and a quick pace, make ZigZag an exciting game that's hard to put down."],"app_summary":"Stay on the wall and do as many zigzags as you can!"},{"id":578,"app_name":"UNO!™","status":1,"app_developer_name":"Mattel163 Limited","app_score":"4.478451","app_category":"Card","group_label":"Card","app_package":"com.matteljv.uno","introduction":["Get ready to shout 'UNO!' on your mobile with the classic family-friendly card game app, UNO!™. No need to clear off the kitchen table, you can now take your favorite card game anywhere you go! UNO!™ brings a novel twist to the conventional game, adding new rules, world series tournaments, and diverse modes of play. Whether you're a seasoned UNO!™ player or a novice, at home or on the move, UNO!™ offers something exciting for everyone!"],"app_summary":"The Classic Game at your Fingertips"},{"id":211,"app_name":"Puzzle Breakers: Champions War","status":1,"app_developer_name":"RJ Games","app_score":"3.9574037","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.playrix.puzzlebreakers","introduction":["Immerse yourself in a realm of fantasy and strategy with Puzzle Breakers: Champions War. This epic match-3 RPG game takes you on an exciting quest, echoing an age of war and the call of an empire. Gather your champions, armed with unique skills and ready to march towards an epic destiny. Unlock the mysteries of ancient empires and experience the thrill of match strategy fused with elements of RPG as you uncover the legend of heroes and champions."],"app_summary":"Craft your war strategy and join the rumble with epic fantasy heroes!"}]
