[{"id":612,"app_name":"Sago Mini First Words: Kids 1+","status":1,"app_developer_name":"Play Piknik","app_score":"3.8666666","app_category":"Educational","group_label":"Educational","app_package":"com.sagosago.FirstWords.googleplay","introduction":["Sago Mini First Words: Kids 1+ is a playful and educational app designed to boost your toddler's speech development. Part of Piknik, it offers unlimited access to top-notch preschool apps from developers like Sago Mini, Toca Boca, and Originator. This award-winning app harnesses tried-and-true speech therapy methods to strengthen your child's articulation, pronunciation, and overall English communication skills. With hundreds of activities and regular updates, it engages a child's natural curiosity and increases their eagerness to learn."]},{"id":614,"app_name":"Animal Puzzle & Games for Kids","status":1,"app_developer_name":"GunjanApps Studios","app_score":"4.4","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.gamesforkids.animals.puzzles.jigsaw","introduction":["If you're on the hunt for an entertaining and educational app for your little ones, Animal Puzzle & Games for Kids is the answer to your quest. This engaging puzzle game app combines the thrill of problem solving with the joys of learning, offering a collection of diverse puzzles that strive to make learning fun. This app features a variety of puzzle categories - including Animal, Match, Letter, Number, Shape and Jigsaw puzzles - designed to keep your children engaged while stimulating their cognitive functions, enhancing vocabulary and aiding in memory development."]},{"id":615,"app_name":"My Town Airport games for kids","status":1,"app_developer_name":"My Town Games Ltd","app_score":"4.295699","app_category":"Educational","group_label":"Educational","app_package":"mytown.airport.free","introduction":["Get ready to take off to a world of imagination and fun with My Town Airport games for kids. This game boasts more than 9 locations to explore, each filled with exciting activities and roles to play. Just like a real airport, you can become a pilot, a stewardess, an airport security officer, or even a traveller on vacation. Experience the hustle and bustle of airport life, check the luggage through airport scanner, and enjoy the thrill of airplane travels. My Town Airport games bring an interactive and educative experience to all the little airplane enthusiasts out there!"]},{"id":617,"app_name":"Topia World: Building Games","status":1,"app_developer_name":"Yateland - Learning Games For Kids","app_score":"3.4545455","app_category":"Casual","group_label":"Casual","app_package":"com.imayi.topia","introduction":["Unleash your creativity with Topia World: Building Games, an ultimate children's building game reminiscent of Toca's exploratory spirit. Set in a fantastical realm, young builders get to create their own worlds from three diverse themes. Whether you stick to a single theme or mix elements from all, you hold the power to construct a world as unique as your imagination. From wizards cavorting with elves, to ancient villages alive with poetic chants, to islands echoing with samurai tales - you are the architect of your adventure. Welcome to TopiaWorld, a space where creativity flourishes, and exploration is limitless."]},{"id":618,"app_name":"LEGO® DUPLO® WORLD","status":1,"app_developer_name":"StoryToys","app_score":"3.38125","app_category":"Educational","group_label":"Educational","app_package":"com.storytoys.lego.duplo.world.kids.play.free.friends.animals.android.googleplay","introduction":["Revamp your child's playtime with LEGO® DUPLO® WORLD app, an immersive game designed for kids aged 2-5 years. It's a world filled with exciting activities, educational experiences, and endless fun that will keep your little ones entertained and intellectually stimulated. LEGO DUPLO WORLD goes beyond traditional play, integrating the highly-recognized Headstart Early Learning Outcomes Framework to ensure age-appropriate learning. With a vibrant mix of animals, buildings, vehicles, and trains, it's the ideal platform to nurture your toddler's creativity and prepare them for preschool."]},{"id":619,"app_name":"Coloring Book 14: Robots","status":1,"app_developer_name":"Dataware","app_score":"0","app_category":"Educational","group_label":"Educational","app_package":"com.datawaregames.coloringbook14","introduction":["Coloring Book 14: Robots is a captivating game that immerses you into the world of fantastical robotics. With more than 50 pages saturated with robots, this game presents both a fun-filled and educational experience, especially for science fiction enthusiasts. Whether you fancy autonomous machines at work, engaged in domestic duties, or even playful and fun leisure activities, this game seamlessly takes you through a thrilling adventure, one robot at a time. Enriched with a sci-fi aroma, this game unfolds a myriad of domestic, work, and play activities, each featuring unique and kooky robots."]},{"id":620,"app_name":"Nail Salon Games Acrylic Nails","status":1,"app_developer_name":"Timpy Games For Kids, Toddlers & Baby","app_score":"4.48","app_category":"Educational","group_label":"Educational","app_package":"com.tz.nail.salon.art.nails.design.girl.games","introduction":["Greet your inner diva with our amazing Nail Salon Acrylic Nails Game. Unleash your creativity and let your fingertips do the talking. Have fun exploring your artistic side with our wide range of nail polishes, patterns, and accessories. Whether you're a fan of the magical unicorn theme or are in the mood for some spooky fun with the Halloween nail art theme, we've got you covered. Perfect for hello kitty girls passionate about casting their magic wand over their nails, get ready for a nail-painting party like never before."]},{"id":628,"app_name":"Kids Drawing & Painting Games","status":1,"app_developer_name":"IDZ Digital Private Limited","app_score":"4.338983","app_category":"Educational","group_label":"Educational","app_package":"com.iz.drawing.kids.coloring.baby.toddler.painting.doodle.draw.learning.games","introduction":["If you're in search of an engaging and educational kids application, look no further than the Kids Drawing & Painting Games. This app, id com.iz.drawing.kids.coloring.baby.toddler.painting.doodle.draw.learning.games, is an enchanting blend of fun, creativity, and learning. It offers easy and fun coloring pages and drawing games, sure to deliver an artistic adventure like no other. Little artists get ready to paint, doodle, and have endless fun while developing essential skills. This app provides the ideal platform for kids to express their creativity and imagination, all while learning and having a blast."]},{"id":621,"app_name":"Smashero.io - Hack n slash RPG","status":1,"app_developer_name":"Cannon Cracker","app_score":"4.5576925","app_category":"Action","group_label":"Action","app_package":"com.cc.Smashero","introduction":["Immerse yourself in the land of Smashero.io - Hack n Slash RPG, a game where power, strategy, and adventure combine in an explosive mix. Feel the exhilaration as you conquer a multitude of worlds, fighting off terrifying monsters even more daunting than zombies and vampires. Unleash your skill and might as you take on the role of a hero on a mission to vanquish evil from the universe, growing stronger with every monster you vanquish."]},{"id":622,"app_name":"LEGO® DUPLO® PEPPA PIG","status":1,"app_developer_name":"StoryToys","app_score":"4.17","app_category":"Educational","group_label":"Educational","app_package":"com.storytoys.lego.duplo.peppa.pig.googleplay","introduction":["Get ready to dive into the joy-filled and playful world of LEGO® DUPLO® PEPPA PIG. This interactive and engaging app provides cheerful and educational fun for little ones. Featuring familiar characters from Peppa Pig, fun-filled activities and plenty of muddy puddles, it offers an array of experiences that aim to entertain and educate. Each package offers a different setting in the beloved Peppa Pig universe, showcasing Peppa and her friends brought to life in 3D LEGO Duplo form. Get set for lots of giggles, learning and muddy puddles with this app!"]},{"id":625,"app_name":"Flame of Valhalla Global","status":1,"app_developer_name":"Leniu Technology Co., Limited","app_score":"4.6620555","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.eu.firegp","introduction":["Step into a legendary world of Norse mythology, where gods old and new are locked in the monumental War of the Gods. Flame of Valhalla Global sets the scene with the shattered World Tree Yggdrasil, the life force that once connected various realms. Being the chosen one, your destiny is to write your tale of greatness amidst the awe-inspiring landscapes, server-wide warfare, grand adventures with Valkyrie and bravery against the formidable epic bosses. This game offers an immersive Nordic fantasy open world, reaching an unprecedented level of graphic detail and realism."]},{"id":626,"app_name":"Hello Candy Blast:Puzzle Match","status":1,"app_developer_name":"SUPERBOX Inc","app_score":"4.591687","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.superbox.aos.pekoblast","introduction":["Immerse yourself in the world of Hello Candy Blast: Puzzle Match, a delightful and addictive game featuring cutie character Hello Candy. In this blast puzzle game, your mission is to help Hello Candy collect a variety of delightful sweets. Whether you're a seasoned gamer or just looking for a fun way to pass the time, Hello Candy Blast: Puzzle Match offers an entertaining and engaging gaming experience that will keep you coming back for more. With over 1000+ levels of fun-filled challenges and relaxing puzzles, this game is a crowd-pleaser that's fun for all ages, no internet connection required."]},{"id":629,"app_name":"Basketball Manager 2024","status":1,"app_developer_name":"Finalflow","app_score":"3.96","app_category":"Sports","group_label":"Sports","app_package":"com.finalflow.AFKBB","introduction":["Get ready for Basketball Manager 2024, the first-ever idle basketball game for all hoops enthusiasts. This mobile app, developed by Finalflow, lets you dive into the thrill of managing a professional basketball team without spending countless hours on gameplay. Watch the game unfold automatically as you sit back, relax, and strategize. It doesn't stop there, though: You also grow your team, upgrade your players, and construct various facilities and training centers - all with the income your team earns on its own! The game incorporates a high level of realism that leaves you feeling like a seasoned basketball team manager."]},{"id":630,"app_name":"Cat Fantasy: Isekai Adventure","status":1,"app_developer_name":"Elex","app_score":"4.6791043","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.elex.catfantasy.gp","introduction":["Step into the captivating universe of Cat Fantasy: Isekai Adventure - your go-to App for indulging in a cyberpunk, anime-style 3D turn-based RPG saga! Brace yourself for a one-of-a-kind immersive gaming experience brought to life by captivating anime cat-girls who add thrill and visual delight to your gaming sessions while you unravel mysteries and save a world on the brink of mayhem. This is not just a conventional RPG; it’s an artful blend of character settings, a surreal Isekai Adventure, and the profusion of adrenaline-filled battles which make it a must-have app on your device."]},{"id":631,"app_name":"Fruit Merge: Juicy Drop Game","status":1,"app_developer_name":"Brave HK Limited","app_score":"3.74","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.melon.drop.fruit.merge.master","introduction":["Welcome to the charming and vibrant world of Fruit Merge: Juicy Drop Game, a captivating fruit-matching puzzle challenge brought to you by Melon Drop Fruit Merge Master. In this thrilling game, you are tasked with combining identical fruits which, upon collision, transform into a larger fruit. It's a unique spin on the classic match-3 genre, where your aim is not merely matching fruits, but merging them to yield bigger, juicier results. As your fruits grow in size, the space within your container becomes increasingly precious - presenting a compelling challenge of space management and strategic planning."]},{"id":633,"app_name":"ABCmouse – Kids Learning Games","status":1,"app_developer_name":"Age of Learning, Inc.","app_score":"3.8270354","app_category":"Education","group_label":"Education","app_package":"mobi.abcmouse.academy_goo","introduction":["Discover the award-winning learning program for kids - ABCmouse. Created by seasoned professionals in teaching and education, this app covers a full range of subjects from reading, math, to art and music for children aged 2 to 8. With more than 10,000 engaging Learning Activities, ABCmouse is not only fascinating but also academically beneficial to your children's development."]},{"id":634,"app_name":"Princess Amelia's World","status":1,"app_developer_name":"Beansprites LLC","app_score":"3.5714285","app_category":"Educational","group_label":"Educational","app_package":"com.beansprites.papercutoutprincesscastleFREE","introduction":["Step into the magical world of Princess Amelia's World, a realm filled with fairytale charm and boundless creativity. This enchanting app immerses children into a realm of castles, princesses, and limitless possibilities. As they venture through wondrous kingdoms, uncovering hidden secrets and meeting friendly characters, their imaginations are constantly stimulated. It is more than just a game; it's a magical journey that fosters creativity and curiosity, converting every moment into a whimsical adventure.","This game isn't just about delightfully gleeful adventures; it's a platform for every child to construct their very own fairytale, complete with unique characters and custom-built castles. Every element in this game has been crafted flawlessly, ensuring an immersive experience that transcends the screen and touches the heart."]},{"id":635,"app_name":"Lingokids - Play and Learn","status":1,"app_developer_name":"Lingokids - English Learning For Kids","app_score":"4.3379583","app_category":"Education","group_label":"Education","app_package":"es.monkimun.lingokids","introduction":["Lingokids - Play and Learn is your one-stop solution for moulding young minds into quick thinkers and avid learners. Recognised as the #1 Learning App for Kids, Lingokids offers a universe crammed with over 1600+ vibrant, entertaining activities. Combining academics with essential modern life skills, Lingokids crafts a stimulating environment where young learners thrive. Don't just teach, let your kids explore a world that fosters their curiosity, empowers their imagination, and instils them with a zeal for lifelong learning!"]},{"id":636,"app_name":"Cafe Dash: Cooking, Diner Game","status":1,"app_developer_name":"MAD PIXEL","app_score":"3.9777777","app_category":"Casual","group_label":"Casual","app_package":"com.friedeggames.cafe","introduction":["Welcome to Cafe Dash: Cooking, Diner Game, where your dream of becoming a top-notch restaurateur springs to life. This enticing game transforms you from a humble small mall cafe owner to a tycoon of a gourmet restaurant empire, attracting the crème de la crème of show business stars. Nourish your entrepreneurial spirit through this gastronomic adventure where you manage all aspects of your restaurant while expanding your palate with dishes from around the globe."]},{"id":637,"app_name":"CoComelon- Kids Learn and Play","status":1,"app_developer_name":"Moonbug Entertainment Limited","app_score":"2.2857144","app_category":"Educational","group_label":"Educational","app_package":"com.moonbug.ccml","introduction":["Say hello to JJ, the friendly face of CoComelon - Kids Learn & Play. This engaging app, expertly designed for early learners, aged 2-5, is your go-to resource for interactive and enjoyable activities. Whether they're honing in on their alphabet, practicing numbers, recognizing colors or sorting shapes, CoComelon assures not only an educational experience but also a playful one. With a curriculum-based, skill-building approach, this app invites children to learn and grow at their own pace, boosting their confidence and love for learning."]},{"id":638,"app_name":"Timpy Kids Cute Pet Care Games","status":1,"app_developer_name":"Timpy Games For Kids, Toddlers & Baby","app_score":"4.857143","app_category":"Educational","group_label":"Educational","app_package":"com.iz.timpy.animals.pet.care.groom.wash.kids.games","introduction":["Welcome to Timpy Kids Cute Pet Care Games - a whole new world of fun, learning, and empathy. This game is not just another one on the digital shelf but an immersive educational experience especially designed for kids. It takes children on an exciting journey of pet care where they learn important life skills such as responsibility and compassion while taking care of their adorable virtual pets.","Picture children learning about pet ownership without the real-life mess and commitment. The game offers a safe and interactive platform wherein kids can nurture and bond with their virtual pets. From feeding and bathing to playing and grooming, there’s a gamut of activities to keep the little ones engaged."]},{"id":639,"app_name":"Disney Coloring World","status":1,"app_developer_name":"StoryToys","app_score":"4.217848","app_category":"Educational","group_label":"Educational","app_package":"com.storytoys.disney.pixar.coloring.princess.googleplay","introduction":["Disney Coloring World is a vibrant and fun-filled app that lets kids get creative with their favorite Disney and Pixar characters. With hundreds to choose from, this app lets your little one explore an ever-expanding universe full of over a thousand stickers. From Mickey and Minnie Mouse to all the characters from Frozen, The Lion King and Toy Story, it's a platform where classic and contemporary Disney characters coexist. Even the princesses and villains have space here. So, whether it's giving Elsa a blazing red dress or coloring Mickey Mouse's ears green - the sky is the limit!"]},{"id":641,"app_name":"Pango Hide & Seek: Fairy Tales","status":1,"app_developer_name":"Studio Pango - Kids Fun preschool learning games","app_score":"3.493827","app_category":"Educational","group_label":"Educational","app_package":"com.studiopango.fairytales","introduction":["Embark on a magical journey with Pango Hide & Seek: Fairy Tales, an enchanting hide-and-seek game, meant to whisk your little ones into the fantastical world of fairy tales. Specially crafted for kids aged between 2 and 5, this fun-filled game provides an enjoyable and secure interface, completely devoid of ads, promising an uninterrupted session of joyous exploration. Unravel an intriguing story that unfolds across 15 vividly illustrated pictures, as your kid searches for characters and objects throughout the well-known fairy tale landscapes."]},{"id":643,"app_name":"Hired Heroes: Medieval Warfare","status":1,"app_developer_name":"Azur Interactive Games Limited","app_score":"4.189189","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.BastardGames.HiredHeroesMedievalWarfare","introduction":["Immerse yourself in Hired Heroes: Medieval Warfare, a strategic Massively Multiplayer Online Role-playing Game set in the tumultuous era of the Middle Ages. Every day, ferocious battles for territory and resources take place in this dynamic medieval world. As a player, your mission is daunting yet bold - assemble a team of fearless mercenaries and plunge headfirst into an unforgiving battle for honor, wealth, and power. Unleash the strategist in you as you navigate your team through ground shaking clashes and life-altering decisions."]},{"id":644,"app_name":"Waven","status":1,"app_developer_name":"ANKAMA GAMES","app_score":"4.542056","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.ankama.waven","introduction":["Immerse yourself in iconic environments and experience battles like never before with Waven, an exciting online RPG app that is set in a varied and vibrant fantasy world. In Waven, every decision you make, every path you choose, and every strategy you implement has a monumental impact on the outcome of your adventure. You're more than just an avatar stuck in a predetermined storyline. Instead, you are an adventurer on a journey to shape your own destiny, explore the world’s mysteries, forge alliances, and become a famed hero. Notably, Waven offers a unique artistic direction that is sure to keep gamers engrossed at every turn."]},{"id":645,"app_name":"Timpy Pizza Kids Cooking Games","status":1,"app_developer_name":"Timpy Games For Kids, Toddlers & Baby","app_score":"4.21875","app_category":"Educational","group_label":"Educational","app_package":"com.iz.pizza.party.maker.restaurant.kids.cooking.games.pizzeria","introduction":["Welcome to the world of pizza making with Timpy Pizza Kids Cooking Games, where every child becomes the next best pizza chef! This exploration into culinary creativity is not only a fun-filled cooking game but also an age-appropriate educational journey specially designed for children from 2 to 5 years old. The game provides an immersive experience of pizza making, right from kneading the dough to adding your preferred toppings and baking it to perfection in our virtual restaurant, making each pizza uniquely yours."]},{"id":646,"app_name":"My Town: Wedding Day girl game","status":1,"app_developer_name":"My Town Games Ltd","app_score":"4.359343","app_category":"Educational","group_label":"Educational","app_package":"mytown.wedding.free","introduction":["Indulge in the magical world of fantasy weddings with My Town: Wedding Day Girl Game. Here, you channel your inner wedding planner and make fairytale-like weddings come true. It’s not just about playing dress-up games but it’s also organizing the perfect wedding day party! With endless role play options and other exciting features, this game takes a step beyond the traditional girls' games. It gives you the freedom to decorate the wedding cake, choose the bride’s dress, and set up the party with a DJ and decorations. With six different locations to choose from, every game is an opportunity to weave a unique marriage story. Each dollhouse room you explore comes with its own bouquet of characters to meet and interact with.","Be it cake decorating, outfit selections, or venue-preparations, every moment is a creative opportunity. This girls' game is a fantastic platform for kids to experiment, play and create their own joyful moments in a safe digital environment all around the globe."]},{"id":648,"app_name":"Lost in Play","status":1,"app_developer_name":"Snapbreak","app_score":"4.716981","app_category":"Adventure","group_label":"Adventure","app_package":"com.snapbreak.lip","introduction":["Embark on an enchanting journey through a world brought to life by the imagination of a brother-sister duo in Lost in Play. This interactive game invites you to explore between the boundaries of reality and fantasy, solving thoughtfully crafted puzzles, and interacting with vivid and magical characters. As you strive to find the way back home, you will traverse an enchanted forest with a horned beast, incite a rebellion in a goblin village, and aid a group of frogs in freeing a sword. The intriguing world of Lost in Play is not only a gaming experience, but a dive into the nostalgia and excitement of childhood adventures."]},{"id":649,"app_name":"Screw Pin Jam Puzzle","status":1,"app_developer_name":"WONDER GROUP","app_score":"4.4125876","app_category":"Casual","group_label":"Casual","app_package":"com.easystudio.screw.pin.jam.puzzle","introduction":["Take a dive into the world of logic and creativity with 'Screw Pin Jam Puzzle'. This puzzle game is extraordinarily innovative and is designed to hone your spatial imagination and strategic planning abilities. It sets out to challenge and intrigue its players with a board composed of intricately placed screws and pins. Every screw and every pin can be a potential key to solving the complex puzzle, thereby putting your decision-making skills to test. This game is not just another pastime, rather it provokes quick and exacting thinking, keeping you on your toes."]},{"id":650,"app_name":"Eye Color Mix","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.5521474","app_category":"Simulation","group_label":"Simulation","app_package":"com.alexp.eyemix","introduction":["Eye Color Mix is a unique coloring game that blends art and beauty in an exciting, playful way. This game invites you to step into a world teeming with vibrant colors and endless creative possibilities. It combines the thrills of a makeup kit with the soft, exquisite strokes of a paintbrush, giving players an innovative outlet for their imagination and creativity. Whether you're looking to try out realistic eye colors or to dabble your virtual brush in more adventurous hues, this game challenges and fascinates in equal measure."]},{"id":651,"app_name":"Bus Mania - Car Jam Puzzle","status":1,"app_developer_name":"ZPLAY HC Games","app_score":"3.54","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.together.CrazyBus","introduction":["Welcome to the vibrant world of Bus Mania, the ultimate king of parking puzzle games. It's not just any ordinary puzzle game; it's an intricate maze of colorful parking lots where you take on the role of an astute navigator ensuring every passenger finds their matching ride. This game provides a stellar mix of thrilling gameplay and brain-teasing conundrums that call for strategic maneuvers and quick thinking. A visually stunning experience filled with beautifully crafted artwork, smooth animations, and a collection of stylish vehicles, Bus Mania will reel you in with its unique gameplay and ensure endless hours of fun and mental workout."]}]
