[{"id":655,"app_name":"BTS Cooking On","status":1,"app_developer_name":"Com2uS","app_score":"4.4","app_category":"Simulation","group_label":"Simulation","app_package":"com.com2us.bco.android.google.global.normal","introduction":["BTS Cooking On is a global cooking game that invites you to take a culinary journey around the world with the much-loved characters of 'TinyTAN,' famously crafted by pop sensation, BTS. You will put on your chef hat and embark on this adventure to learn new exciting skills and make friends globally. Drawing inspiration from BTS, this game lets you spread the joy across the world through the magic of food, transforming your plain dishes into an enchanting gourmet exploration."]},{"id":656,"app_name":"Magic Sort: Water Sort Puzzle","status":1,"app_developer_name":"blu studios","app_score":"4.047619","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.blu.wsp","introduction":["Take a magical journey with Magic Sort: Water Sort Puzzle, where you assist Wizard George in sorting mysterious potions. In a beautiful setting of a mystical bar, filled with color tubes and magical potions, your mind will be put to the test. This vibrant, engaging game will stimulate your cognitive abilities and fascinate your senses, with every move bringing you closer to solving the captivating puzzles. The enchanted realm of magic challenges you to unlock the secrets of the potions and bring order to chaos, introducing you to a whole new world of excitement."]},{"id":658,"app_name":"Nuts — Color Sort Puzzle Games","status":1,"app_developer_name":"ZephyrMobile","app_score":"4.779505","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.zm.nuts","introduction":["Step into the exciting world of Nuts – Color Sort Puzzle Games! Designed to both entertain and engage, this delightful game offers a fresh and engaging way to relax and unwind. Combining the best elements of color games and sort puzzles, this colorful game will keep you transfixed as you navigate its varying levels of complexity. With each level, you'll find yourself more engrossed in the process of color matching to sort a myriad of vibrant nuts and bolts. Perfectly suited for players of all ages, Nuts – Color Sort Puzzle Games promises endless hours of brain-teasing fun."]},{"id":661,"app_name":"Mermaid coloring book gradient","status":1,"app_developer_name":"Abovegames","app_score":"4.025","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.abovegames.coloringglittergradientmermaids","introduction":["Dive into a world of magic and color with the Mermaid Coloring Book Gradient game. This enchanting coloring experience is not just a game but a journey for every child's imagination. The game offers gorgeous mermaid-themed images featuring the ocean's many beautiful creatures. Let your child's creativity flow with a variety of glitter paints, gradient colors, and stunning accessories as they get lost in this underwater fantasy world. It's a canvas where they can express their artistry, taking them on a trip to magical realms beneath the waves."]},{"id":663,"app_name":"My Very Hungry Caterpillar","status":1,"app_developer_name":"StoryToys","app_score":"4.165663","app_category":"Educational","group_label":"Educational","app_package":"com.storytoys.myveryhungrycaterpillar.free.android.googleplay","introduction":["Embark on a charming journey with the little green crawling creature in 'My Very Hungry Caterpillar'. This tantalizing game, inspired by Eric Carle’s globally adored character, brings the beloved Very Hungry Caterpillar™ to life. This application, having attracted over 6 million downloads to date, offers a delightful interactive play experience loved by millions of children for over half a century. You'll watch the tiny egg morph into a ravenous caterpillar craving food and fun, evolving into a cocoon, and blossoming into a beautiful butterfly. It's a world of beauty and color you'll return to again and again.","The game is beautifully illustrated staying true to Carle’s distinctive color-filled, hand-painted collage illustrations. Within this award-winning toddler-friendly game, your child will engage in limitless non-competitive play, fostering nurturing skills and a love for nature. Watch as they learn, grow and laugh with this classic caterpillar character who leaves a trail of munched goodies in his trail."]},{"id":664,"app_name":"Twerk Race 3d — Fun run game!","status":1,"app_developer_name":"Freeplay Inc","app_score":"4.5184712","app_category":"Arcade","group_label":"Arcade","app_package":"com.freeplay.twerk","introduction":["Immerse yourself in the world of Twerk Race 3D—a wildly entertaining run race 3D game that combines fun running, exciting racing tasks, and some seriously impressive twerking. Dash your way across the tracks, tackle challenging obstacles, shake your body in the ultimate twerk battle, and zoom your way to victory. The catch? Your body size matters! Whether you're busy gobbling down burgers to beef up or consuming healthy food to slim down, your body's size can make all the difference to your chances of winning the race. Get ready for an adrenaline-pumping, hilarious gaming experience!"]},{"id":665,"app_name":"Screw Puzzle: Wood Nut & Bolt","status":1,"app_developer_name":"FALCON GAMES","app_score":"4.5179124","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.fc.nut.screw.bolt.washer.fastener.puzzle","introduction":["Dive into a captivating realm of Screws and Fasteners with the Screw Puzzle: Wood Nut & Bolt game! This is not just another puzzle game, it's where the thrill of twisting bolts, unraveling nuts, and untangling wooden puzzles comes to life. The game takes puzzling to a whole new level by adding on the challenge of decoding the secret hidden within the folds of lumber. Each turn introduces a new twist that will have you scratching your head and racking your brains, preparing you for a rush of exhilaration each time you conquer the challenges."]},{"id":668,"app_name":"Cooking School: Game for Girls","status":1,"app_developer_name":"Hippo Kids Games","app_score":"4.253846","app_category":"Educational","group_label":"Educational","app_package":"com.PSV.Baby_Cooking_School","introduction":["Dive into the delightful world of culinary arts with the Cooking School: Game for Girls app. Created by Hippo Kids Games, this interactive and educational game offers a unique platform where children and parents can bond over cooking without the mess. Have fun playing chef as you explore complex yet engaging recipes from all around the world. From flipping pancakes to baking cakes, your little kitchen will remain spotless as you immerse in the exciting process of cooking.","Prepare to get your hands dirty as you learn the secrets behind every recipe. With Chef Hippo guiding you every step of the way, rest assured that there's plenty of room for creativity and experimentation, all while having a whole lot of fun. This isn't just about cooking - it's about fostering unity within the family by crafting unique meals together. Get ready to join the family cooking school with our curious Hippo, a journey that ends with delicious dishes adorned to your taste."]},{"id":669,"app_name":"Wooparoo Odyssey-Build & Breed","status":1,"app_developer_name":"NHN Corp.","app_score":"3.9705882","app_category":"Simulation","group_label":"Simulation","app_package":"com.nhn.wooparoo","introduction":["Wooparoo Odyssey is an enchanting mobile game that merges the joys of breeding and building in a fantastical world. The game introduces you to a magical realm teeming with loveable creatures called Wooparoos, waiting to be discovered and nurtured in your custom-made village. The more you play, the wilder your journey becomes, as you blend different combinations of these critters to invoke new and unique Wooparoos! With over 500 different breeds of adorable creatures to collect and new ones being introduced every week, Wooparoo Odyssey promises an exhilarating gaming experience."]},{"id":670,"app_name":"Baby Panda’s Summer: Café","status":1,"app_developer_name":"BabyBus","app_score":"4.27","app_category":"Educational","group_label":"Educational","app_package":"com.sinyee.babybus.coffee","introduction":["Unleash your inner culinary genius with the irresistibly fun and educational app, Baby Panda's Summer: Café. Offered by the innovative creators at BabyBus, this engaging app lets you step into the paws of adorable Baby Panda as you take on the role of a café owner. Think summer, think refreshing drinks - Baby Panda's coffees, teas, ice creams, salads, cakes, donuts, are all waiting for you to cook! From managing your café to creating an assortment of food and drinks, Baby Panda's Summer: Café turns your dream of running your own coffee shop into an exciting virtual adventure."]},{"id":673,"app_name":"Fishing Master","status":1,"app_developer_name":"ARK GAME LIMITED","app_score":"4.0970874","app_category":"Casual","group_label":"Casual","app_package":"com.arkgame.fishingmaster","introduction":["Immerse yourself into the vast ocean with Fishing Master, a 3D fishing game that offers you a realistic, and scenic underwater world. This isn't your everyday game, it's an adventure that takes fishing to an entirely new level. No need to travel to the world's best fishing places, this game brings them to you. You can catch various species of fish, from the smallest to the incredible monster shark from places like Key West, Amazon, Pacific Ocean, and Bering Sea. Challenge your friends and compete across global leaderboards for a chance at glorious rewards. It's relaxing yet engaging, easy to play, yet challenging.","Whether you're a pro or newbie fisherman, this game with its intuitive controls and rewarding mechanisms promises an exceptional fishing journey. So put on your fishing hat, grab your gear and step into the soothing world of Fishing Master - because fishing has never been so exciting before!"]},{"id":674,"app_name":"Gangs Wars: Pixel Shooter RP","status":1,"app_developer_name":"playducky.com","app_score":"4.052174","app_category":"Action","group_label":"Action","app_package":"com.actopolus.PixelDudeSandbox","introduction":["Immerse yourself in a world of pixel madness with Gangs Wars: Pixel Shooter RP Game. This physics-based action sandbox game opens a new dimension of open-world games equipped with a blend of exciting storylines and simulator games to be played offline. A remarkable ragdoll game filled with action sequences, physics-based mechanics, and an unfolding offline story mode within a vast open world map. With outstanding graphics and a combination of relaxing and action-packed quests, Gangs Wars: Pixel Shooter RP is the game that will keep you on your toes.","Engage in theft gangs, mafia wars, and join the exhilarating journey of a guy entwined in the mafia wars. Rescuing a friend from the evil mafia boss, Tony Cubeface has never been so much fun. The thrilling storyline missions set within an open-world action game format will leave you waiting for more. So are you ready, dude? Loads of action and fun waiting to unfold!"]},{"id":675,"app_name":"Toddler Baby Phone Games kids","status":1,"app_developer_name":"Midwin Games","app_score":"4.3636365","app_category":"Educational","group_label":"Educational","app_package":"com.midwin.babyphone.babygames.kids.learn.toddler.games.preschool.tabletsplay.telephone","introduction":["Welcome to the colorful and fun world of Toddler Baby Phone Games kids! This entertaining and informative app is designed specifically for tiny tots aged 1 year and onwards. Offering an enticing blend of interactive games and educational activities, this babyphone game app aims to help your little ones learn and grow. Whether it's mastering the basics of counting with numbers 123, discovering various animals and their sounds, or exploring vibrant colors and shapes - this game's got it all. The playful interface will captivate your child's attention while the clever activities will engage their curious minds, making the learning experience a delightful adventure.","This game doubles as an early learning tool infused with fun mini games like balloon popping, memory match, coloring and more. There's also an introduction to the alphabet, helping toddlers get their first taste of ABC. Opening the doors to creativity, kids can unleash their imagination with drawing and coloring games. The app also encourages toddlers to experiment with a kid phone, calling any number to connect. It's a perfect platform for kids to step into the world of learning while having a ton of fun!"]}]
