[{"id":123,"app_name":"Golf Clash","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.228814","app_category":"Sports","group_label":"Sports","app_package":"com.playdemic.golf.android","introduction":["Are you ready for some golfing action? Golf Clash is the golf game that has everyone talking! Available to download for free, this BAFTA award-winning game lets you tee off in the most picturesque golf courses around the globe. Its incredible real-time multiplayer mode enables 1v1 challenges and takes fierce competition up a notch! Contend against millions of other dedicated golfers worldwide and emerge as the ultimate Golf King!"],"app_summary":"Quick-fire golf duels! Master your golfing skills & become the Golf Clash King!"},{"id":124,"app_name":"Bendy and the Ink Machine","status":1,"app_developer_name":"Joey Drew Studios","app_score":"4.416","app_category":"Adventure","group_label":"Adventure","app_package":"com.jds.batim","introduction":["Bendy and the Ink Machine™ is more than just a horror game. It's a heart-pounding plunge into a cartoon nightmare, fusing puzzle-solving, action, and intense storytelling. You'll take on the role of Henry, a head animator from the golden age of cartoons, returning to the derelict Joey Drew Studios. The studio's most notorious character, Bendy, has been let loose once again in this eerie labyrinth of ink shadows and dancing cartoons. But there's far more to fear than Bendy. The Ink Machine is restless, waiting in the darkness, preying on your fear."],"app_summary":"A Puzzle-Action-Horror Set in a Mysteriously Sketchy Studio"},{"id":141,"app_name":"Hidden City: Hidden Object","status":1,"app_developer_name":"G5 Entertainment","app_score":"4.3718514","app_category":"Adventure","group_label":"Adventure","app_package":"com.g5e.hiddencity.android","introduction":["Dive into the fantastic world of Hidden City: Hidden Object, a captivating mobile game that transports you to mysterious locations to unravel intriguing riddles and puzzles. Enter into a realm where magic, witchcraft and science converge, and odd creatures roam the streets. Amidst this strange city, you're the only one who can save your friend who's been dragged into the city by ominous black smoke. Engage in this challenging hidden object game as you decipher cryptic clues, encounter unique characters and grapple with an enigma as arresting as the city's shadowy alleyways."],"app_summary":"Seek and find hidden objects, play puzzle games and solve a mystery in the city!"},{"id":127,"app_name":"Goat Simulator GoatZ","status":1,"app_developer_name":"Coffee Stain Publishing","app_score":"4.3561645","app_category":"Action","group_label":"Action","app_package":"com.coffeestainstudios.goatsimulator.goatz","introduction":["Get ready for the most outrageous and humorous gaming experience to date with Goat Simulator GoatZ! Coming to you from the mad geniuses at Coffee Stain Studios, GoatZ stretches the boundaries of what you thought possible in a simulator game - imagine a world where goats and zombies coexist! Picture this: You're not just a goat - you're a goat in a world overrun by hordes of the undead. It's zany, it’s ridiculous, and it's a barrel of laughs!","Forget your average run-of-the-mill simulation games. GoatZ is a game that isn't afraid to be goofy and preposterous. The guys at Coffee Stain Studios have outdone themselves this time, providing an unapologetically hilarious game complete with zombies, goats, and a crafting system! So, get ready to laugh, shout, and goat your way through a world of chaos and hilarity."],"app_summary":"This is GoatZ, this is your story."},{"id":128,"app_name":"Clash Royale","status":1,"app_developer_name":"Supercell","app_score":"4.2158537","app_category":"Strategy","group_label":"Strategy","app_package":"com.supercell.clashroyale","introduction":["Enter the Clash Royale Arena, an action-packed multiplayer battle game brought to you by the creators of Clash of Clans. Put your strategy and deck building skills to test through fast-paced real-time battles, starring your favourite Clash characters and more. The Arena is much more than a combat zone; it's a playground where your brain's strategic prowess truly shines."],"app_summary":"Clash Royale is a real-time, head-to-head battle game set in the Clash Universe."},{"id":129,"app_name":"Need for Speed™ No Limits","status":1,"app_developer_name":"ELECTRONIC ARTS","app_score":"4.4093847","app_category":"Racing","group_label":"Racing","app_package":"com.ea.game.nfs14_row","introduction":["Get ready to immerse yourself in the world of Need for Speed™ No Limits, a thrilling mobile racing game specifically designed for the true petrolhead. Hailing from the game developers behind the hit Real Racing 3, this game lets you dominate the street racing underground as you immerse yourself in the chaotic, heart-racing action of Blackridge city. Conquer the asphalt, tune your cars and engage your nitro as you build the car collection of your dreams and become a racing legend!"],"app_summary":"Race, drive, and tune cars to rule the street racing world. Hit the asphalt now!"},{"id":101,"app_name":"MONOPOLY Slots - Casino Games","status":1,"app_developer_name":"SciPlay","app_score":"4.7037745","app_category":"Casino","group_label":"Casino","app_package":"com.scientificgames.monopolyslots","introduction":["Monopoly Slots - Casino Games is an exciting online game that combines the thrill of slot machines with the strategic fun of the iconic Monopoly board game. Developed by SciPlay, the Top Social Casino Company of 2023, this game delivers an authentic Vegas-style casino experience right on your device. Place your bets, spin the wheel, and see if luck is on your side as you strive to become a monopoly millionaire! You can play a range of exciting slots, complete quests, and build your very own monopoly city. It’s not just a game, it’s an adventure waiting to unfold."],"app_summary":"Hit the Jackpot with Las Vegas MONOPOLY Slot Machines! Classic Casino Slot Game"},{"id":102,"app_name":"Granny","status":1,"app_developer_name":"DVloper","app_score":"4.262521","app_category":"Arcade","group_label":"Arcade","app_package":"com.dvloper.granny","introduction":["Dive into the suspenseful world of Granny, a uniquely terrifying mobile game experience that will keep you on the edge of your seat. Within this game, you are locked in Granny's creepy old house, desperately trying to find a way out before your time runs out. With every noise you make, you're one step closer to being caught. Can you escape her detection? You've got five days to find out. A heart-stopping game of cat and mouse, Granny delivers an unforgettable and chilling game-play experience that is sure to leave you wanting more."],"app_summary":"Granny keeps you locked in her house."},{"id":103,"app_name":"Supermarket Mania - Match 3","status":1,"app_developer_name":"G5 Entertainment","app_score":"4.357616","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.g5e.smmmtch3pg.android","introduction":["Step into the world of business with Supermarket Mania® - Match 3! You don't merely play a game; you embark on a thrilling puzzle adventure. Here, you get to open your supermarket and expand your grocery chain. Accompany Nikki, the leading character, back to her hometown, Tinsel Town, where it's up to you to contribute to the city's development by playing through addictive match-3 levels to grow your supermarket business.","The premise of the game is straightforward, yet mastering it would test your tactical abilities. You might find the easiness of matching three or more identical treats deceptive when it comes to beating the several challenging levels packed in the game. So, roll up your sleeves, and get ready to strategize every move and aim to reach the targets to keep the business booming."],"app_summary":"Dive into Supermarket Mania® - Match 3 - an exciting puzzle adventure!"},{"id":104,"app_name":"CSR 2 Realistic Drag Racing","status":1,"app_developer_name":"NaturalMotionGames Ltd","app_score":"4.59545","app_category":"Racing","group_label":"Racing","app_package":"com.naturalmotion.customstreetracer2","introduction":["Unleash your need for speed with CSR 2 Realistic Drag Racing! This game transports hyper-realistic drag racing straight to your fingertips, revolutionizing mobile racing with its superior graphics and highly immersive gameplay. This game, third in line following CSR Racing and CSR Classics, provides an exceptional mobile drag racing experience with millions of global players and partnerships with leading car manufacturers. This is not just a game, it's a bona fide motorsport simulator that drives up the adrenaline and pushes your skills to the limit."],"app_summary":"The Drag Racing Game where you build your Dream Driving Car Collection!"},{"id":106,"app_name":"Spider Solitaire: Card Games","status":1,"app_developer_name":"MobilityWare","app_score":"4.629863","app_category":"Card","group_label":"Card","app_package":"com.mobilityware.spider","introduction":["Meet Spider Solitaire: Card Games, the ultimate classic Solitaire game that has taken the world by storm and garnered a whopping 100 million users worldwide. This game goes beyond the realms of the normal card game to ignite your passion and challenge your strategic skills. Available for free, Spider Solitaire brings the good old delightful Solitaire experience to your fingertips, spiced with a unique weekly event that let's you virtually travel the world by completing specialized Spider Solitaire hands each week! If free card games like Spades, Hearts, Rummy, and various types of Solitaire like Klondike, Pyramid, and FreeCell are your thing, then you'd fall head over heels for Spider Solitaire!"],"app_summary":"Spider Solitaire - Relax and Play the classic Solitaire card game"},{"id":107,"app_name":"Taichi Panda","status":1,"app_developer_name":"Snail Games USA Inc","app_score":"4.262542","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.snailgameusa.tp","introduction":["Step into the enchanting world of Avzar with Taichi Panda, an exciting and fast-paced action RPG set in a vivid universe filled with mysterious creatures, ominous specters, and countless challenges. Equipped with enthralling 3D graphics and a unique combat system, this game lets you wage epic battles against hordes of enemies as you strive to become the ultimate legend. Celebrate the Thanksgiving atmosphere in Avzar and discover numerous special treats, from the new Solo Challenge in Team Instance, Pet Tale experiences, to mount fortification, and freshly arrived rewards in Battle Royale."],"app_summary":"An exciting action adventure RPG of Panda proportions!"},{"id":133,"app_name":"Toca Boo","status":1,"app_developer_name":"Toca Boca","app_score":"3.9423077","app_category":"Educational","group_label":"Educational","app_package":"com.tocaboca.tocaboo","introduction":["Dive into the amusing world of Toca Boo, an addictive adventure game that combines humor, scares, and heaps of fun. Crafted for the enjoyment of kids as young as 4 but also enthralling for older crowds, Toca Boo is a delightful journey into the world of spooks. You follow the character Bonnie, a mischievous little ghost who thrives on playfully scaring her family. The game offers endless exploration across a large, mysteriously designed house full of surprising adventures and quirky hideouts."],"app_summary":"BOO! \nDid I scare you!? My name is Bonnie and my family loves to spook!"},{"id":125,"app_name":"Goat Simulator","status":1,"app_developer_name":"Coffee Stain Publishing","app_score":"4.649573","app_category":"Simulation","group_label":"Simulation","app_package":"com.coffeestainstudios.goatsimulator.free","introduction":["Goat Simulator Free is the ultimate goat simulation experience that pushes the boundaries of your imagination! It incorporates the best of technology to bring you a one of a kind experience that provides not only amusement but also fun filled destruction. You no longer need to daydream about becoming a goat - this game makes it a reality. It's an unconventional game that shifts from usual gaming norms where you are in control of a goat causing chaos and destruction in an old school skating game-like setting."],"app_summary":"The Original Goat Simulator! Be a goat!"},{"id":126,"app_name":"Bloons TD 6","status":1,"app_developer_name":"ninja kiwi","app_score":"4.800625","app_category":"Strategy","group_label":"Strategy","app_package":"com.ninjakiwi.bloonstd6","introduction":["Bloons TD 6 is an addictive tower defense game where you use a combination of Monkey Towers and Heroes to defend against invading Bloons. With its Tower Defense pedigree that spans over a decade and constant massive updates, Bloons TD 6 has amassed a global following. With endless strategic gameplay, it's a game destined to keep you hooked for hours on end."],"app_summary":"Smash Hit Tower Defense Game"},{"id":131,"app_name":"Shadow Fight 4: Arena","status":1,"app_developer_name":"NEKKI","app_score":"4.5993714","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.nekki.shadowfightarena","introduction":["Get ready to step into the ring with Shadow Fight 4: Arena, the ultimate multiplayer fighting game experience. In this 3D game, you’ll battle players around the world for ultimate bragging rights. With immersive graphics, easy controls and a captivating story mode, you'll have a console level experience right on your mobile device. Whether you're a seasoned fighter or a beginner, there’s a game mode for you. The game blends classic fighting game elements with new age mechanics in shadow fighting, bringing the best of both worlds. And the best part? This blockbuster fighting phenomenon has already got a user base of over 500 million downloads."],"app_summary":"Epic 3D PvP fighting games! Play with your friends online or fight bots offline!"},{"id":80,"app_name":"Tacticool: Shooting games 5v5","status":1,"app_developer_name":"Panzerdog","app_score":"4.6302843","app_category":"Action","group_label":"Action","app_package":"com.panzerdog.tacticool","introduction":["Are you ready to immerse yourself in intense 5v5 online military battles? Welcome to Tacticool, an action-packed top-down shooter that thrusts you into thrilling army combat. From shooting guns straight from the car to leading a tactical war against zombies, this game guarantees a thrilling experience at every turn. Tacticool is all about strategy, smart moves and intense action. Whether you're battling in the PvP and PvE modes or engaging in fast-paced car chases, it's your task to navigate the challenges and emerge victorious. It's more than a game - it's a test of your tactical finesse and combat skills."],"app_summary":"Tactical third person shooter. Mobile PvP action. Online multiplayer, gun games."},{"id":109,"app_name":"Shadow Fight 3 - RPG fighting","status":1,"app_developer_name":"NEKKI","app_score":"4.559682","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.nekki.shadowfight3","introduction":["Shadow Fight 3 - RPG fighting is a gripping online RPG battling game set in the thrilling universe of shadow energy. Join in the epic war of three powerful clans, each desiring to control the shadow power for their own cause. Will you align yourself with the honorable Legion warriors who seek to destroy the menacing energy, side with the profit-driven Dynasty people, or uncover deepest secrets of the shadow power with the ninjas of the Heralds clan? You decide. This popular sequel not only continues the captivating saga of the Shadow Fight universe but also introduces new 3D characters and an enthralling adventure offering plenty of engaging action roles and mystical forces."],"app_summary":"Start cool brawls with powerful fighters! Your ultimate ninja adventure awaits!"},{"id":134,"app_name":"Harry Potter: Hogwarts Mystery","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.5062485","app_category":"Adventure","group_label":"Adventure","app_package":"com.tinyco.potter","introduction":["Your long-awaited Hogwarts acceptance letter has finally come! Welcome to the one-of-a-kind fantasy RPG, Harry Potter: Hogwarts Mystery. Embark on your magical journey at Hogwarts School of Witchcraft and Wizardry. Will you be the daring Gryffindor, the cunning Slytherin, the smart Ravenclaw, or the loyal Hufflepuff? Only you can decide! Equipping the Sorting Hat, you shape your unique destiny, learn powerful spells, brew complicated potions, solve puzzling mysteries, form alliances with new friends and even find romance."],"app_summary":"A Wizarding World Adventure!"},{"id":135,"app_name":"LEGO® Star Wars™:  TCS","status":1,"app_developer_name":"Warner Bros. International Enterprises","app_score":"3.5785499","app_category":"Action","group_label":"Action","app_package":"com.wb.lego.tcs","introduction":["Immerse yourself in the complete LEGO Star Wars: TCS experience that incorporates both the original LEGO Star Wars: The Video Game and the sequel, LEGO Star Wars II: The Original Trilogy. This galaxy of epic Star Wars content, filled with whimsical humor and exciting gameplay, is now accessible from your Android device. Embark on your adventure in Star Wars: Episode I The Phantom Menace and then make your way through all six episodes in LEGO's fun-filled style. Remember, may the bricks be with you!","This game packs an abundance of content! Please ensure you have 1.44gb of available space on your device if you install over WiFi, or merely 735mb if you download and sync from your computer. It's recommended to restart your device after install to resolve any potential stability issues. Also, make sure your firmware is up-to-date."],"app_summary":"Play all 6 Star Wars™ episodes with over 120 characters in fun LEGO style!"},{"id":142,"app_name":"Bingo Blitz™️ - Bingo Games","status":1,"app_developer_name":"Playtika Santa Monica","app_score":"4.6008782","app_category":"Board","group_label":"Board","app_package":"air.com.buffalo_studios.newflashbingo","introduction":["Dive into the world of Bingo Blitz, a free online bingo game where you're in for a whirlwind of fun and adventure. The game takes you around the globe, allowing you to enjoy bingo like you never have before. With Bingo Blitz, not only do you get the classic bingo experience but a wide range of side games and missions. Coated with colorful graphics and accompanied by engaging narratives, Bingo Blitz will absolutely blitz your gaming expectations."],"app_summary":"Join Drew Barrymore for a round of Bingo!"},{"id":108,"app_name":"Bike Race Pro by T. F. Games","status":1,"app_developer_name":"Top Free Games.","app_score":"4.3114476","app_category":"Racing","group_label":"Racing","app_package":"com.topfreegames.bikeraceproworld","introduction":["Meet Bike Race Pro by T. F. Games, a high-octane, adrenaline-infused bike racing game available exclusively on the Google Play Store. This fast-paced, physics-based game is not just about speed, but also about skill and precision. With all levels unlocked and no intrusive advertisements, this version of Bike Race offers an adrenaline-charged, uninterrupted gaming experience. Intuitive controls paired with engaging game mechanics ensure that players of all expertise levels can dive right in. So strap on your helmet, rev up your engine, and prepare for an exhilarating ride!"],"app_summary":"Drive your bike through amazing tracks with jumps and loops"},{"id":110,"app_name":"Death Worm™","status":1,"app_developer_name":"PlayCreek Games","app_score":"4.673968","app_category":"Arcade","group_label":"Arcade","app_package":"com.playcreek.DeathWorm_Free","introduction":["Take a dive into the terrifyingly fun world of Death Worm™, a thrill-inducing game where you control a gigantic monstrous worm causing havoc and fear. Whether it's a bustling city street, hot desert sands, or icy Antarctic dune, no place is safe from your monstrous appetite. This high-octane action game turns the tables and places you in the role of the predator, hunting down everything from small lizards to helicopters. Whether it's their panicked screams or your oversized, poisonous maw, one thing is for sure - the terror never stops!"],"app_summary":"Take control of a Giant Death Worm and unleash The Power on your enemies!"},{"id":111,"app_name":"slither.io","status":1,"app_developer_name":"Lowtech Studios","app_score":"3.9446533","app_category":"Action","group_label":"Action","app_package":"air.com.hypah.io.slither","introduction":["slither.io is an addictive multiplayer online game available on Google Play. It's a cutthroat world where you play as a tiny snake with an insatiable hunger, striving to become the longest slither on the board. In this arena, you either eat or become eaten, as you battle against other players across the globe who are hungry for supremacy. The ultimate goal is simple, yet the road to achieving it is filled with adrenaline-pumping action and strategic twists that never cease to entertain.","The beauty of slither.io lies in its simplicity and unpredictability. One moment you're just a small snake trying to stay alive, the next moment, you could be the biggest snake on the block having gobbled up your exploding opponents. Whether you're an expert gamer seeking a challenge or a casual player looking for lighthearted fun, slither.io provides an immersive gaming experience that keeps you hooked and coming back for more."],"app_summary":"Play online with people all over the world! Can YOU become the longest player?"},{"id":112,"app_name":"Ben 10: Up to Speed","status":1,"app_developer_name":"Cartoon Network","app_score":"4.0570173","app_category":"Action","group_label":"Action","app_package":"com.turner.b10runner","introduction":["Are you ready for an action-packed ride of powers, speed and intergalactic challenges? Say hello to our gaming delight, Ben 10: Up to Speed! It’s a thrilling ride into the alien universe, where you slip into the shoes of the adventurous Ben Tennyson. After discovering a mysterious alien watch, the Omnitrix, during an ordinary road trip, Ben is thrust into a world where he can turn into superheroic aliens with transcendent abilities. Now, it’s up to him (or rather, you!) to use these powers wisely."],"app_summary":"Use Ben 10's alien powers to run, jump and smash your way past the bad guys!"},{"id":114,"app_name":"MHA: The Strongest Hero","status":1,"app_developer_name":"Crunchyroll Games, LLC","app_score":"4.318677","app_category":"Action","group_label":"Action","app_package":"com.sonypicturestelevision.myheroacademia","introduction":["Step into the world of My Hero Academia with 'MHA: The Strongest Hero'! Walk in the shoes of your favorite heroes and villains from the popular anime series in this action-packed RPG. Battle against the forces of evil using extraordinary Quirks, train and equip your favourite anime characters for patrol, and rise to the very top of the Hero Rankings. Enter the city of Honei, complete special missions, protect citizens, or even roleplay online with friends. Immerse yourself in this expansive open-world game, available now at your fingertips!"],"app_summary":"Enter a world of Quirks and Quirkless. Use your power to fight against villains."},{"id":145,"app_name":"Cube Surfer!","status":1,"app_developer_name":"VOODOO","app_score":"3.8065948","app_category":"Arcade","group_label":"Arcade","app_package":"com.Atinon.PassOver","introduction":["Step into the vibrant world of Cube Surfer!, an exhilarating and highly-addictive game by Google Play. This delightful game tests your skills and stamina as you endeavor to conquer an obstacle course made up entirely of bouncy cubes. Your primary objective is simple - try to pass over all the blocks. To add to the excitement, you have a variety of 9 unique cubes to choose from, each rendering a different level of difficulty and fun. So grab your virtual surfboard and brace yourself for an unforgettable adventure!","Cube Surfer! is inspired by Arcade Classics, offering users an immersive retro gaming experience coupled with modern design elements. The game is visually appealing with its bright, colorful graphics and smooth animations, keeping players captivated for hours on end. Cube Surfer! is all about skill, speed, and tactical maneuvering. It's a thrilling joyride!"],"app_summary":"Try to pass over the blocks!"},{"id":115,"app_name":"Jurassic World Alive","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.213982","app_category":"Adventure","group_label":"Adventure","app_package":"com.ludia.jw2","introduction":["Get ready to bring dinosaurs to life with Jurassic World Alive! Dinosaurs have once again taken over the Earth, and now they're roaming free in your very own world. Venture around your local area, finding your favorite Jurassic World dinosaurs, from awe-inspiring new breeds to familiar, terrifying faces. Meanwhile, the unparalleled excitement in collecting their epic DNA will set your adrenaline rushing! Use collected DNA to level up and create hybrid beasts in the lab. Up for a real test of courage and strategy? Challenge your friends in real-time player-vs-player matches for exclusive rewards. "],"app_summary":"Jurassic World Dinosaurs are ALIVE in our world and roaming free!"},{"id":117,"app_name":"RFS - Real Flight Simulator","status":1,"app_developer_name":"RORTOS","app_score":"4.312009","app_category":"Simulation","group_label":"Simulation","app_package":"it.rortos.realflightsimulator","introduction":["If you've always wondered what it's like to be a pilot, the RFS - Real Flight Simulator is the perfect opportunity to take to the virtual skies. This app doesn't just give you a simple flight simulation experience - it realises your dream of flying a real plane by navigating the world with satellite maps. With high-resolution sceneries, 3D buildings, realistic runways, and complex procedures to follow, you can traverse any part of the globe, taking full control over your flight."],"app_summary":"Become a pilot! Fly and land in airports around the world with iconic airplanes"},{"id":118,"app_name":"Hungry Shark Evolution","status":1,"app_developer_name":"Ubisoft Entertainment","app_score":"4.4724083","app_category":"Arcade","group_label":"Arcade","app_package":"com.fgol.HungrySharkEvolution","introduction":["Dive into the aquatic adventure of Hungry Shark Evolution - an action-packed, free offline mobile game that takes you into the thrilling underwater world of sharks! It is not just about survival, but evolution. As a predator in the vast ocean, your mission is to eat everything and everyone in your way, evolve into the greatest predator, and reign over the immense undersea environment."],"app_summary":"Evolve and grow by eating all kinds of fish in this shark survival game!"},{"id":119,"app_name":"PAW Patrol: Air & Sea","status":1,"app_developer_name":"Nickelodeon","app_score":"3.73","app_category":"Educational","group_label":"Educational","app_package":"net.pluginmedia.pawpatrolflyer","introduction":["Do you hear the PAW Patrol calling? It's time to embark on a thrilling adventure both on air and sea with PAW Patrol: Air & Sea app from Nickelodeon. Made for pre-k kids, this fun-packed game offers a chance for kids to explore the sky and sea along with their favorite characters from the TV show, PAW Patrol. Not just fun, this game sneaks in some valuable pre-k math skills for 3-7-year-olds, helping shape their minds for school readiness. Immerse your children in this PAWsome game filled with challenges, tricks, badges, and loads of fun!"],"app_summary":"PAW Patrol Air and Sea is a fun & educational preschool game from Nick Jr.!"}]
