[{"id":290,"app_name":"Age of Origins","status":1,"app_developer_name":"CamelStudio","app_score":"4.014269","app_category":"Strategy","group_label":"Strategy","app_package":"com.camelgames.aoz","introduction":["Step into the apocalypse and beyond in Age of Origins. With over 70 million downloads worldwide, this immersive zombie strategy MMO gives you the chance to rebuild civilization and tackle the very real threat of human deception. Play as the beacon of hope in a world plunged into darkness by the undead hordes. Combining survivor recruitment, innovation, and combat, your mission is to bring together an alliance of players from around the globe and take back control."],"app_summary":"A strategy game in the zombie doom. Establish shelters, and lead the world"},{"id":293,"app_name":"Sonic Forces - Running Game","status":1,"app_developer_name":"SEGA","app_score":"4.451912","app_category":"Adventure","group_label":"Adventure","app_package":"com.sega.sprint","introduction":["Get ready for an ultimate running adventure with Sonic Forces - a casual multiplayer racing and battleground game from SEGA! In this fast-paced, adrenaline-fueled game, Sonic the Hedgehog is back and better than ever. Compete in real-time multiplayer runs and races against players all around the globe. Utilize your power ups, dodge obstacles, and zoom past your competition to become the ultimate racing champion. With extraordinary graphics and tons of exciting levels, Sonic Forces will take you to an unmatched mobile gaming journey. Get immersed in the pool of fast-paced endless racing and feel the real charm of multiplayer dynamics."],"app_summary":"Sonic is back in this fast and cool multiplayer racing battle & 3D Run game!"},{"id":294,"app_name":"ONE PIECE TREASURE CRUISE","status":1,"app_developer_name":"Bandai Namco Entertainment Inc.","app_score":"4.542983","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.namcobandaigames.spmoja010E","introduction":["Embark on an epic journey with ONE PIECE TREASURE CRUISE - a much-loved anime RPG that is turning the wave with over 100 million downloads worldwide! Join forces with Luffy, Zoro, Nami and the entire ONE PIECE fleet, as you traverse the Grand Line on a thrilling hit anime adventure. This game brings your wildest pirate fantasies to life, as you mix and match over 2,000 characters to create the ultimate team to sail the Seven Seas."],"app_summary":"Build your own ONE PIECE pirate crew and set sail on an anime RPG adventure!"},{"id":295,"app_name":"Albion Online","status":1,"app_developer_name":"Sandbox Interactive GmbH","app_score":"4.4353204","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.albiononline","introduction":["Albion Online is a captivating free-to-play MMO game that invites participants into a colossal open world of electrifying combat, player-driven economy and an unparalleled 'you are what you wear' system. From hardcore player-versus-player (PvP) action, fascinating player-versus-environment (PvE) tasks, through to carving out your unique slice of the game world, Albion Online immerses you into a thrilling land filled with opportunities and ventures limited only by your imagination."],"app_summary":"Albion Online is a cross-platform sandbox MMORPG in a medieval fantasy world."},{"id":297,"app_name":"LIMBO","status":1,"app_developer_name":"Playdead","app_score":"4.4682965","app_category":"Adventure","group_label":"Adventure","app_package":"com.playdead.limbo.full","introduction":["Widely acclaimed as a gem in the world of gaming, Limbo is an Indie award-winning adventure game that has won the hearts of countless gamers worldwide. Capturing the essence of ambient beauty amidst darkness, this game presents a haunting narrative and immersive sound and visuals that blend to create an experience that is in equal measures disturbing and delightfully mysterious. As you traverse through its misty landscapes, it weaves an intricate puzzle design that has kept gamers at the edge of their seats, making it a masterpiece by every standard."],"app_summary":"Uncertain of his sister's fate, a boy enters LIMBO."},{"id":298,"app_name":"Miraculous Ladybug & Cat Noir","status":1,"app_developer_name":"CrazyLabs LTD","app_score":"4.4339037","app_category":"Action","group_label":"Action","app_package":"com.crazylabs.lady.bug","introduction":["Dive into the universe of Miraculous Ladybug & Cat Noir, an official and authentic superhero running game based on the popular TV show. Transform yourself into the famous superheroes and embark on a rescue mission in the gorgeous city of Paris. The city you adore is in danger and it's about time you step in, run through its beautiful streets, leap over obstacles, collect coins, and defeat villains. Unleash your inner superhero, preserve Paris from the malicious Hawk Moth and prove who is the real game-changer in town."],"app_summary":"Hey Miraculous Ladybug friends, collect them all in miraculous life running game"},{"id":299,"app_name":"Wordle!","status":1,"app_developer_name":"Lion Studios Plus","app_score":"3.9843552","app_category":"Word","group_label":"Word","app_package":"com.vottzapps.wordle","introduction":["Welcome to Wordle!, the brain-challenging word game that tests your vocabulary and wits! New for 2023, you can now play Together Mode and challenge your friends to a battle of wits. Whether you're a pro at crossword puzzles or just joining in on the viral word game trends, Wordle! is for you. This is not just your average word game, it is a daily brain teaser that trains your mind uniquely each day. Challenge your friends, take turns at guessing each other's word puzzles, engage in random matches, and race for the least number of guesses."],"app_summary":"Daily Word Search Puzzles"},{"id":300,"app_name":"MONOPOLY","status":1,"app_developer_name":"Marmalade Game Studio","app_score":"4.340282","app_category":"Board","group_label":"Board","app_package":"com.marmalade.monopoly","introduction":["Get ready to experience an all-time favorite board game, only this time on a whole new platform. The MONOPOLY app, developed by Marmalade Game Studio, brings the much-loved classic straight to your mobile device. Housing outstanding graphics and animations, it promises a fully immersive experience replicating the thrill of the real board game. With no ads, and including the full classic game, MONOPOLY lets you embark on the journey of becoming the ultimate property tycoon. Invite your friends and family to experience game nights like never before with this top paid game in the Play Store. From a variety of themed boards to numerous player pieces, the plethora of choices will keep you entertained and engaged."],"app_summary":"The Official Hasbro Family Board Game"},{"id":301,"app_name":"Paper.io 2","status":1,"app_developer_name":"VOODOO","app_score":"3.4329338","app_category":"Arcade","group_label":"Arcade","app_package":"io.voodoo.paper2","introduction":["Welcome to Paper.io 2, the ultimate gaming escapade from Voodoo! This game is all about conquering, competition and craving for more. Immerse yourself in a world where you draw your way to victory, claiming as much territory as possible before your opponents have a chance. Get ready to sweep the township and establish your dominance over the game. Engage in exciting challenges and surmount every obstacle that dares to impede your campaign. Paper.io 2 is not just a game, but a test of strategy, cunning and raw skills."],"app_summary":"A smooth drawing experience!"},{"id":302,"app_name":"Iron Marines 2 - Invasion RTS","status":1,"app_developer_name":"Ironhide Games","app_score":"4.5867767","app_category":"Strategy","group_label":"Strategy","app_package":"com.ironhidegames.android.ironmarines.invasion.rts","introduction":["Welcome to Iron Marines: Invasion. The epic sci-fi space real-time strategy (RTS) game developed by Ironhide. Dive into countless missions across unique universes and lead an army throughout thrilling challenges in vast cosmos. Experience a captivating action-filled storyline packed with strategic warfare, army combats, and formidable threats that will guide your marines across the galaxy.","In Iron Marines: Invasion, with the aid of tactical battle strategy, you'll defend the galaxy in unique space missions and thrilling special operations across new planets. Each battlefield provides its own terrain, style, action, adversaries, and conditions. Battle against alien enemies, massive armies, and fearsome alien beasts in electrifying RTS missions overflowing with strategic challenges."],"app_summary":"Lead epic space marines in a rts galaxy full of sci fi offline strategy games!"},{"id":303,"app_name":"Craft Shooter FPS Battles","status":1,"app_developer_name":"Sun Go Global Pte.Ltd.","app_score":"4.3490567","app_category":"Action","group_label":"Action","app_package":"com.htt.shooter.craft.tn","introduction":["Dive into the world of epic battles in a free-to-play shooting game - Craft Shooter FPS Battles. This intense and engaging battle simulator sees you either joining forces with fellow craftsmen to wage war against terrifying monsters, or play the role of the monster itself- hunting and terrorizing the craftsman. Craft Shooter FPS Battles offers both experiences wrapped in vivid graphics, thrilling gameplay, and immersive storytelling."],"app_summary":"Christmas edition! Pick your guns, shoot down monster enemies with Santa & Mices"},{"id":304,"app_name":"Knighthood - RPG Knights","status":1,"app_developer_name":"Midoki Roleplaying Games","app_score":"4.5424166","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.king.knightsrage","introduction":["Immerse yourself in Knighthood - RPG Knights, a fantastical role-playing game uniquely designed for the valiant at heart. The realm of Astellan beckons you; an epic journey awaits your knight, prepared to wield his gauntlet and brave the horrors that infest this land. Fierce monsters, cunning beasts, and enigmatic undead creatures will attempt to thwart your way. But fear not, for it's in the bones of your knight to fight, conquer and etch his name in this medieval saga."],"app_summary":"Become a medieval knight in this fantasy rpg game. Forge your knighthood!"},{"id":305,"app_name":"Make It Fly!","status":1,"app_developer_name":"TapNice","app_score":"4.3840623","app_category":"Casual","group_label":"Casual","app_package":"com.make.it.fly","introduction":["Unleash your creativity and challenge the laws of physics with Make It Fly! This unique gameplay marvel offers you a chance to step into the shoes of a master constructor, creating your own airplanes to complete thrilling missions in the sky. If you're a flight enthusiast or someone curious enough to test the boundaries of your imagination, Make It Fly! is the perfect playground to test your mettle. So, are you ready to take flight into the endless sky, engineer the most exceptional flying contraptions, and bring your most audacious inventing dreams to life?"],"app_summary":"Let your imagination and creativity fly wild! Construct amazing flying machines!"},{"id":307,"app_name":"Tap Away","status":1,"app_developer_name":"Popcore Games","app_score":"4.1752853","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.jctswbglsm.SwipeAway","introduction":["Tap Away, a fun and addictive 3D puzzle game brought to you by Popcore, masters of creating engaging puzzle games with over 250 million combined installs globally. This brain teaser of a game offers more than your standard puzzle experience - it takes you to the next level. Challenge your critical thinking and precision as you tackle increasing complex puzzles. The blocks take on varying forms and lay out in increasingly larger formations, stimulating your logic as you maneuver through the levels."],"app_summary":"Can you tap away all the blocks?"},{"id":308,"app_name":"Bubble Shooter: Panda Pop!","status":1,"app_developer_name":"Jam City, Inc.","app_score":"4.585769","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.sgn.pandapop.gp","introduction":["Plunge into a bubble-popping adventure with Bubble Shooter: Panda Pop! A captivating free game developed by Jam City, where the main goal is to pop those colorful bubbles and rescue cute pandas. This game takes your typical bubble pop game up a notch, with level upon level of exciting challenges that will test your skills and demand your attention, making it a must-play for avid puzzle-lovers and casual gamers alike.","As an exciting twist to traditional bubble shooter games, Panda Pop merges the best elements of match-three games with thrilling ‘save the panda’ objectives. Don’t be deceived! While the game may seem simple, its high-action levels, powered by a complex matching system, multiply the fun, capturing your attention for hours on end."],"app_summary":"Match 3: Shoot & Blast Bubbles"},{"id":309,"app_name":"Supreme Duelist Stickman","status":1,"app_developer_name":"Neron's Brother","app_score":"4.5630383","app_category":"Action","group_label":"Action","app_package":"com.Neurononfire.SupremeDuelist","introduction":["Dive into a world of action-packed hilarity with 'Supreme Duelist Stickman'! This mobile game is your perfect pit stop for a quick gaming session. It combines the elements of fun and challenge in a brilliant way. With its adrenaline-pumping battles and side-splitting stickman action, you're bound to get hooked in no time. Whether you're waiting for the bus, or having a short coffee break, 'Supreme Duelist Stickman' will keep you entertained. It's simple, exciting, and free to play. Wield your imaginary sword and start battling now in 'Supreme Duelist Stickman'!"],"app_summary":"Supreme Duelist Stickman  is a funny stick fight mobile game"},{"id":310,"app_name":"Get Color - Water Sort Puzzle","status":1,"app_developer_name":"ZephyrMobile","app_score":"4.7185044","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.zm.watersort","introduction":["Step into a world of relaxation and brain-teasing challenges with Get Color - Water Sort Puzzle. This game combines the tranquility of liquid simulation with the excitement of solving color-coded puzzles. Players will find themselves lost in a world of colorful vials and limitless water. Designed as a form of therapy, Get Color aims to expel negative thoughts and replace them with a bundle of bright hues. It’s not just a game, it’s a haven of peace that you can carry around in your pocket.","Get your share of this soothing experience by pouring colorful liquids into test tubes. The goal is simple: sort water, fill the bottles, and clear the levels! But don’t be fooled by the easy premise, it’s trickier than it looks! This test tube game is both addictive and calming, providing hours of stress-relief entertainment."],"app_summary":"Sort water in color tubes. Fill bottles in liquid sort puzzle. Tap to pour game!"},{"id":313,"app_name":"Botworld Adventure","status":1,"app_developer_name":"Featherweight","app_score":"4.558875","app_category":"Role Playing","group_label":"Role Playing","app_package":"com.featherweightgames.fx","introduction":["Embark on a breathtaking journey in Botworld Adventure, a strategic open-world game available on Google Play. Delve into a massive, vibrant world teeming with diverse characters, hidden treasures and bot battles waiting to be explored. As an adventurer, you have the freedom to navigate the lush forests and arid deserts, but be prepared to face unexpected challenges lurking around every corner."],"app_summary":"Battle your way through an Epic Open World RPG from the makers of Rodeo Stampede"},{"id":314,"app_name":"Cooking Frenzy®️","status":1,"app_developer_name":"DragonPlus Game Limited","app_score":"4.658875","app_category":"Strategy","group_label":"Strategy","app_package":"com.dragonplus.cookingfrenzy","introduction":["Ever dream of becoming a world-class chef and experiencing cuisines from every corner of the globe, all in one place? Look no further than Cooking Frenzy®️, an addictive, fast-paced cooking game that takes you on a gastronomic journey around the world. This game is more than just a basic kitchen restaurant scenario; it melds popular collecting and diner dash gameplay styles to serve up a deliciously different gaming experience.","A story unfolds as you embark on a quest to reclaim lost pieces of a treasured album of delicacies from renowned restaurants and famous gourmets around the world – all of whom are as passionate about exceptional cuisine as you are. It's feel-good fun in the form of a cookout diary with countless tasty levels to conquer and fantastic rewards to be won."],"app_summary":"Feel Crazy Cooking in Cooking Madness! Be the Cooking Chef,Open Restaurants!"},{"id":315,"app_name":"Last Shelter: Survival","status":1,"app_developer_name":"Long Tech Network Limited","app_score":"4.092978","app_category":"Strategy","group_label":"Strategy","app_package":"com.more.dayzsurvival.gp","introduction":["Welcome to the world of Last Shelter: Survival, a man-eat-man zombie apocalypse strategy game published by More.dayzsurvival.gp! Here, you will either survive the lawless world of post-apocalypse or be doomed to join the shambling hordes. Aspiring to greatness, you gather survivors, collect resources, and construct your base amidst the bleak ruins of a once-great civilization. With a gripping narrative that unfolds as you progress, Last Shelter: Survival offers an in-depth gaming experience that may chill your spine, yet keep you hooked."],"app_summary":"The Zombies are coming, the last shelter is almost in ruins,rebuild and survive!"},{"id":393,"app_name":"Bounce Ball 6: Roller Ball 6","status":1,"app_developer_name":"Great Arcade Games","app_score":"4.299145","app_category":"Arcade","group_label":"Arcade","app_package":"com.dmobin.ball.hero","introduction":["If you're a fan of fun puzzle adventure games, get ready to immerse yourself in the thrilling world of Bounce Ball 6: Roller Ball 6! This captivating game offers an exciting and engaging gameplay experience that keeps you on your toes. As the newest addition to the Bounce Ball series, it has refined the winning formula that made earlier entries so successful. In this game, you control a red bouncy ball on a quest to rescue the world. As you roll, jump, and bounce through each level, you'll need to outwit enemies and dodge deadly laser beams. Whether you're a casual player or a hardcore gamer, you're sure to find this game's blend of easy controls and challenging adventures highly addictive."],"app_summary":"Roll, jump and bounce through the obstacles in the ball adventure"},{"id":400,"app_name":"Draw Joust!","status":1,"app_developer_name":"VOODOO","app_score":"4.4349194","app_category":"Action","group_label":"Action","app_package":"ru.galya.drawjoust","introduction":["Draw Joust! is an exciting, addictive, and competitive action game available on Google Play. Players get to design and build their very own custom ride, coupled with offensive and defensive mechanisms, all with the prime purpose of firmly defeating their opponent in a gripping jousting showdown. The goal? to become the reigning champion of the tourney. It's a fusion of creativity, strategy, and action-filled gameplay that keeps you on your toes, wondering what your opponent will create next and how you can outwit them with your very own ingenious designs."],"app_summary":"Draw the strongest cart!"},{"id":403,"app_name":"Gangster City: Hero vs Monster","status":1,"app_developer_name":"Amobear Studio","app_score":"4.2649574","app_category":"Simulation","group_label":"Simulation","app_package":"com.real.gangster.crime.city.vegas","introduction":["Step into the world of Gangster City: Hero vs Monster, a pulsating universe teeming with chaos, crime, and a force to be reckoned with - you! Amidst the dark recesses of the city's criminal underworld, you embark on a thrilling journey to rise as the ultimate Gangster Hero. Face off against monstrous adversaries in epic battles, undertake daring missions, and quench your thirst for adrenaline! Your quest for dominance is a masterpiece of strategic planning and skillful execution. Unearth the city's darkest secrets, and in doing so, shape your destiny and that of Gangster City."],"app_summary":"Welcome to open world of Crime city with gang wars, the Gangster City"},{"id":404,"app_name":"Crazy Quiz","status":1,"app_developer_name":"ZANORG","app_score":"4.3448277","app_category":"Trivia","group_label":"Trivia","app_package":"air.com.zanorg.crazyquiz","introduction":["Immerse yourself in the fun and challenging world of Crazy Quiz! An app like no other, Crazy Quiz is not just a game but a thrilling brain teaser designed to test all facets of your wits. With up to 100 levels of general knowledge riddles, skill questions, reflex tests, and memory games, the quiz brings an exciting variation to traditional trivia games. Every level differs, adding a sense of surprise and an element of the unknown. Just when you think you’ve got the hang of it, Crazy Quiz keeps you guessing and offers you a whole new level of challenge."],"app_summary":"Can you complete the 100 levels without turning mad?"},{"id":405,"app_name":"Cut the Rope 2","status":1,"app_developer_name":"ZeptoLab","app_score":"4.3616953","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.zeptolab.ctr2.f2p.google","introduction":["Cut the Rope 2 is a legendary sequel in the world-renowned logic puzzle game series by ZeptoLab. This game spins around the adventures of Om Nom, an adorable green creature that is candy-centric. Here, you get to embark on an exciting journey that spans over 160 challenging levels. Navigate through forests, cities, junkyards, and subterranean tunnels, all in search of one thing - CANDY! This game maintains its casual phenomenon appeal while posing fresh and mind-boggling challenges that both children and adults will enjoy."],"app_summary":"Play Cut the Rope 2 for new great adventures with Om Nom and his friends!"},{"id":407,"app_name":"Merge War: Monster vs Cyberman","status":1,"app_developer_name":"UltraPub","app_score":"3.6571429","app_category":"Arcade","group_label":"Arcade","app_package":"com.toilet.fusion.ng","introduction":["Merge War: Monster vs Cyberman is a captivating strategy game that will take you into a world of fierce battles and mighty monsters. In this deadly arena, you will become a Survival King, creating and merging the most potent monsters to form the strongest army to claim victory. Just like other exciting merging games like Dino Merge, Dragon Merge, Superhero Merge, Merge Poke, and more, your task is essentially to merge monsters, power up, and take down your enemies."],"app_summary":"Monsters are approching. Combine and upgrade army of cyberman"},{"id":408,"app_name":"Boom Beach","status":1,"app_developer_name":"Supercell","app_score":"4.468763","app_category":"Strategy","group_label":"Strategy","app_package":"com.supercell.boombeach","introduction":["Welcome to the immersive world of Boom Beach, a captivating combat strategy game presented by Supercell, the renowned developers. Set against the backdrop of a vibrant tropical paradise, Boom Beach lets you battle against the nefarious Blackguard, using both brains and brawn. Your primary objective is to liberate enslaved islanders by attacking the enemy bases and unveiling the mysteries embedded within the island. You can also unite with players worldwide and form an unbeatable Task Force to amplify your strength against the enemy."],"app_summary":"Storm the beach and win the day!"},{"id":410,"app_name":"Horizon Chase – Arcade Racing","status":1,"app_developer_name":"Aquiris Game Studio S.A","app_score":"4.4237957","app_category":"Racing","group_label":"Racing","app_package":"com.aquiris.horizonchase","introduction":["Rediscover the era of 16-bit graphics with Horizon Chase – Arcade Racing, a tribute to classic racing games of the 80s and 90s. Unleash your nostalgia with this addictive game that perfectly encapsulates the charm of bygone days. The brilliance of this game is in its brilliant mix of old and new, keeping players hooked lap after lap. Horizon Chase is not only a racing game - it's a journey around the world, with tracks set in stunning locations full of natural beauty."],"app_summary":"Drag, Drift & Speed! Race now!"},{"id":411,"app_name":"My Talking Hank","status":1,"app_developer_name":"Outfit7 Limited","app_score":"4.1024146","app_category":"Casual","group_label":"Casual","app_package":"com.outfit7.mytalkinghank","introduction":["From the creators of worldwide hits like My Talking Tom and My Talking Angela, comes an all-new virtual pet adventure – My Talking Hank. This app has been downloaded over 15 BILLION times and enjoys tremendous popularity around the globe. In this latest free app, you get to adopt Hank, an adorable puppy with a love for photography and affinity for all things Hawaiian. You will help Hank in his charming journey of exploring the beautiful islands of Hawaii and capturing the unique wildlife on his camera. Hank is eager and ready for adventure; he just needs you by his side!"],"app_summary":"From Talking Tom and Friends - adopt Talking Hank, the cutest puppy out there!"},{"id":412,"app_name":"Cooking Fever: Restaurant Game","status":1,"app_developer_name":"Nordcurrent Games","app_score":"4.3923645","app_category":"Arcade","group_label":"Arcade","app_package":"com.nordcurrent.canteenhd","introduction":["Cooking Fever: Restaurant Game is an engrossingly addictive time-management game that will challenge your cooking and service skills. In your very own restaurant, you will cook delicious meals and desserts from various cuisines all around the globe, discover unique locations and restaurants, and unlock hundreds of tantalizing recipes to prepare and serve. Not only will you be learning different food preparation techniques, but you'll also get to attract more clients by decorating your restaurant and offering freebies for a more personalized customer experience. This game is just as addictive and engrossing as a never-ending fever!"],"app_summary":"Cook delicious meals and desserts from all over the world!"},{"id":413,"app_name":"Perfect Time - ASMR Chill Game","status":1,"app_developer_name":"MOONEE PUBLISHING LTD","app_score":"4.059754","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.recreationslab.perfecttime","introduction":["Introducing Perfect Time - ASMR Chill Game, a wonderful solution for those searching for stress relief games or just a sublime time killer to unwind. Challenge your reflexes, indulge in relaxing ASMR puzzles, consume idle time, and relax. Unique in its approach, this level-based game is packed with simple ASMR puzzles, each demanding your timing and focus. They're easy to play, but how many levels can you truly conquer? Test your grasp on precision and your ability to tap at the right moment. With each level, brace yourself for heightened difficulty."],"app_summary":"Addicting ASMR puzzles. Relax & test your reaction in mini stress relief games."}]
