[{"id":120,"app_name":"Legacy of Discord-FuriousWings","status":1,"app_developer_name":"Yoozoo (Hongkong)","app_score":"3.9745905","app_category":"Action","group_label":"Action","app_package":"com.gtarcade.lod","introduction":["Dive into the exciting world of Legacy of Discord-FuriousWings, an action-packed real-time RPG where you can step into the shoes of a Greek god. This is not just a game; it's a fantasy world that allows you to explore vast dungeons, battle epic bosses, and conquer the skies, all while playing alongside friends and making your mark on the global leaderboard. Don't just be a warrior, become the God of War!"],"app_summary":"EMBRACE next generation of ACTION RPGs, now with Transform!"},{"id":85,"app_name":"Earn to Die","status":1,"app_developer_name":"Not Doppler","app_score":"4.7095733","app_category":"Racing","group_label":"Racing","app_package":"com.notdoppler.earntodie","introduction":["Immerse yourself in the world of Earn to Die, a thrilling mobile game that pits you against a horde of zombies in a post-apocalyptic world. Find yourself stranded in a barren desert amidst bloodthirsty zombies with nothing but a dilapidated car and scant cash. Your mission? Drive through the undead to get out alive. With over 200 million plays online, this revamped mobile version brings the excitement, fear and adrenaline rush right to your fingertips. Buckle up for a ride of your life!","Combine action, driving and strategic upgrades to enhance your zombie-fighting experience. Earn cash to upgrade your car, unlock and customize new vehicles. Beef up your armor, mount deadly weapons, or install boosters - do whatever it takes to survive the apocalypse."],"app_summary":"Can you survive the zombie apocalypse? Choose your car and smash those zombies!"},{"id":86,"app_name":"Five Nights at Freddy's 2","status":1,"app_developer_name":"Clickteam USA LLC","app_score":"4.673523","app_category":"Strategy","group_label":"Strategy","app_package":"com.scottgames.fnaf2","introduction":["Five Nights at Freddy's 2 is the second installment of the popular horror game series, remastered from the PC version for your mobile device. It welcomes you back to the updated Freddy Fazbear's Pizza. The game combines elements of horror with challenging gameplay, designed to test both your courage and wit. The once-old animatronics are now joined by a whole new cast of high-tech and kid-friendly characters that promise to entertain everybody through the night. With improved facial recognition technology and links to local criminal databases, they promise a safe time... or do they?"],"app_summary":"No place to run, and exactly one place to hide."},{"id":88,"app_name":"Cut the Rope","status":1,"app_developer_name":"ZeptoLab","app_score":"4.4753366","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.zeptolab.ctr.ads","introduction":["Embrace the action-packed journey in 'Cut the Rope', the first installment of an enthralling logical puzzle series. This award-winning, physics-based game is all about a little monster named Om Nom. Stumble upon a mysterious box and help Om Nom satisfy his sweet tooth for candy! It's a game loved by millions across the globe, so jump in now and let the fun begin!"],"app_summary":"Cut the Rope, catch a star, and feed Om Nom candy in this award-winning game!"},{"id":89,"app_name":"60 Seconds! Atomic Adventure","status":1,"app_developer_name":"Robot Gentleman","app_score":"4.1236444","app_category":"Adventure","group_label":"Adventure","app_package":"com.robotgentleman.game60seconds","introduction":["Take on the role of Ted, a responsible citizen and a family man confronted by the nuclear apocalypse in the gripping game, 60 Seconds! Atomic Adventure! With a mere minute to make a dash through Ted's house, you're tasked with picking out useful supplies and finding family members before the atomic bomb impacts. The challenge only accelerates from there as you enter the fallout shelter and begin the real test of survival in this suburban nightmare, each survival story unfolding differently with unexpected events."],"app_summary":"Dark comedy of scavenge and survival in the nuclear wasteland of 1950's America"},{"id":193,"app_name":"Grand Theft Auto: San Andreas","status":1,"app_developer_name":"Rockstar Games","app_score":"3.9713964","app_category":"Action","group_label":"Action","app_package":"com.rockstargames.gtasa","introduction":["Grand Theft Auto: San Andreas is a gripping, action-packed mobile game set amidst the turmoil of 1990's San Andreas. This release by Rockstar Games drops protagonist Carl Johnson in the middle of a city ravaged by gang trouble, drugs, and corruption. His triumphant return to save his family plunges gamers into an open-world of heated street battles, crime and high-stakes adventure. With gangsters and corrupt cops around every corner, players must navigate their way across three major cities in their bid to regain control of the streets."],"app_summary":"Rockstar Games brings its biggest release to mobile yet."},{"id":205,"app_name":"Top War: Battle Game","status":1,"app_developer_name":"Topwar Studio","app_score":"2.6821513","app_category":"Strategy","group_label":"Strategy","app_package":"com.topwar.gp","introduction":["Step into the thrilling world of Top War: Battle Game, where Tyrants rule and the future looks bleak. Amidst constant battles and widespread despair, it's up to you, the brave and tactical commander, to bring back hope. The game brings together an engaging storyline, hard-hitting action, and top-notch strategy, giving it a high replay value. The visually stunning graphics, immersive universe, countless upgrade options, and cross-server warfare make Top War: Battle Game one of the most compelling strategic war-games in the Google play store."],"app_summary":"Merge to upgrade! An innovative strategy war game! Join us in this Top War"},{"id":425,"app_name":"Baldi's Basics Classic","status":1,"app_developer_name":"Basically, Games!","app_score":"4.1319084","app_category":"Strategy","group_label":"Strategy","app_package":"com.BasicallyGames.BaldisBasicsClassic","introduction":["Dive into the deceptively simple world of Baldi's Basics Classic, a game inspired by the eerie edutainment titles of the 1990s. This horror-themed adventure is bizarrely entertaining with a retro aesthetic that belies its cunning gameplay. Its meta narrative lacks any genuine educational substance but skillfully presents an intriguing, strategic experience that will test your problem-solving skills to the limit.","Your mission, should you choose to accept it, is to collect seven notebooks from within a labyrinth-like school while trying to evade the relentless Baldi. This unpredictable AI adversary becomes faster and more formidable the more notebooks you manage to gather, making Baldi's Basics an increasingly frenetic and challenging quest of wits and strategy."],"app_summary":"The original version of Baldi's Basics - A horror, edutainment parody game"},{"id":195,"app_name":"Teach Your Monster to Read","status":1,"app_developer_name":"Teach Your Monster","app_score":"4.0977445","app_category":"Educational","group_label":"Educational","app_package":"com.teachyourmonstertoread.tmapp","introduction":["Teach Your Monster to Read is an innovative, award-winning children's game that transforms the process of learning to read into an exciting adventure. Developed in association with University of Roehampton academics, this app is designed to cultivate early reading skills in kids aged 3-6. With over 30 million users around the world, it proves learning can be great fun. In this magical journey, kids can create their own unique monsters and meet a host of colourful characters, making reading a truly engaging experience."],"app_summary":"The kids phonics and reading app that's helped millions of kids learn to read"},{"id":399,"app_name":"Solar Smash","status":1,"app_developer_name":"Paradyme Games","app_score":"4.492864","app_category":"Simulation","group_label":"Simulation","app_package":"com.paradyme.solarsmash","introduction":["Venture into the cosmos with the fascinating sanctuary-simulation game, Solar Smash. The game facilitates armchair astronauts with the power to create celestial bodies or decimate them. Players can command the forces of the cosmos, perform cosmic destruction, and embark upon a journey of building their own universe, ranging from a planets to shining constellations."],"app_summary":"The Ultimate Cosmic Destruction Simulator"},{"id":196,"app_name":"Archero","status":1,"app_developer_name":"Habby","app_score":"4.326524","app_category":"Action","group_label":"Action","app_package":"com.habby.archero","introduction":["Dive into the whimsical world of Archero, a unique action RPG game where your existence is constantly threatened! You are the solitary Archer, the world's sole hope against the waves of incoming evil forces. Each step you take, each fight you engage in, is a matter of life and death as you are pitted against never-ending horde of your enemies. The only way to survive is to continuously stack up powerful skills. Beware, once you die, there's no way back but to start from scratch. With millions of unique skill combinations at your disposal, you are expected to face monstrous creatures and mind-blowing obstacles in an array of different worlds."],"app_summary":"Invincible weapons, Unlimited upgrades!"},{"id":197,"app_name":"Water Sort - Color Puzzle Game","status":1,"app_developer_name":"IEC Global Pty Ltd","app_score":"4.5463686","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.gma.water.sort.puzzle","introduction":["Step into an experience that is both fun and challenging with Water Sort - Color Puzzle Game. It's an addictive puzzle game that lets you dive into a world of colorful splashes and cunning sort tactics. Featuring vibrant colors, brain-exercising challenges, and multi-level gameplay, this game isn't just about having fun—it's about refining your problem-solving skills in a vibrant, dynamic setting. Perfect for idle times, or to fill up a short break, it provides a visual feast of colors that will definitely make your every move count, one color at a time."],"app_summary":"How smart are you?"},{"id":148,"app_name":"Heads Up!","status":1,"app_developer_name":"Warner Bros. International Enterprises","app_score":"3.3917084","app_category":"Word","group_label":"Word","app_package":"com.wb.headsup","introduction":["Heads Up! is a fun and hilarious game created by Ellen DeGeneres. It's a sensation that has been commended by several publications, including The New York Times and Cosmopolitan. This game is all about guessing words from clues given by friends, which makes it an excellent choice for gatherings, parties, and even online meet-ups on platforms like Zoom. If you love playing charades or naming celebrities, you're sure to have an absolutely fantastic time with Heads Up! There's nothing quite like guessing words from your friend's frantic clues while a timer ticks down, inducing fits of laughter all around."],"app_summary":"Play the best charades game, perfect for game night!"},{"id":149,"app_name":"Survivalcraft 2","status":1,"app_developer_name":"Candy Rufus Games","app_score":"4.2890368","app_category":"Adventure","group_label":"Adventure","app_package":"com.candyrufusgames.survivalcraft2","introduction":["Survivalcraft 2 is an immersive and compelling survival game where players are marooned on the shores of an infinite blocky world. The game offers an unparalleled sandbox experience with virtually limitless possibilities for exploration, crafting, and construction. Players must mine resources, craft tools and weapons, make traps, grow plants and build shelters to survive against the harshness of the game's world, while also hunting and foraging for food and resources. Whether you're dodging predators, blowing up rock formations, crafting custom furniture or simply taking in the vast blocky landscapes, Survivalcraft 2 is a thrilling blend of survival and creativity that promises endless hours of challenging and rewarding gameplay."],"app_summary":"Explore infinite world and survive in a realistic environment full of animals."},{"id":424,"app_name":"Good Pizza, Great Pizza","status":1,"app_developer_name":"TapBlaze","app_score":"4.638722","app_category":"Casual","group_label":"Casual","app_package":"com.tapblaze.pizzabusiness","introduction":["Take a plunge into the world of pizza and run your own shop in Google Play’s newest pizza-themed game, Good Pizza, Great Pizza! Brought to you by TapBlaze, this captivating game gives players a genuine vibe of what it feels like to operate a pizza shop. Strive to meet the demands of your customers and make sufficient money to keep your restaurant functioning. Show off your competitive spirit and up your game by introducing new toppings, improving your restaurant ambience, and upgrading your kitchen equipment, to outshine your arch-rival, Alicante."],"app_summary":"Become the pizza master in this fun cooking game!"},{"id":198,"app_name":"Pocket Build","status":1,"app_developer_name":"MOONBEAR","app_score":"4.25381","app_category":"Simulation","group_label":"Simulation","app_package":"moonbear.PocketBuild","introduction":["Step into the magical realm of creation with Pocket Build! This open-world sandbox game lets players unleash their imagination in the ultimate building experience. Want to construct your fantasy castle? Or perhaps you dream of developing a bustling city? With Pocket Build, you can realize these visions and more. The only true limit is your creativity. Whether you're an expert designer or a simple hobbyist, this pocket-friendly building game guides you in designing and simulating your dream world, ensuring an exciting, limitless experience from start to finish."],"app_summary":"Build an open 3D world in this unlimited sandbox building game!"},{"id":199,"app_name":"Minion Rush: Running Game","status":1,"app_developer_name":"Gameloft SE","app_score":"4.5737424","app_category":"Casual","group_label":"Casual","app_package":"com.gameloft.android.ANMP.GloftDMHM","introduction":["It's time to lace up your sneakers, embark on a wildly hilarious and daring journey with Illumination, Universal, and Gameloft's Minion Rush: Running Game. This despicably fun, endless running game has you scampering through a myriad of funky locations. Think quick and run fast to dodge devilish traps, face off against vile villains, and collect handfuls of shining, delectable Bananas. The vibrant colors and slick animation bring these delightful characters to life and provide an aesthetically pleasing gaming experience. And the best part? You can enjoy all these features offline, anytime, anywhere."],"app_summary":"Official Minions and Despicable Me endless runner game"},{"id":200,"app_name":"Pou","status":1,"app_developer_name":"Zakeh","app_score":"4.4121284","app_category":"Casual","group_label":"Casual","app_package":"me.pou.app","introduction":["Are you ready for a unique pet-keeping experience? Enter the world of Pou - an app where you are tasked to take care of your very own alien pet. Reminiscent of the feel of nostalgic digital pet games, Pou offers a fresh spin, providing a bewildering array of features to keep you hooked. Not only do you feed your Pou, clean it and play with it, but you also watch it grow and evolve in a delightful, ever-changing environment. It's not just about the challenges of raising a pet; it's also about the journey of witnessing its transformation."],"app_summary":"Think you have what it takes to adopt a POU?"},{"id":153,"app_name":"Z Escape - Zombie Machine Gun","status":1,"app_developer_name":"Homa","app_score":"4.158934","app_category":"Action","group_label":"Action","app_package":"com.yorfstudio.sea","introduction":["Z Escape - Zombie Machine Gun is a high-stakes real-time strategy game that guarantees thrilling gameplay for everyone. The game challenges you to rescue your team from the onslaught of the walking dead. You are provided with a Gatling machine gun attached to a helicopter and your mission is to paint the town dead. The challenge lies in strategizing and making quick decisions to block the path of the zombies and save your team. Be warned! The zombies are deceased, they run fast, and they're hungry. So, every shot counts in your quest to become the best helicopter sniper."],"app_summary":"Rescue the squad using the cannon on the helicopter. City takeover running games"},{"id":320,"app_name":"Triple Match 3D","status":1,"app_developer_name":"Boombox Games LTD","app_score":"4.517604","app_category":"Puzzle","group_label":"Puzzle","app_package":"com.master.triple3d.find","introduction":["If you're looking for the perfect way to pass the time and exercise your brain, look no further than Triple Match 3D! This puzzle matching game offers a unique and thrilling 3D gaming experience. By providing a variety of levels and challenges, it guarantees hours of enjoyment and entertainment. Whether you're on a long car ride or waiting in line, Triple Match 3D will keep you engaged and help hone your matching skills. The game is also a great tool for brain training and improving your sorting abilities. Download now and step into a vibrant and addictive world of matching puzzles."],"app_summary":"Tap, find & match tiles & become a master of triple 3d matching puzzles!"},{"id":91,"app_name":"STAR WARS™: KOTOR II","status":1,"app_developer_name":"Aspyr Media, Inc.","app_score":"4.144231","app_category":"Adventure","group_label":"Adventure","app_package":"com.aspyr.swkotorii","introduction":["Step into a galaxy far, far away with STAR WARS™: KOTOR II. This epic narrative-driven RPG transports you five years after the award-winning story of Star Wars® Knights of the Old Republic™. The Sith Lords, on the brink of demolishing the Old Republic, have pushed the Jedi to the precipice of extinction. With the Jedi Order crumbled, salvation lies in a lone Jedi seeking to reestablish their bond with the Force. Embrace this grand quest and brace yourself to face the most profound decision of the galaxy - side with the illumination, or yield to the encroaching darkness.","During this gripping saga, you'll wrestle with personal destiny and the fate of the galaxy at large. The choices you decide upon will not only shape your personal narrative but also ripple out, influencing your party members and those who might join you on this interstellar crusade."],"app_summary":"The classic Star Wars RPG is now available on Android!"},{"id":163,"app_name":"Monster Legends","status":1,"app_developer_name":"Social Point","app_score":"4.5771666","app_category":"Strategy","group_label":"Strategy","app_package":"es.socialpoint.MonsterLegends","introduction":["Enter the thrilling world of Monster Legends, a strategic adventure game where you can breed and train monsters of all elements and rarities. Discover a universe filled with exciting battles and challenges as you build a city for your monsters and strategize your way to victory. Monster Legends is not only about power—it's about strategy and cunning. It's a game that offers a unique mixture of RPG progression, real-time multiplayer battles, and a dash of creativity as you create a paradise for your monsters."],"app_summary":"Breed, collect and feed monsters... Then fight in PvP battles! All in one game"},{"id":164,"app_name":"West Game","status":1,"app_developer_name":"Lexiang","app_score":"4.323545","app_category":"Strategy","group_label":"Strategy","app_package":"leyi.westgame","introduction":["Set in America's ruthless and chaotic era of the Wild West in 1865, 'West Game' offers an quintessential strategy game that adds an extra sprinkle of excitement. Aspiring to be crowned king of the West, players build their own towns, form their own gangs and fight against players worldwide. Gorgeous graphics combined with dramatic storytelling provide an immersive western environment that makes you feel like you're right in the thick of things. From high-risk deception to bruising battles, this game perfectly encapsulates everything a western fan would expect - but beware, because in the Wild West, there are no rules!"],"app_summary":"The Old West theme SLG game."},{"id":92,"app_name":"World War Heroes — WW2 PvP FPS","status":1,"app_developer_name":"Azur Interactive Games Limited","app_score":"4.5267663","app_category":"Action","group_label":"Action","app_package":"com.gamedevltd.wwh","introduction":["Step into the battlefield of the World War II era with the World War Heroes - WW2 PvP FPS. This online first-person shooter game brings the excitement and chaos of WWII to your mobile device, offering a thrilling gaming experience. Players can engage in intense battles against players worldwide in real time! Get ready to destroy enemies and survive in tank battles in iconic cities like Berlin. Participate in various modes like team and deathmatch battles, plant bombs, defend your HQ and be a part of massive warfare."],"app_summary":"Legendary frist person shooter with players around the world! Thrilling battles!"},{"id":93,"app_name":"Bleach:Brave Souls Anime Games","status":1,"app_developer_name":"KLab","app_score":"4.0604296","app_category":"Action","group_label":"Action","app_package":"com.klab.bleach","introduction":["Are you a fan of the hit BLEACH universe? Get ready to buckle up for an immersive role-playing experience in the form of the Bleach: Brave Souls Anime Game. With over 80 million downloads worldwide, this 3D hack-and-slash action RPG brings the celebrated manga and TV anime series to life right at the tip of your fingers. From the human-populated World of the Living to the Soul Society, traverse across multiple thrilling universes."],"app_summary":"Enjoy action RPG anime games of BLEACH!"},{"id":94,"app_name":"Getting Over It","status":1,"app_developer_name":"Noodlecake","app_score":"3.6728394","app_category":"Simulation","group_label":"Simulation","app_package":"com.noodlecake.gettingoverit","introduction":["Getting Over It with Bennett Foddy is a unique and challenging climbing game deliberately crafted to provide a rigorous test of your patience and resilience - essentially a game that is designed to hurt you. As a tribute to Jazzuo's 2002 B-Game classic 'Sexy Hiking', this game pushes the barriers of traditional gaming. The game revolves around climbing a colossal mountain using just a hammer and a pot. As brutally difficult as it may sound, reaching the summit rewards you with great mysteries and profound satisfaction."],"app_summary":"I made a game for a certain kind of person. To hurt them."},{"id":98,"app_name":"State of Survival: Zombie War","status":1,"app_developer_name":"FunPlus International AG","app_score":"4.306273","app_category":"Strategy","group_label":"Strategy","app_package":"com.kingsgroup.sos","introduction":["Step into the grim world of State of Survival: Zombie War, a post-apocalyptic RPG that pits you against hordes of the undead. Set six months after the outbreak of a deadly virus, society has crumbled, and the zombie infestation is rampant. You'll need your wits, strategy, and formidable firepower to eradicate these undead threats and establish a new order. The Survival State is more than just a game; it's a gripping narrative of human resilience and determination. Delve into spine-chilling missions, form alliances, and yield an army to reclaim the world. It's all about building, survival, and most importantly, challenging the terror that lurks in the shadows."],"app_summary":"Survive the Zombies War in this RPG game of Apocalypse and Survival"},{"id":207,"app_name":"Tomb of the Mask","status":1,"app_developer_name":"Playgendary Limited","app_score":"4.4743094","app_category":"Action","group_label":"Action","app_package":"com.playgendary.tom","introduction":["Dive into the mysterious and thrilling world of Tomb of the Mask, an arcade game that promises endless excitement. This game offers an unique journey of exploration, where you can encounter the intriguing tomb and discover the extraordinary mask. Let the mask empower you with the ability to climb walls with exceptional speed and agility. Unfolding in an infinite, procedurally generated vertical labyrinth, Tomb of the Mask presents a new adventure at every turn and leaves you clamoring for more."],"app_summary":"Addictive tomb labyrinth. Time limit and lava are advancing — go only up!"},{"id":208,"app_name":"Kick the Buddy","status":1,"app_developer_name":"Playgendary Limited","app_score":"4.2669945","app_category":"Action","group_label":"Action","app_package":"com.playgendary.kickthebuddy","introduction":["Get ready to literally kick stress out of your world with Kick the Buddy! This engaging and interactive game, now available on Google Play, is designed to serve as a stress buster for those times when life gets a little overbearing. Given an almost unlimited arsenal of weapons ranging from rockets and automatic rifles to grenades and even a nuclear bomb, your job is to punish a ragdoll in every way you can imagine. Not only is this game an effective stress reliever, but it's also an absolute blast when it comes to passing time."],"app_summary":"Smash and hit the buddy in our stress-relief game. Unlimited weapon arsenal."},{"id":322,"app_name":"Bazooka Boy","status":1,"app_developer_name":"Supersonic Studios LTD","app_score":"4.1465917","app_category":"Action","group_label":"Action","app_package":"com.Lightneer.BazookaBoy","introduction":["Ready to embark on a mission of explosive fun? Bazooka Boy is a puzzle-action game that is sure to keep you entertained! Light up your way through a countless number of levels, blasting anything and everything that dares to stand in your way. With a remarkable arsenal of weapons for you to collect and master, each with its unique strengths, prepare yourself for a thrilling adventure. This game is not just about sending your enemies flying, but about causing massive destruction, exploding enemy bases and crushing their buildings. It's all about the balance of strategy and power, offering you limitless possibilities to claim your victory.","Bazooka Boy's exhilarating game play is paired with extraordinary physics and dazzling exploding effects, making each level a distinct puzzle to solve. Can you navigate through them all without blowing yourself up with a faulty shot? Each victory promises a satisfying destruction and tons of enjoyment."],"app_summary":"Blast your way to victory and wipe out the enemies with crazy fun explosions!"},{"id":167,"app_name":"Badland Brawl","status":1,"app_developer_name":"HypeHype Inc.","app_score":"4.145853","app_category":"Strategy","group_label":"Strategy","app_package":"com.frogmind.badlandbrawl","introduction":["Winning Google Play's Best of 2018 and other prestigious mobile gaming awards, Badland Brawl is an explosive multiplayer brawler that delivers epic action packed with unique physics-based gameplay. This interactive app transports players into the award-winning BADLAND universe where they can battle with friends and players across the world, foster their strategic skills, and experience an all-round immersive gameplay experience."],"app_summary":"Set up your team 🔥, choose your tactic ⚔  and brawl towards the victory 🏆"}]
